{
  "id": "041a98657fde793c6eac345dcd74ddbe8af3f37d",
  "url": "https://www.ech.nl/elementor-hf/footer/",
  "title": "ECH - Elektronische Communicatie Hypotheken",
  "text": "ECH - Elektronische Communicatie Hypotheken Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Wij zijn ECH Dé digitale brievenbus voor de communicatie tussen notarissen en hypothecair financiers Info voor notarissen Info voor hypothecair financiers Scroll naar beneden voor meer informatie Digitale brievenbus Dit is hoe ECH werkt Over ECH Stichting ECH, dat staat voor Elektronische Communicatie Hypotheken, fungeert als de berichtenstandaard tussen het notariaat en hypothecair financiers. ECH is een branche-initiatief zonder winstoogmerk en opereert vanuit een onafhankelijke positie. De dienstverlening van de stichting heeft primair betrekking op de processen rondom het verlenen, vestigen en beëindigen van het recht van hypotheek. Binnen de diensten van ECH is het ook mogelijk om een bankgarantie te versturen. Mede dankzij de toegekende SOC 2-certificering zijn betrokken partijen verzekerd van een veilige, professionele afhandeling van hun dossiers. Dat blijkt ook uit de cijfers: 99% van de notarissen is aangesloten en circa 50% van de vastgoedtransacties verloopt via het ECH-platform. Onze werkgroepen spelen een belangrijke rol bij het succes van ECH. Wil je ook actief een bijdrage leveren? Lees hier dan verder. De voordelen van ECH Zo helpen we jou verder Kwaliteit door uniformiteit Duidelijke afspraken zijn de basis voor succes. De digitale gegevensuitwisseling vindt plaats volgens de ECH-berichtenstandaard. Dat heeft als groot voordeel dat alle betrokken partijen alle relevante gegevens uniform, compleet én binnen de afgesproken tijdslijnen met elkaar uitwisselen. En dat allemaal via de digitale brievenbus van ECH. Snelheid door STP Snel door Straight Through Processing (STP). Geautomatiseerde processen staan garant voor continuïteit in de informatiestroom. Deze werkwijze verhoogt de snelheid en de kwaliteit van de uit te voeren werkzaamheden. Als enige volledig up-to-date ECH is als enige partij realtime verbonden met de bronbestanden van de KNB. Daardoor beschikken we altijd over de meest actuele gegevens (NAW en derdengeldenrekeningen) van alle notariskantoren in Nederland. Veiligheid is onze topprioriteit Veiligheid en betrouwbaarheid zijn onmisbare termen in de financiële wereld. De aan ons toegekende SOC 2-verklaring onderbouwt de kwaliteit van ECH juridisch en onafhankelijk. ECH is ketenregisseur Stichting ECH brengt ketenpartijen bij elkaar. Als ketenregisseur nemen we graag het voortouw in het maken van standaardafspraken en uniforme werkwijzen. Daarbij spelen het resultaat, maar ook het actief faciliteren daarvan een belangrijke rol. Totale efficiency Alle genoemde voordelen samen borgen een aantoonbaar en bewezen uiterst snelle procesdoorloop, tegen de laagst mogelijke kosten en met de hoogst haalbare kwaliteit als standaard. Werkgroepen ECH brengt de aangesloten hypothecair financiers en notariskantoren bij elkaar in de vorm van verschillende werkgroepen. Ook de diverse softwareleveranciers worden hierbij betrokken. Tijdens deze bijeenkomsten worden actuele (keten)thema’s met elkaar besproken en procesafspraken gemaakt. Meer informatie Wat onze klanten zeggen Jolanda de Heer, Area Lead Rabobank & Bestuurslid ECH Stichting ECH staat voor mij voor betrouwbaar, korte lijnen en afspraak is afspraak. Dorien Bartels, Manager Customer Care Van Brug Software Door slimme oplossingen zorgen we er samen voor dat het notariaat en geldverstrekkers zoveel mogelijk ontlast worden. Mét een tevreden klant als eindresultaat. Hans Kuijpers, directeur van de KNB Het is tijd voor verandering en optimalisatie, en dat in de breedste zin van het woord. Nieuws Onze laatste nieuwsberichten Bekijk alle nieuwsberichten 12 juni 2025 Goed nieuws: de Volksbank is nu aangesloten op het ECH-proces voor bankgaranties! Lees meer 28 mei 2025 Passeren krijgt een nieuwe versie: Vestigen 5.0 Lees meer Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:08:03Z",
  "source": "ech.nl"
}