{
  "id": "0b8cf94d9ca16d1dc665a85baf49a94727caae42",
  "url": "https://www.ech.nl/klanttevredenheidsonderzoek-ech-herinnering-gebruikersdag/",
  "title": "Klanttevredenheidsonderzoek ECH & herinnering gebruikersdag - ECH",
  "text": "Klanttevredenheidsonderzoek ECH & herinnering gebruikersdag - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Klanttevredenheidsonderzoek ECH & herinnering gebruikersdag / Gebruikersdag , Nieuws / Door Ruby ECH is benieuwd naar uw mening! Om de klanttevredenheid van gebruikers van ECH te achterhalen willen we u vragen om het klanttevredenheidsonderzoek uiterlijk donderdag 6 september in te vullen op onze website. Het invullen kost ongeveer 5 tot 10 minuten van uw tijd. De reacties gaat ECH gebruiken om haar dienstverlening te verbeteren en de prioriteit van toekomstige ontwikkelingen te bepalen. Onder de respondenten worden leuke prijzen verloot. Wilt u daar kans op maken? Vul dan uw contactgegevens in op de laatste pagina. klik hier om naar het klanttevredenheidsonderzoek te gaan. Presentatie resultaten op gebruikersdag (donderdag 13 september) De resultaten van het klanttevredenheidsonderzoek worden gepresenteerd tijdens de gebruikersdag van ECH op donderdag 13 september . Dit jaar is deze dag extra feestelijk. Stichting ECH viert namelijk haar 15-jarige jubileum. Het thema van deze middag zal zijn ‘naar een efficiënte keten’.Wij nodigen u graag uit om ook bij deze dag aanwezig te zijn. Indien u zich nog niet heeft aangemeld, kunt u dit doen op de website van ECH . Daar vindt u ook meer informatie over de invulling van de dag. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:06:08Z",
  "source": "ech.nl"
}