{
  "id": "0d0ae68f71fa67b527c082a84105a812fd343aea",
  "url": "https://www.ech.nl/meet-the-team-gilbert-twilt/",
  "title": "Meet the team - Gilbert Twilt - ECH",
  "text": "Meet the team - Gilbert Twilt - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Gilbert Twilt / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties notariaat / Door Raymond Bloot Maak kennis met veelzijdig helpdeskmedewerker Gilbert Twilt, hij vertelt over ECH, de KNB, drummen, vinyl én whisky ‘Wat mij aanspreekt in mijn rol is dat ik niet alleen puur technisch bezig ben, maar ook veel leer over het notariaat zelf en een groot gedeelte van de dag met mensen werk. Het is juist dat snijvlak tussen de mens en de techniek dat ik leuk vind. Dat maakt mijn werk net wat anders dan werken op een gewone servicedesk. Althans, zo ervaar ik dat’, zegt Gilbert Twilt, binnen de Koninklijke Notariële Beroepsorganisatie (KNB) verantwoordelijk voor support- en applicatiebeheer. ‘Bezig zijn met techniek vind ik fantastisch, maar de communicatie die daarbij komt kijken vind ik ook ontzettend leuk.’ Gilbert Twilt, Helpdeskmedewerker ECH Het menselijk aspect speelt belangrijke rol ‘Zelf heb ik overigens geen achtergrond in het notariaat, ik ben ICT-technisch geschoold. Al merkte ik al snel dat met name de kant waarbij het menselijk aspect een belangrijke rol speelt, me ligt. Ik heb in mijn dagelijkse werk veel te maken met professionals die gebruikmaken van de applicatie van ECH. Dat doen ze aan de hand van handleidingen, maar wat er achter de geavanceerde techniek schuilgaat weet men verder niet. Dat is ook niet erg, als notarissen of hun klerken vragen hebben, kunnen ze juist naar onze helpdesk bellen. Daar zijn we voor.’ Over emoties en verwachtingsmanagement ‘In mijn werk heb ik regelmatig te maken met een stukje verwachtingsmanagement en emoties’, aldus Gilbert. ‘Dit is logisch, want de werkdruk in het notariaat is best hoog. Wanneer je dan als notarieel medewerker een bepaalde werkvoorraad af moet hebben en dit lukt niet vanwege een stuk techniek dat niet werkt, dan is het begrijpelijk dat je daar stress door kunt ervaren. Het is dan mijn rol om op een empathische manier de juiste vragen te stellen zodat ik snel tot de kern van het probleem kom. De ene keer is dat door iemand gerust te stellen en de andere keer door iemand te overtuigen toch echt mijn vragen te beantwoorden omdat ik diegene dan concreet verder helpen kan. Ik doe dit werk nu ongeveer vier jaar en ik merk dat de ervaring die ik opgedaan heb me goed van pas komt. Vaak hoor ik al binnen een paar zinnen welke druk er op iemand ligt en met wat voor soort taak men bezig is. Misschien ben ik daar ook wel het meest trots op, dat ik mijn communicatieve vaardigheden toe kan passen binnen het notariaat en dat dit mensen echt verder helpt. Ik houd van zaken oplossen en van weten bij wie ik moet zijn. Beschikken over de juiste kennis maakt dat ik met zelfvertrouwen mijn werk kan doen. Wanneer ik een goede dag heb? Als ik iedereen tevreden heb kunnen stellen. Het betekent zeker niet dat ik alle problemen opgelost heb, maar wel dat ik de juiste acties in gang heb kunnen zetten. Dat servicegerichte zit in mijn DNA.’ Gilbert in privé ‘Wat ik verder in mijn vrije tijd doe? Ik heb een gezonde obsessie voor muziek. Ik maak zelf muziek en drum al heel lang in verschillende bandjes. Ik durf dat met recht een serieuze hobby te noemen. Zo zijn we bijvoorbeeld bezig om in eigen beheer een album te maken, al geloof ik niet direct dat dit een groot internationaal succes zal worden’, lacht Gilbert. ‘Ik ben ook blij dat we eindelijk weer op kunnen treden, want dat hebben we in de coronaperiode natuurlijk ontzettend gemist. Drummen zie ik echt als mijn uitlaatklep, waardoor ik weer lekker kan ontspannen. Verder verzamel ik vinyl en ben ik een whiskyliefhebber. Ook heb ik twee jonge kinderen, waar ik uiteraard ook graag zoveel mogelijk tijd mee doorbreng.’ Vragen aan Gilbert of zijn collega’s: stel ze gerust Heb je vragen aan Gilbert? Je bereikt hem rechtstreeks op 070-3307135 of door een e-mail te sturen naar servicedesk@knb.nl . Gilbert: ‘Het maakt niet uit waar men voor belt of mailt, maar doe het wél. Die laagdrempelige manier van samenwerken is één van de zaken die wij belangrijk vinden. We zullen vast niet alle problemen direct op kunnen lossen, maar uiteindelijk komen we er altijd uit. De manier waarop we met onze klanten samenwerken, is ook de manier waarop het hier intern gaat. De lijnen zijn heel kort, de organisatie plat en het maakt niet uit welke functie je hebt. Iedereen gaat op dezelfde manier met elkaar om. Zelf heb ik inmiddels bij genoeg andere organisaties gewerkt om te beseffen dat dit niet zomaar een vanzelfsprekendheid is. Dus op die samenwerking met mijn collega’s en alle relaties daaromheen, daar ben ik heel zuinig op.’ Meer informatie Heb je vragen voor de Helpdesk of wil je meer weten over ECH, neem dan contact via bovenstaande contactgegevens of via info@ech.nl . We staan met ons complete team áltijd voor ieder klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:26:31Z",
  "source": "ech.nl"
}