{
  "id": "0d64a9382de5d11b17ead9935972bc57b453eb9f",
  "url": "https://www.ech.nl/bob-van-elst-lingewaerd-notarissen-ontwikkeling-woningmarkt/",
  "title": "‘Ontwikkeling woningmarkt baart me zorgen, zeker met het oog op jonge mensen' - ECH",
  "text": "‘Ontwikkeling woningmarkt baart me zorgen, zeker met het oog op jonge mensen' - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Ontwikkeling woningmarkt baart me zorgen, zeker met het oog op jonge mensen’ / KNB , Nieuws , Notaris , Referenties notariaat / Door echadmin ‘Bij het passeren van aktes komt vaak ter sprake welke ontwikkelingen er zijn in de huizenmarkt. Ik kan me daar best wel bezorgd over maken eerlijk gezegd. Er is  immers zóveel kapitaal in de huizenmarkt gepompt vanuit allerlei kanten. Wanneer je dat combineert met het woningtekort en de lage rente dan is het logisch dat mensen op dit moment aan het overbieden zijn. Het geld kost bijna niets en de huizen zijn schaars. Dit betekent dat de huizenprijzen blijven stijgen, deels ook door de schenkingen die, onder meer vanuit ouders, worden gedaan. En daarbij komen ook grotere bedragen voor, zeker nu financiers en masse negatieve rente gaan rekenen bij stalling van honderdduizend euro of meer. Ik denk dat we over een jaar of 8 tot 10 de grote gevolgen gaan zien van wat er zich nu afspeelt in de woningmarkt.’ Aldus Bob van Elst, Lingewaerd Notarissen. Bob van Elst, Lingewaerd Notarissen Rentevastperiode geeft stress ‘Ik zie namelijk veel kopers bij mij aan tafel die, om hun huis toch maar te kunnen kopen, gekozen hebben voor een rentevastperiode van 10 jaar. Wat gebeurt er als deze mensen straks midden dertig zijn en aan kinderen willen beginnen waardoor ze minder gaan werken? Of, in een andere situatie, alleen verder gaan? Wanneer de rente dan met zo’n 1,5% stijgt dan kan dat zomaar een verdubbeling van de maandlasten betekenen. Of, in een andere casus, wat gebeurt er als de huizenprijzen in elkaar storten of er een gemiddelde daling inzet?’ Situatie voor mensen lastig ‘Uiteraard zie ik ook de lastige situatie waarin veel mensen zich bevinden. Wanneer men niet tot het uiterste gaat dan is het kopen van een huis bijna geen optie meer. Het zijn, althans dat denk ik, vooral ook de mensen van woningen in het lagere segment die wellicht aan het kortste eind trekken. En daar zijn vaak ook de minste liquide middelen beschikbaar’, vervolgt Bob. ‘Wanneer iemand dan bijvoorbeeld zijn huis moet verkopen vanwege een andere baan of wanneer er minder gewerkt wordt omdat er een kindje op komst is, dan kunnen er financiële problemen ontstaan.’ Kies voor een goede financieel adviseur ‘Mensen hebben hoe dan ook een goede financieel adviseur nodig. En daar bedoel ik iemand mee die in staat is om ver vooruit te kijken en daar in het advies aan cliënten ook rekening mee houdt. Financieel adviseurs zouden, naast die lange termijnvisie, ook de mogelijkheid aan moeten grijpen om mensen te adviseren een bepaalde woning niet te kopen. Ik denk dat dit nog veel te weinig gebeurt.’ Veel sociale druk ‘Daarnaast valt me op hoeveel sociale druk er is onder jonge mensen. Mensen zouden vaker tevreden moet zijn met wat ze hebben. Kijk, uiteindelijk komt het toch ergens uit de lengte of de breedte’, besluit Bob. Meer informatie Wil je meer weten over de de visie van Bob van Elst op de huidige woningmarkt of wil je meer informatie over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:04:42Z",
  "source": "ech.nl"
}