{
  "id": "0e8fb545af03b3e51c90a84827db90eb9798b9b1",
  "url": "https://www.ech.nl/nick-van-buitenen-uniforme-werkwijze-basis-voor-succes/",
  "title": "Uniforme werkwijze basis voor succes - ECH",
  "text": "Uniforme werkwijze basis voor succes - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Uniforme werkwijze basis voor succes / Bestuur , KNB , Nieuws , Notaris , Referenties notariaat / Door echadmin ‘In een ver verleden hanteerden we vanuit het notariaat richting banken en cliënten allerlei verschillende wijzen van communiceren, bijvoorbeeld per post of zelfs nog per fax. Het was al snel duidelijk dat we dat op een andere manier moesten doen.’ Aan het woord is Nick van Buitenen, notaris bij Van Grafhorst Notarissen. Bij het kantoor, dat is gevestigd in hartje Utrecht, werken zo’n 45 mensen waaronder 15 juristen. Een visie waar iedereen achter staat, de comfortabele grootte van dit notariaat en het enthousiasme binnen het team kenmerken dit notariskantoor. ‘Vervolgens heeft de KNB samen met Rabobank de start van deze uniforme werkwijze van ECH ontwikkeld. Het betekende dat je niet meer met allerlei losse verklaringen, zoals bijvoorbeeld volmachten, hoefde te werken die vervolgens weer werden omgezet in pdf om per mail te kunnen verzenden. Die ontwikkeling betekende dat er veel handmatige stappen uit het communicatieproces gehaald konden worden. Nu is alles direct zichtbaar in een geautomatiseerd systeem. Dat is de uniforme manier geworden waarop er met elkaar gegevens omtrent een bepaald dossier uitgewisseld wordt. Dat scheelt veel administratieve werkzaamheden en archiveringshandelingen. Bovendien is de kans op fouten daardoor sterk verminderd.’ Nick van Buitenen, notaris bij Van Grafhorst Notarissen Geïntegreerde software werkt handig ‘De samenwerking tussen stichting ECH, de KNB, de betrokken softwareleveranciers en de overige ketenpartners waaronder banken en third party services, is bijzonder waardevol. Uiteindelijk gaat het erom dat we het voor onze cliënten zo gemakkelijk, veilig en overzichtelijk mogelijk maken. De aankoop van een woning brengt immers al genoeg spanning met zich mee’, aldus Nick. ‘De software is direct gekoppeld aan onze dossiers, wat betekent dat we geen aparte handelingen hoeven uit te voeren. Dat is erg prettig, omdat je als notaris op deze manier direct een dossier opbouwt. Het nadeel vind ik eerlijk gezegd nog wel de lay-out. De informatie die ik met mijn cliënten deel ziet er qua vormgeving niet zo mooi uit. Hopelijk verandert dat nog in de toekomst.’ ‘De software zelf ervaar ik overigens wel als intuïtief. Wanneer je eenmaal weet hoe je ermee om moet gaan, werkt het heel handig’, vult zijn collega Wilma Donker aan. ‘Het notariaat is een relatief kleine markt en dat zie je terug in onze systemen, die zijn speciaal voor de behoeften van onze branche gebouwd.’ De samenwerking in het kort ‘Ik ben van 2017 tot 2021 voorzitter van de KNB geweest. Vanuit die rol weet ik dat er doorlopend veel overleg met banken, andere betrokken instellingen en uiteraard ook ECH is gevoerd. Dat waren fijne meetings waarbij iedereen vanuit zijn invalshoek kon aangeven waar uitdagingen zaten. Wat we gemeen hebben is de enorme hoeveelheid regelgeving waar we ons met zijn allen aan moeten houden. Naast de verschillende wensen die er waren om een en ander op de juiste manier aan elkaar te koppelen, was het ook heel prettig om onderling ervaringen uit te wisselen’, aldus Nick. Wilma vult aan: ‘Een ander woord dat in me opkomt als ik aan de samenwerking met ECH denk is de term efficiënt. Door inzet van de software is er directe communicatie mogelijk en voorkom je ruis op de lijn. Zo krijgen wij in ons systeem simpelweg een vinkje te zien als de bank dat vinkje zet. Die manier van samenwerking zorgt voor een snellere afhandeling van dossiers. Het betekent eveneens minder handmatige werkzaamheden en daarmee dus minder fouten. Denk bijvoorbeeld aan het passeergedeelte, waarbij we voorheen als we een akte moesten maken, zelf nog veel vragen moest beantwoorden. Nu wordt het allemaal al ingelezen. Natuurlijk is een en ander ook nog in ontwikkeling. Zo behoeft het proces rondom de bankgarantie echt nog wel verbetering en daar ligt een kans voor ECH.’ ‘Tegelijkertijd vind ik ook dat wij als notariaat zelf actief mee moeten willen werken aan de ontwikkeling van het systeem. Je kunt immers niet verwachten dat er iets gebeurt als je er zelf niets aan doet. Naast onze rol vanuit de werkvloer waarbij we een grote hoeveelheid juridische bagage meenemen, kan onze inbreng ook vooral praktisch van aard zijn. Zo spelen termijnen binnen ons vak bijvoorbeeld een belangrijke rol. Daarin geeft het platform van ECH rust. Het systeem is namelijk heel strikt: als ik een passeerdatum doorgeef dan kan ik er ook vanuit gaan dat deze aangehouden wordt. Datzelfde geldt voor bepaalde belangrijke termijnen waarbinnen geldstromen ontvangen moeten zijn of waarbinnen een royementsakte gepasseerd moet worden.’ Persoonlijk contact blijft belangrijk ‘Hoe enthousiast ik ook ben over de digitale vorm waarin we binnen de keten met elkaar samenwerken, dit virtuele stuk mag het persoonlijke contact nooit volledig vervangen. Wanneer er bijvoorbeeld iets fout gaat dan is het gewoon prettig om even van mens tot mens te kunnen schakelen over de achtergrond. Iedereen maakt immers fouten’, zegt Nick. ‘Maar juist dat contact ervaar ik als erg prettig bij ECH’, weet Wilma. ‘Wanneer ik een zaak aanmaak dan krijg ik direct een telefoonnummer dat ik, in geval van vragen of opmerkingen, kan bellen bij de betrokken bank of financiële instelling. Wat ik hoop is dat iedereen mee wil blijven denken zodat we het systeem kunnen blijven uitbouwen. ECH zorgt op dit moment al voor gestructureerde communicatie en het slimme platform neemt je werk uit handen. Dat bespaart tijd én het werk wordt er leuker door omdat er meer tijd over blijft voor contact met de cliënt.’ Meer informatie Wil je meer weten over digitalisering in het notariaat of over de visie Nick van Buitenen? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:08:16Z",
  "source": "ech.nl"
}