{
  "id": "10dd6702c4fec280f1b23ec1af8dbaa6263abba3",
  "url": "https://www.ech.nl/ech-gebruikersdag-2018-naar-een-efficiente-keten/",
  "title": "ECH gebruikersdag 2018: naar een efficiënte keten - ECH",
  "text": "ECH gebruikersdag 2018: naar een efficiënte keten - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH gebruikersdag 2018: naar een efficiënte keten / Gebruikersdag , Nieuws / Door Ruby Ieder jaar organiseert stichting ECH voor al haar deelnemers en geïnteresseerde partijen de gebruikersdag. Dit jaar vindt het evenement plaats op donderdagmiddag 13 september. Het thema is dit jaar ‘naar een efficiënte keten’. Een thema dat reeds is ingezet met de oplevering van versie 4.0. ECH gaat graag met u in gesprek om de keten nog verder te verbeteren. Na de zomer is het weer tijd voor de jaarlijkse ECH gebruikersdag. Wij nodigen u als deelnemer aan ECH notarieel softwareleverancier, hypothecair softwareleverancier en geïnteresseerde partij graag uit om in één middag weer volledig bijgepraat te worden over ECH en relevante ontwikkelingen in de markt. Ter voorbereiding sturen wij zowel maatschappijen als het notariaat een klanttevredenheidsonderzoek. Onder alle respondenten verloten wij ook een leuke prijs. De presentatie van de resultaten en de prijsuitreiking vinden plaats tijdens de gebruikersdag. De agenda is nog in de maak, maar het belooft een volle en vooral interactieve middag te worden waarin maatschappijen en notariaat met elkaar in gesprek gaan om samen de vastgoedketen te verbeteren. Er wordt uitgebreid stilgestaan bij de verbeteringen in ECH 4.0, de AVG en de prestaties van ECH over de afgelopen periode. De gebruikersdag van ECH vindt dit jaar plaats op donderdag 13 september van 13.00 – 17.00 uur op een locatie midden in nederland. Zodra er meer informatie beschikbaar is, delen wij deze met u. Graag zien wij uw aanmelding tegemoet. Aanmelden kan op deze pagina . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:07:13Z",
  "source": "ech.nl"
}