{
  "id": "127c11332ae869c2da375399fb9ce093b09e0e1c",
  "url": "https://www.ech.nl/overgang-aegon-naar-asr/",
  "title": "Overgang Aegon naar ASR - ECH",
  "text": "Overgang Aegon naar ASR - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Overgang Aegon naar ASR / Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Overname hypotheekportefeuille ASR heeft de hypotheekportefeuille van Aegon Hypotheken overgenomen. Als gevolg van de overname door ASR gaat in 2025 het beheer van de Aegon-hypotheekportefeuille in fases over naar Stater. Het is dan nog steeds een Aegon-hypotheek. Sinds medio januari 2025 verstrekt Aegon nieuwe leningen voor nieuwe klanten via Stater onder het Aegon-label. De lopende portefeuille in beheer zet Aegon in twee fases over naar Stater. Het eerste deel verhuist in het Pinksterweekend van 7 – 9 juni 2025 en een tweede deel volgt in oktober 2025. Wat betekent dit voor u? Er is een duale periode van januari tot en met oktober 2025. Dan verwerkt en beheert Aegon leningen zowel bij Stater als bij Aegon. E-notaris: verwerking en beheer bij Stater Sinds 15 januari 2025 wordt een deel van de nieuwe hypothecaire inschrijvingen van Aegon bij Stater geadministreerd. Vanaf 10 juni 2025 komen daar ook een deel van de bestaande verhuisde hypotheken bij. Voor het indienen van een aflosverzoek kunt je gebruikmaken van de zoekfunctie in E-notaris om te controleren of de lening bij Stater in beheer is. Voor een vlotte dossierafhandeling is het belangrijk dat je het dossier verwerkt in het juiste portaal (E-notaris dan wel ECH). ECH: verwerking en beheer bij Aegon Er zijn ook nog lopende dossiers die via Aegon worden verwerkt en via ECH worden aangeleverd. Voor de hypotheken die na 10 juni 2025 nog in het oude Aegon-systeem staan, blijf je gebruikmaken van ECH. Je herkent deze hypotheken aan een nummer dat start met een H. Verwerkingspauze ECH ECH is gesloten voor Aegon hypotheken vanaf vrijdag 30 mei 12.00 uur ’s middags. ECH gaat weer open op dinsdagochtend 10 juni 8.00 uur. Tijdens deze verwerkingspauze ontvang je ook geen berichten van Aegon hypotheken. Wanneer je toch een bericht probeert te versturen naar Aegon, dan ontvang je een foutmelding: “De ontvangende partij heeft geen ECH toegang”. Passeren Deadline proces passeren Garantiedatum verzoeken voor passeringen met passeerdatum t/m woensdag 11 juni 2025: Bericht “melden passeergegevens” en concept akte + afrekening moet uiterlijk op vrijdag 23 mei binnen zijn; Voor verzoeken die ná 23 mei binnenkomen, kan Aegon geen garantie geven dat tijdig een sluitnota wordt opgemaakt en de gelden tijdig worden overgemaakt. Insturen hypotheekaktes Tijdens de verwerkingspauze kan je bij een passering in een ECH zaak wachten met het aanleveren van een gepasseerde akte tot 10 juni 2025. Vanaf dat moment kunnen deze gepasseerde aktes via ECH worden ingestuurd. Bij niet-ECH zaken kan de notaris de gepasseerde akte via het webformulier op de website aanleveren. Noodproces voor passeren Is door een gegronde reden de deadline van 23 mei niet gehaald? En heb je nog geen sluitnota ontvangen op maandag 2 juni? Dan kun je een spoedverzoek doen en gebruik maken van de noodprocedure. Denk je dat dit het geval is? Neem dan zo snel mogelijk contact op met de ServiceDesk van Aegon Hypotheken (058 – 244 3400). Royeren Deadline proces royeren Garantiedatum verzoeken voor passeringen met passeerdatum t/m 22 juni 2025 Aflosnota wordt minimaal 15 werkdagen voor de passeerdatum opgevraagd; Is de passeerdatum na 22 juni? Dan vraag je de aflosnota op via E-notaris. In E-notaris kun je zien of de bestaande hypotheek inderdaad is geadministreerd bij Stater. Is de hypotheek niet zichtbaar? Dan bestaat de kans dat de desbetreffende hypotheek niet is gemigreerd en nog inzichtelijk is op het oude platform van Aegon. In dat geval stuur je het verzoek nog via ECH in. Noodproces opvragen aflosnota overbruggingskrediet Is door een gegronde reden de termijn van 15 werkdagen niet gehaald? En heb je geen reactie van ons gekregen op maandag 2 juni? Dan kun je een spoedverzoek doen en gebruik maken van de noodprocedure. Neem in die gevallen zo snel mogelijk contact op met de ServiceDesk van Aegon Hypotheken (058-244 6650). Noodproces verstrekken royementsvolmacht Je kunt een spoedverzoek doen en gebruik maken van de noodprocedure. Neem in die gevallen zo snel mogelijk contact op met de ServiceDesk van Aegon Hypotheken (058-244 6650). Goed om te weten Aegon informeert je na de zomer tijdig over de vervolgstappen en wat dit voor jou betekent. Vanaf 10 juni maak je vaker gebruik van E-notaris omdat dan het eerste deel van onze hypotheken is overgezet naar Stater. Meer informatie Wil je meer weten over de overgang van Aegon naar ASR of de dienstverlening van ECH? Laat het ons weten via info@ech.nl . Samen bouwen we aan de toekomst van ECH! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:11:44Z",
  "source": "ech.nl"
}