{
  "id": "134b0237f54b4a8933ae093803bd581a849a3558",
  "url": "https://www.ech.nl/ech-change-strategie/",
  "title": "ECH Change strategie - ECH",
  "text": "ECH Change strategie - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH Change strategie / Bestuur , Directie ECH , Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot In de 20 jaar dat we bestaan heeft ECH zich gevestigd als veilige en betrouwbare partner voor hypothecair financiers en het notariaat. Dus de “best way forward” lijkt dan ook te zijn om niets aan de succesformule te veranderen, toch? Niet helemaal, want dat stilstand achteruitgang betekent wordt bijna dagelijks bevestigd. Een maand of 6 geleden had bijna niemand nog gehoord van ChatGPT en nu is het lastig om het product van het onderzoekslab OpenAI in een conversatie of meeting niet te noemen. En het product zet de tech wereld op z’n kop want het zal de manier waarop we werken en informatie vergaren voor altijd veranderen. Maar ook dichterbij huis komen de veranderingen in een steeds rapper tempo op ons af. Het gebruik van brondata, de digitalisering van akten, de komst van een digitale identiteit en digitale wallets zijn niet langer toekomstmuziek. Deze ontwikkelingen gaan in de komende jaren in rap tempo worden geïntegreerd in ons dagelijkse leven. En dat is goed nieuws want al deze veranderingen maken het gemakkelijker, sneller en veiliger om transacties te verrichten en daarmee de klantreis van hypotheekklanten een stuk efficiënter te maken. Sinds de zomer van vorig jaar heeft ECH onderzocht hoe zij haar partners kan helpen om optimaal gebruik te maken van alle nieuwe mogelijkheden. Bij het formuleren van de Change Strategie zijn een aantal uitgangspunten geformuleerd. Verbetering van de kerndiensten rond hypotheken blijft het uitgangspunt bij de verbeteringen die we gaan doorvoeren. We hebben geen ambitie om de dienstverlening uit te breiden naar andere productgroepen of andere onderdelen van de keten. De dienstverlening blijft gecentreerd rond de ontsluiting van het notariële domein . Als we nieuwe diensten aanbieden gaat de notaris daarin altijd een rol spelen. ECH heeft er altijd naar gestreefd om een balans te vinden in de dienstverlening naar hypothecair financiers en het notariaat . Voor de voorgestelde ontwikkelingen zal die balans soms iets doorslaan naar één zijde, maar het pakket aan verbeteringen zal altijd evenwichtig zijn. Als we besluiten om nieuwe “kanalen” te ontwikkelen gaan we daarbij altijd samenwerking zoeken met partijen die al actief zijn in dat deel van de keten. Gegeven de veranderde marktomstandigheden starten we alleen trajecten die een duidelijke meerwaarde opleveren voor onze partners. Na onderzoek van de verschillende terreinen waar we verbeteringen zien hebben we uiteindelijk de keuze gemaakt om een tweetal programma’s te starten die een directe en concrete verbetering voor onze partners bewerkstelligen. Het eerste Programma, ECH Verzoeken , ziet toe op het faciliteren van een meer gestructureerde, geïntegreerde en proces gestuurde wijze voor het afhandelen van verschillende verzoeken zoals toestemmingen en het ontslag van hoofdelijke aansprakelijkheid. Binnen het tweede Programma, Verbetering Kwaliteit Akten , worden een aantal projecten opgestart. Daarbij hanteren wij een toekomstvisie, waarbij de gestructureerde digitale hypotheekakte een belangrijke rol gaat spelen. Op de weg daarnaartoe start ECH een initiatief om te streven naar een verdere uniformering van de verschillende aktemodellen . Verder wordt gekeken naar het in kaart brengen- en elimineren van mogelijke discrepanties tussen de input voor de hypotheekakte en de uiteindelijke output . Hierbij onderzoeken we verschillende mogelijkheden om automatische controles te laten plaatsvinden. In onze nieuwsbrieven komen alle deelprojecten één voor één aan bod. Daarbij starten we met het “eindpunt”, de digitale hypotheekakte. De KNB heeft hiertoe, in nauwe samenwerking met ECH, de eerste stappen gezet en in één van de volgende nieuwsbrieven gaan KNB en ECH verder in op het belang van de digitale hypotheekakte en geven inzicht in de stappen die naar dit einddoel moeten leiden. Meer informatie Wil je meer weten over de ECH Change strategie, hou dan de mail in de gaten de komende maanden of heb je al direct vragen over de Change strategie van ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:32:50Z",
  "source": "ech.nl"
}