{
  "id": "1380abbc77cb839d91257422514e78e3f712bcc7",
  "url": "https://www.ech.nl/zo-werkt-het/",
  "title": "De werkmethode van ECH | ECH",
  "text": "De werkmethode van ECH | ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Zo werkt ECH De digitale brievenbus voor de communicatie tussen notarissen en hypothecair financiers Zie ECH als een brievenbus waarbij de ene partij een document digitaal aanbiedt, waarna er een seintje naar de andere partij gaat. Deze ontvanger leegt vervolgens de spreekwoordelijke brievenbus en legt het verwerkte document weer klaar waarna het proces wordt vervolgd. Dit is hoe het werkt De digitale brievenbus van ECH Bij het verkrijgen of royeren van een hypothecaire financiering hoort het vestigen of doorhalen van een hypotheekrecht. Daar is de tussenkomst van een notaris voor nodig. In Nederland zijn er ruim 900 notariskantoren actief, die elk op een eigen manier communiceren met verschillende hypothecair financiers. Om dat beter aan te pakken is vanuit de branche het initiatief genomen om hiervoor een standaard op te richten, zo is stichting ECH ontstaan. ECH staat voor Elektronische Communicatie Hypotheken en biedt een platform vanwaaruit hypothecair financiers en notariskantoren 100% veilig, efficiënt en uniform met elkaar communiceren. Dat bereikt ECH door een berichtenstandaard beschikbaar te stellen waarmee berichten volgens een afgesproken volgorde tussen partijen worden uitgewisseld. Een centraal mechanisme zorgt ervoor dat elk uitgewisseld bericht inhoudelijk en technisch voldoet aan de afgesproken standaard. Hierdoor ontstaat de mogelijkheid om Straight Through Processing door te voeren binnen businessprocessen. Processen Bewijsvoering en bewaaradvies Door het aangaan van een schriftelijke toetredingsovereenkomst is elke deelnemer gebonden aan de algemene voorwaarden van ECH. In de algemene voorwaarden is het volgende opgenomen over de bewijskracht van berichten: De schriftelijke vastlegging of reproductie door deelnemers van de binnen ECH ontvangen berichten, dan wel overige binnen ECH vastgelegde gegevens, levert tussen deelnemers dwingend bewijs op, behoudens tegenbewijs. Stichting ECH draagt zorg voor logging en registratie van verkeersgegevens. Meer informatie ECH schoont op Ook aan de dienstverlening van ECH worden steeds strengere wettelijke eisen gesteld. Dit heeft enerzijds te maken met de privacygevoelige gegevens waarmee gewerkt wordt. En anderzijds speelt ook de Europese AVG-privacywetgeving, internationaal bekend als GDPR, daarin een rol. Meer informatie Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:32:34Z",
  "source": "ech.nl"
}