{
  "id": "162f0086168d0b9991f2b2c9a2f07b2348b5d6cb",
  "url": "https://www.ech.nl/ech-breidt-dienstverlening-uit-met-bankgarantie/",
  "title": "ECH breidt dienstverlening uit met bankgarantie - ECH",
  "text": "ECH breidt dienstverlening uit met bankgarantie - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH breidt dienstverlening uit met bankgarantie / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot ‘Naast de processen van royeren en vestigen van hypotheken breidt ECH haar dienstenportefeuille nog voor de zomer concreet uit. De betrokken partijen uit de keten zien immers graag dat we doorontwikkelen en nieuwe processen vanuit onze dienstverlening aanbieden. Zo is er al langere tijd de wens om ook de bankgarantie te gaan ontsluiten binnen ons aanbod. En dat is nu nét een proces dat zich daar uitstekend voor leent.’ Dat zegt Casper van Ginneken, Compliance Officer & Consultant. Johan Agterberg, Directeur Change ECH vult aan: ‘Logisch ook, want veel hypothecair financiers hebben te maken met bankgaranties. Een klant heeft deze vaak nodig bij de aankoop van een woning. Het is een bijproduct dat feitelijk als een stukje service vanuit de hypothecair financiers of andere financiële instellingen wordt verleend aan de klant. Als zij daarin kunnen optimaliseren, waardoor ze kosten kunnen besparen, dan zijn deze partijen daar erg mee geholpen. Ook al zijn de volumes een stuk minder hoog dan bij het royeren en vestigen van hypotheken, toch is er zeker wel een interessante businesscase van te maken. Wij zien dit als een lange termijn investering. Voor de partijen die er gebruik van willen maken, geldt dat zij een initiële investering moeten doen, al is het maar omdat ze deze nieuwe dienst in hun systemen dienen te integreren. Vervolgens profiteren we daar jarenlang van. En het belangrijkste: we hebben de klant vanuit de keten zo goed mogelijk geholpen in de vaak toch spannende periode rondom de aankoop van een woning. De ervaringen die we hebben opgedaan in de andere processen die we aanbieden, kunnen we prima inzetten bij deze nieuwe stap.’ Johan Agterberg, Directeur Change en Casper van Ginneken, Consultant & Compliance Officer van Stichting ECH ECH als dé communicatiestandaard voor alle vastgoedprocessen Casper: ‘Naarmate wij in meer processen kunnen ondersteunen, vergroten we onze footprint en dat werkt als een vliegwiel, want daarmee krijgen we steeds meer betekenis voor de partijen die gebruikmaken van ons platform. Omdat onze impact steeds groter wordt, ontstaan er ook meer schaalvoordelen. Uiteindelijk willen wij dé communicatiestandaard zijn voor alle vastgoedprocessen die zich afspelen tussen hypothecair financiers en het notariaat. We bieden veel efficiëntie vanuit ECH, met name omdat het berichtenverkeer in de basis allemaal op dezelfde manier werkt. Dat is ook handig voor de techneut die de koppeling moet realiseren, want hij weet al hoe onze API in elkaar zit. Dat maakt het gemakkelijk om daar nieuwe dingen aan toe te voegen en om de technische kant te implementeren en te onderhouden.’ Voordeel voor eindgebruikers Johan: ’Maar ook de betrokken professionals kunnen stukken, zoals de bankgarantie, veel beter verwerken. In de huidige werkwijze krijgt een notaris immers vanuit alle kanalen bankgaranties aangeboden: via post, e-mail en sporadisch zelfs nog via de fax. Dat moet hij allemaal in de gaten houden. Daarnaast moet hij beoordelen of de bankgarantie an sich rechtsgeldig is. Door de tussenkomst van ECH hebben alle bankgaranties dezelfde standaard, dezelfde inhoud dus. Dat is een voordeel voor de notaris. Deze uniformiteit verlaagt bovendien de risico’s omdat een dergelijk waardedocument, dat de bankgarantie uiteindelijk toch is, met een veel lagere foutkans verwerkt kan worden.’ Bankgarantie via de digitale snelweg ‘En hoe dat er straks in praktijk uitziet? De bankgarantie komt via de digitale snelweg binnen en medewerkers zowel aan de kant van de hypothecair financier als de notaris kunnen in hun eigen softwaresysteem communiceren over die bankgarantie. Vanuit hun dossier kunnen ze dit document met één druk op de knop in de administratie verwerken’, aldus Johan. Casper vult aan: ‘Uiteindelijk heeft dit invloed op iedereen, de klant ervaart rust en minder stress omdat hij niet hoeft na te denken over dit soort voor hem of haar ingewikkelde formaliteiten. En voor de hypothecair financiers en notarissen wordt het een stuk gemakkelijker. Zo weet de notaris bijvoorbeeld ook zeker dat de aangeleverde bankgarantie een juridisch geldig document is.’ ‘We zijn er gepast trots op dat het uiteindelijk is gelukt om de handen op elkaar te krijgen voor de implementatie van dit proces’, zegt Johan Agterberg Van handmatig naar automatisch Johan: ‘Stel je voor, in de huidige situatie moet de medewerker handmatig zaken overtypen, zoals de datum en het bedrag, om de bankgarantie vervolgens verder te kunnen verwerken. Door inzet van ECH wordt deze informatie nu automatisch verwerkt in het systeem. Een ander belangrijk voordeel om ECH in te zetten voor dit proces is dat de huidige werkwijze waarin bankgaranties via mail en post worden verstuurd, een groot privacy-risico met zich meebrengt. Er is immers een kans aanwezig dat het onbeveiligd versturen van persoonsgegevens leidt tot een datalek, bijvoorbeeld omdat post kwijtraakt of een e-mail ingezien wordt door een ongeautoriseerd persoon. Met name hypothecair financiers lopen grote risico’s als zij niet conform de AVG-wetgeving omgaan met persoonsgegevens. Dat speelt bijvoorbeeld wanneer zij de veiligheid op dit vlak onvoldoende op orde hebben.’ Proces bankgarantie voor zomer opgeleverd Johan: ‘Dit proces voor de bankgarantie wordt nog voor de zomer opgeleverd. Dan is het beschikbaar voor hypothecair financiers en ketenpartijen en kunnen zij gaan implementeren. We zijn er gepast trots op dat het uiteindelijk is gelukt om de handen op elkaar te krijgen voor de implementatie van dit proces. De weg er naartoe is lang geweest en we zien het echt als een doorbraak dat we dit met elkaar hebben kunnen realiseren. Casper: ‘Inderdaad, daar sluit ik me volledig bij aan. De realisatie van dit proces leek soms een beetje op een kip en ei-verhaal. ECH-gebruikers gaven aan dat ze de gedigitaliseerde bankgarantie wel wilden gebruiken, maar dat er dan wel een concreet aanbod moest zijn voor ze een definitief besluit namen. Wij waren op onze beurt dan weer op zoek naar steady commitment voordat we zinvol konden gaan ontwikkelen. Gelukkig hebben we deze impasse kunnen doorbreken en zijn we na een lange aanloopfase nu zover dat er binnenkort een derde proces live staat. We hebben er alle vertrouwen in dat dit veel gaat brengen in de keten, waarbij het gemak dat de consument tijdens zijn reis ervaart, uiteraard met stip op één staat.’ Meer informatie Wil je meer weten over de nieuwe dienst Bankgarantie of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:21:18Z",
  "source": "ech.nl"
}