{
  "id": "16cd13787c8232f07b83e3247bf9c03954a1b27f",
  "url": "https://www.ech.nl/ech-heeft-het-huis-op-orde-en-is-klaar-voor-de-toekomst/",
  "title": "‘ECH heeft het huis op orde en is klaar voor de toekomst', Martijn Jansen, bestuursadviseur  - ECH",
  "text": "‘ECH heeft het huis op orde en is klaar voor de toekomst', Martijn Jansen, bestuursadviseur  - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘ECH heeft het huis op orde en is klaar voor de toekomst’, Martijn Jansen, bestuursadviseur / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Stichting ECH is enorm gegroeid de afgelopen jaren. Om haar ambitie te kunnen realiseren en in goede banen te kunnen blijven leiden, is er eind 2021 besloten om de organisatie onder de loep te nemen. De hulp van diverse professionals is daarbij ingeschakeld. Organisatieadviesbureau Styr heeft onderzoek verricht en diverse stakeholders geïnterviewd, waaruit een organisatieadvies is gekomen. Vraagstukken als een eigen payroll versus inhuur van medewerkers, de organisatiestructuur, stichting versus vereniging, en bestuur als besluit nemend of juist als toezichthoudend orgaan, maar ook de rol van de Raad van Advies, zijn daarbij aan de orde gekomen. Martijn Jansen , bestuursadviseur en teamcoach, is verantwoordelijk voor de implementatie van dat organisatieadvies binnen ECH. Daarnaast is Notaris Ohmann nauw betrokken geweest bij de statutenwijziging, het vaststellen van mandaten en het opstellen van functieprofielen en bestuurs- en directiereglementen. De start: het huis dat ECH is in beeld brengen Martijn: ‘We zijn begonnen met het beschrijven van hoe er nu wordt samengewerkt en met benoemen van welke taken en verantwoordelijkheden er zijn. Ook hebben we gekeken naar hoe de dynamiek intern was op dat moment. Je kan het zien als het ontwerpen van een huis, waarbij je kijkt naar hoe de inrichting eruitziet en naar hoe je in de ideale wereld wil dat deze inrichting oogt. Met andere woorden hoe gaan we leven in dit huis dat we met elkaar gebouwd hebben? Enerzijds ging dit blikveld over de wat ‘hardere’ kant, waarin we naar praktische zaken gekeken hebben als: Hoe bereiden we nu een overleg goed voor? Hoe komen we tot goede besluitvorming? Et cetera. Maar ook de zachtere kant heeft veel aandacht gekregen: er is gekeken naar het succes van de stichting, men is immers niet voor niets zo snel gegroeid, en naar de gevolgen van deze groei. In een kleine organisatie is het immers gemakkelijk om even snel iets af te stemmen, maar nu het groter wordt, is het wel handig om dat wat formeler aan te pakken op onderdelen.’ Martijn Jansen, bestuursadviseur en teamcoach Veel bereikt met elkaar ‘Ik ondersteun vanuit mijn rol zowel de directie als het bestuur en dat doe ik met name op de momenten dat men elkaar treft. Zo sluit ik als coach aan bij overleggen en kijk ik, in individuele gesprekken, naar wat ieders talent is en naar hoe we dat zo goed mogelijk in kunnen zetten. Ik merk aan alles en iedereen dat men achter het inschakelen van mij, en de andere specialisten, staat. Dat vind ik een teken van kracht, je laten ondersteunen op punten die je belangrijk vindt. En openstaan voor nieuwe suggesties. We zijn eind vorig jaar begonnen en we hebben al veel bereikt met elkaar. Zo ervaar ik onder meer dat mensen zich vrij voelen om elkaar aan te spreken op bepaalde zaken. Wanneer iemand bijvoorbeeld, weliswaar vanuit een goede bedoeling, een taak oppakt die niet bij zijn of haar rol hoort, dan spreekt de ander diegene daar inmiddels op aan. Dit in het kader van rolzuiverheid, waardoor er nog sneller, beter en relatief stressvrij resultaten behaald worden’, aldus Martijn. ‘Wanneer ik aan ECH denk dan komen er als vanzelf woorden als enthousiast, gedreven en verbinding in me op.’, aldus Martijn Jansen bestuursadviseur en bestuurscoach Over rolzuiverheid en uit de ren-stand gaan ‘Ik geloof dat ik binnenkort niet meer nodig ben, en dat is natuurlijk het beste resultaat dat je je vanuit mijn adviseursrol kunt wensen voor de stichting. De veranderingen die we besproken hebben, worden breed gedragen, zowel door de bestuursleden als de directieleden. Er is in de afgelopen periode meer daadkracht binnen de organisatie gekomen, waardoor knopen sneller doorgehakt worden. Ook is er dus meer helderheid over de verschillende rollen ontstaan en zijn mensen steviger in die rol gaan zitten. Er is zóveel te doen binnen de stichting, dat als je niet oppast je continu in de ren-stand staat. En in plaats van vooral praktisch taken te verdelen, is er nu meer ruimte gekomen om ook strategisch stil te staan bij belangrijke thema’s.’ ‘Het is voor mij als adviseur verder prettig om te merken dat er daadwerkelijk tijd ingebouwd wordt om te praten over gedrag en cultuur. Men staat echt open voor coaching. Er waren binnen de stichting ook geen problemen, maar men heeft mij, en de andere specialisten, ingeschakeld vanuit de wens om het nog beter te doen. Om in de metafoor van de woning te blijven, we hoefden niets op te ruimen voor we verder konden gaan bouwen.’ ECH: een nieuwe fase van volwassenheid ‘Je ziet dat ECH een nieuwe fase van volwassenheid is binnengegaan. De organisatie is robuust, minder afhankelijk van toevalligheden en op een duurzame manier klaar voor de toekomst. Ondanks de groei is men wel flexibel en wendbaar gebleven, en dat is heel knap. Ook blijven ze weg uit al te zakelijk worden met elkaar, de menselijke maat is er nog steeds en dat doen ze gewoon heel goed. Dat heeft eveneens te maken met de mensen binnen ECH, die aandacht voor de mens en persoonlijk samenwerken hoog in het vaandel hebben staan. Zij hebben, vanuit hun karakters, van nature aandacht voor de dynamiek in het team en de mens áchter het bedrijf. Verder zie je dat er veel oog is voor de consument, alle beslissingen beginnen en eindigen met het klantbelang in het vizier’, aldus Martijn. ‘Soms wil men, vanuit zorgvuldigheid, nog net wat te lang stilstaan bij details voordat er besluiten worden genomen. Om de daadkracht en slagkracht erin te houden constateren we dan met elkaar dat het soms ook genoeg is om 90% te weten, zodat er toch besluiten genomen kunnen worden.’ Enthousiast, gedreven en verbinding ‘Wanneer ik aan ECH denk dan komen er als vanzelf woorden als enthousiast, gedreven en verbinding in me op. Ik vind het heel mooi als mensen in staat zijn om zichzelf kritisch onder de loep te nemen en zich daarbij kwetsbaar durven op te stellen. Dat zie je ook binnen ECH, men is erg open en ik voelde me meteen welkom binnen het mooie en krachtige team waarin steeds nieuwe ideeën en nieuwe impulsen ontstaan. Wanneer een team niet helemaal lekker functioneert, dan zie je vaak dat creativiteit doodbloedt, de luiken van het huis gaan als het ware een beetje dicht. Dat heb ik hier op geen enkel moment ervaren. En dat lijkt me een prima houding om vol vertrouwen de toekomst in te gaan’, besluit Martijn. Meer informatie Wil je meer weten over Stichting ECH, heb je een vraag, suggestie of wil je een bijdrage leveren? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:33:07Z",
  "source": "ech.nl"
}