{
  "id": "197cdfa7a77705bdb297d383eaabbfb34c61e943",
  "url": "https://www.ech.nl/de-consument-en-zijn-klantreis-daar-draait-het-om/",
  "title": "‘De consument en zijn klantreis, dáár draait het om’, Leon Roseleur, programmamanager Zorgeloos Vastgoed - ECH",
  "text": "‘De consument en zijn klantreis, dáár draait het om’, Leon Roseleur, programmamanager Zorgeloos Vastgoed - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘De consument en zijn klantreis, dáár draait het om’, Leon Roseleur, programmamanager Zorgeloos Vastgoed / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Zorgeloos Vastgoed is een initiatief opgestart door Hypotheken Data Netwerk (HDN), het Kadaster, Koninklijke Notariële Beroepsorganisatie (KNB) en de Nederlandse Vereniging van Makelaars en Taxateurs (NVM). In 2019 ondertekenden we de intentieverklaring Zorgeloos Vastgoed , de basis voor onze plannen. Sindsdien bouwen vertegenwoordigers uit de hele vastgoedketen mee aan het afsprakenstelsel Zorgeloos Vastgoed.’ Dat zegt Leon Roseleur , programmamanager van het initiatief dat de consument bij aan- en verkoop van vastgoed moet ontzorgen doordat de ketenpartners beter samen gaan werken. Ketenbrede digitalisering en helpen van de consument ‘Binnen Zorgeloos Vastgoed komen twee zaken mooi bij elkaar. Ten eerste richten we ons op ketenbrede digitalisering en standaardisering en ten tweede willen we het proces voor de consument een stuk gemakkelijker en transparanter maken. Wanneer een consument een woning aankoopt dan begint voor hem de reis binnen de vastgoedketen bij de makelaar en deze eindigt bij het kadaster, als het aangekochte vastgoed ingeschreven wordt. En deze reis verloopt nog lang niet altijd even vlekkeloos’, aldus Leon. Leon Roseleur, programmamanager Zorgeloos Vastgoed Overal verschillende standaarden ‘Zo hebben we met elkaar geconstateerd dat er binnen de keten verschillende standaarden worden gehanteerd. In de ideale wereld gaan we uit van één uniforme werkwijze. ECH heeft een standaard tussen notarissen en hypothecair financiers. HDN richt zich op eenduidige communicatie tussen financieel adviseurs en aanbieders van hypotheek- en hypotheekgerelateerde producten. Het uiteindelijke doel is om alle loketten rondom de hele klantreis naadloos op elkaar aan te laten sluiten.’ Bouwen aan een fundament ‘Wat wij vanuit Zorgeloos Vastgoed willen is een fundament neerzetten zodat een en ander gemakkelijker en duidelijker wordt voor de consument en deze eerder in het proces zekerheid krijgt bij de aankoop van een woning’, vervolgt Leon. ‘Als we de informatievoorziening binnen de keten goed aan elkaar weten te rijgen en dat vervolgens onder de regie van de consument brengen, dan ontstaat er meer comfort voor diezelfde consument.’ ‘ Wat wij willen? In elke woonfase de juiste informatie, met één druk op de knop. Dáár draait het om. ‘ zegt Leon Roseleur. Uitgebreid onderzoek naar consumentenbeleving ‘We hebben uitgebreid onderzoek laten doen naar hoe de consument dat aankoopproces op dit moment beleeft. Wat duidelijk naar voren komt is het missen van overzicht en een gevoel van onduidelijkheid, omdat de consument niet goed weet welke keuzes er gemaakt moeten worden op welk moment. Bovendien is er sprake van irritatie omdat er telkens opnieuw dezelfde documenten aangeleverd moeten worden.’ Standaard voor de koopovereenkomst ‘Wat we vorig jaar hebben opgeleverd en inmiddels door een aantal marktpartijen wordt geïmplementeerd, is de standaard voor de koopovereenkomst. Voorheen was dit een papieren document, met een heel pakket aan bijlagen en nu is daar dus, kort gezegd, een digitaal bestand van gemaakt. Ook een digitaal identiteitsbewijs is daar onderdeel van: de consument kan nu zelf eenvoudig aangeven met welke partijen dit gedeeld mag worden. Denk dan aan de makelaar, de financieel adviseur of de notaris. Het idee is uiteindelijk dat de consument alle benodigde informatie met één druk op de knop binnen de keten kan delen, op een efficiënte en veilige manier in een omgeving waar hij zelf de absolute beschikking en regie over heeft.’ Het maken van standaarden en afspraken Leon: ‘Wat Zorgeloos Vastgoed concreet doet is het maken van standaarden en afspraken binnen de keten, zodat partijen dit kunnen adapteren en implementeren in hun software. Wij bouwen zelf geen platform, maar blijven op non-concurrentieel vlak actief. We zorgen dat de standaard actueel blijft en voldoet aan de wensen van iedere ketenpartij. Daarnaast adviseren we partijen bij de implementatie van de standaarden. We voorzien dat er omgevingen komen, lijkend op bijvoorbeeld mijnpensioenoverzicht.nl of mijnoverheid.nl, waarin alle gegevens opgeslagen en beheerd kunnen worden. Zo ontstaat er voor de consument overzicht.’ Veel zaken gaan al goed ‘Gelukkig kunnen we constateren dat er al een bestaande wereld is waarin er heel veel zaken efficiënt geregeld zijn. Daar willen we op voort bouwen, onder andere met volwassen partijen zoals ECH. Zij kwamen tijdens onze eerste schets waarin we bekeken hoe het vastgoedproces werkt, prominent naar voren als een bestaande en bestendige standaard’, vertelt Leon. ‘Wanneer je kijkt naar ECH, dan zie je dat er een heel goed werkend proces en platform is. Een platform waar nagenoeg alle notarissen bij aangesloten zijn. Dat helpt om gemakkelijk de keten te kunnen bedienen. Daarnaast heeft ECH een behoorlijk unieke positie in de keten, zij richten zich specifiek op standaardisatie van afspraken. Betrouwbaarheid en veiligheid spelen daarin een belangrijke rol, en het niveau daarvan is erg hoog. Tot slot is er een enorme schat aan kennis aanwezig binnen de stichting, en dat is heel fijn voor de andere ketenpartners. Daarom ben ik blij dat ECH haar voornemen heeft uitgesproken om deel te nemen aan het initiatief.’ Alles draait om de klantreis ‘Uiteindelijk richten alle initiatieven zich op de klantreis van de consument, want daar doen we het uiteindelijk voor. Onze start met de digitale koopovereenkomst is pas het begin, we hebben nog veel meer op stapel staan en zijn continu in gesprek met partijen binnen de keten.’ ‘Wat wij willen? In elke woonfase de juiste informatie, met één druk op de knop. Dáár draait het om. Met het nieuwe afsprakenstelsel werken we aan gemak, duidelijkheid en zekerheid. Voor de consument én de betrokken marktpartijen’, besluit Leon. Meer informatie Wil je meer weten over Zorgeloos Vastgoed, de visie van Leon Roseleur of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:00:23Z",
  "source": "ech.nl"
}