{
  "id": "1c269f63ba990ab3aab0f7cd5954497892b33c2e",
  "url": "https://www.ech.nl/aard-en-nummer-id/",
  "title": "Aard en nummer identiteitsdocument per 1 januari 2023 niet meer in akte & volmacht - ECH",
  "text": "Aard en nummer identiteitsdocument per 1 januari 2023 niet meer in akte & volmacht - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Aard en nummer identiteitsdocument per 1 januari 2023 niet meer in akte & volmacht / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Onlangs heeft de Koninklijke Notariële Beroepsorganisatie aangekondigd dat er een wijziging in de notariswet gaat plaatsvinden per 1 januari 2023. Deze wijziging houdt in dat de aard en het nummer van een identiteitsdocument niet meer in de de aktes en volmachten worden opgenomen. Deze wijziging kan impact hebben op uw organisatie. Aanleiding en achtergrond Aanleiding voor deze wijzigingen is de maatschappelijke discussie over privacygevoelige gegevens. Door de wetswijziging zijn de aard en het nummer van identiteitsdocumenten van personen niet meer zichtbaar in de openbare registers van het Kadaster. Deze gegevens worden bovendien al niet door het Kadaster gebruikt en hebben geen functie voor het raadplegen van de openbare registers. Gelet op deze achtergrond en op de AVG brengt deze wetswijziging mee dat de aard en het nummer van het identiteitsdocument vanaf 1 januari 2023 niet meer in de akte (dan wel in de aan de akte te hechten volmacht) mogen worden opgenomen. Tot en met 31 december 2022 geldt deze verplichting echter nog wel onverkort op grond van het bepaalde in artikel 39 lid 1 van de Wet op het notarisambt. Wat verandert er? In afschriften van hypotheekaktes worden de aard en het nummer van identiteitsbewijzen niet meer vermeld. Wanneer gaat de wijziging in? Hypotheekakten die na 1 januari 2023 worden gepasseerd vermelden geen aard en nummer meer. Wat moet u doen? Als u geen gebruikt maakt van deze gegevens afkomstig van de notaris, hoeft u niks te doen. Anders moet u die werkwijze aanpassen. Gedetailleerde informatie Notarissen hoeven vanaf 1 januari 2023 niet meer de aard en het nummer van het identiteitsdocument in de akte te vermelden. Dit staat in de Verzamelwet Justitie en Veiligheid 2022 en het bijbehorende inwerkingtredingsbesluit . In artikel 39 lid 1 van de Wet op het notarisambt is bepaald dat de notaris de identiteit van de personen die de eerste keer voor hem verschijnen vaststelt aan de hand van een identiteitsdocument zoals bedoeld in artikel 1 van de Wet op de identificatieplicht. De aard en het nummer daarvan vermeldt de notaris in de akte. Deze laatste verplichting komt te vervallen. In hetzelfde wetsartikellid staat de verplichting om de aard en het nummer van het identiteitsdocument in de aan de akte te hechten volmacht (dan wel indien krachtens mondelinge volmacht wordt gehandeld in de akte) op te nemen, indien de natuurlijke personen die volgens de akte als partij optreden niet bij het verlijden van de akte verschijnen. Ook deze verplichting vervalt. Beide wijzigingen treden per 1 januari 2023 in werking. De KNB heeft in de consultatie over het voorstel voor deze wetswijziging aangegeven zich in de voorgestelde wijzigingen te kunnen vinden. Voor de notaris vervalt een verplichte administratieve handeling die niet bijdraagt aan meer rechtszekerheid of fraudepreventie. De verplichting voor de notaris om de identiteit van cliënten te verifiëren blijft onverkort van toepassing. Voor deze verificatie is echter niet noodzakelijk dat identiteitsgegevens vervolgens in de akte of in de aan de akte te hechten volmacht worden opgenomen. Vanwege de bewijsvoering door de notaris dat aan de identificatieplicht is voldaan, beveelt de KNB aan de aard en het nummer van het identiteitsdocument wel in het dossier op te nemen. Meer informatie Wil je meer weten over deze wijziging in de notariswet, of heb je algemene vragen over ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T03:56:02Z",
  "source": "ech.nl"
}