{
  "id": "1d2d60447cc330126ed6536dc800270162b29405",
  "url": "https://www.ech.nl/contact/",
  "title": "Contact | ECH",
  "text": "Contact | ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Vragen? Neem contact op Om snel geholpen te worden en een goed antwoord op je specifieke vraag te krijgen is het belangrijk dat je contact opneemt met de juiste partij. Onderstaand vind je alle benodigde informatie. Contact met één van de aangesloten partijen Voor notarissen Zaakinhoudelijke vragen over een dossier? Neem contact op met de betrokken hypothecair financier. De contactgegevens zijn opgenomen in de ECH-zaak. Daarnaast zijn de contactgegevens gepubliceerd op de informatiepagina van de betreffende financier (te bereiken via ‘voor notarissen’). Technische vragen over de werking van het softwarepakket? Neem contact op met de servicedesk van je softwareleverancier. Aansluiten bij ECH of overige vragen? Neem contact op met de servicedesk ECH via info@ech.nl of bel via 070 330 7135. Voor hypothecair financiers Zaakinhoudelijke vragen over een dossier? Neem contact op met de betrokken notaris. Technische vragen over de werking van het systeem? Neem contact op met de functioneel beheerder van jouw organisatie. Aansluiten bij ECH of overige vragen? Neem contact op met het secretariaat via info@ech.nl of bel via 070 3307111. Voor overige partijen Neem contact op met de servicedesk ECH via info@ech.nl of bel met de servicedesk via 070 3307135. Blijf op de hoogte Stichting ECH verspreidt iedere maand een nieuwsbrief om stakeholders en relaties te informeren over het reilen en zeilen van ECH. Naast onze ECH website en LinkedIn bedrijfspagina vormt dit een aanvullend middel om iedere betrokkene te bereiken. ECH is een keteninitiatief, voor én door hypothecair financiers en notarissen, waarbij ook softwareleveranciers en servicers samenwerken om de keten verder te optimaliseren. Vanuit die ketengedachte vinden we het belangrijk om onze stakeholders beter te informeren. Benieuwd naar de ontwikkelingen bij Stichting ECH, meld je aan door onderstaand formulier in te vullen en blijf op de hoogte! Schrijf je in voor onze nieuwsbrief Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:04:51Z",
  "source": "ech.nl"
}