{
  "id": "1e8b44620ab2871367359d750b332531c0e57ac4",
  "url": "https://www.ech.nl/bestuur-aan-het-woord-peter-doornbos/",
  "title": "Bestuur aan het woord - Peter Doornbos - ECH",
  "text": "Bestuur aan het woord - Peter Doornbos - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestuur aan het woord – Peter Doornbos / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken / Door Raymond Bloot ‘Vooruitgang, dat is de rode draad in mijn leven’, zegt Peter Doornbos ‘Wie de mens achter de bestuurder is? Zakelijk gezien ben ik een gedreven, analytisch en resultaatgericht persoon met een insteek om zaken continu te verbeteren. Dat richt zich dan met name op de balans tussen business, IT en processen. Daar ben ik mijn hele carrière mee bezig geweest in verschillende hoedanigheden, zowel binnen Nationale Nederlanden als binnen ECH.’ Dat zegt Peter Doornbos , IT Lead Hypotheken & Consumptief Krediet bij Nationale Nederlanden en bestuurslid ECH. ‘Samengevat concentreert mijn passie zich eigenlijk vooral rondom één thema: vooruitgang. Dat is het woord dat mij karakteriseert. Ik geloof dat het morgen áltijd beter kan en dat er, wanneer je op de juiste manier naar zaken durft te kijken, overal kansen zijn.’ Peter Doornbos, IT Lead Hypotheken & Consumptief Krediet bij Nationale-Nederlanden Over skiën, snelheid en het bourgondische leven ‘Wanneer je me privé in het hart kijkt, dan ben ik een familieman die het leuk vindt om met mijn vrouw, twee kinderen en drie kleinkinderen leuke dingen te doen. Afgelopen januari is een van mijn dromen uitgekomen, toen we met kinderen en kleinkinderen zijn gaan skiën. Precies zoals we dat zelf jarenlang met ons gezin gedaan hebben. En we hebben zelfs echte tochten kunnen maken met de kleinkinderen van 5 en 7, dat zijn mooie dingen’, vervolgt Peter. ‘Verder ben ik geïnteresseerd in auto’s, motoren en eigenlijk alles wat met snelheid te maken heeft. En binnenkort gaat een andere droom in vervulling als we naar onze nieuwe woning verhuizen die nu gebouwd wordt. Daar kijk ik enorm naar uit. En, zoals veel mensen, houd ik van lekker eten, vakanties en een goed glas wijn.’ Lid van het bestuur sinds eind 2017 ‘Sinds oktober 2017 zit ik, als afgevaardigde vanuit de Raad van Advies in het bestuur van stichting ECH’, aldus Peter. ‘Binnen die rol richt ik me vooral op de portefeuille change en IT. Dat doe ik samen met Floris Beerens, directeur IT en Operations bij ECH, we spreken elkaar regelmatig en dat contact verloopt heel prettig.’ Dit jaar op de agenda ‘Voor aankomend jaar hebben we een aantal interessante topics op de agenda staan. Zo zijn we het platform aan het vernieuwen, onder meer door dit onder te verdelen in kleinere componenten. Daardoor kunnen we sneller reageren en worden we wendbaarder. Het belangrijkste gevolg hiervan is dat de diensten onderling niet meer afhankelijk van elkaar zijn tijdens de doorontwikkeling. Concreet betekent het dat we losse onderdelen kunnen aanpassen en verbeteren, zodat het sneller live kan worden gezet. Denk hierbij aan extra features binnen het passeerproces. Maar ook voor andere processen is het los van elkaar laten functioneren van de diverse diensten een belangrijke vooruitgang’, vervolgt Peter. Veranderteam blijkt waardevol ‘Verder beschikken we sinds een klein jaar over een eigen veranderteam. Ik verwacht dat dit het komende jaar voor meer efficiëntie gaat zorgen in onze basisdienstverlening, zodat het proces van passeren maar ook dat van aflossen verder wordt geoptimaliseerd. Ook zijn we sneller in staat om nieuwe diensten toe te voegen, zoals het bankgarantieproces, ontslag hoofdelijke aansprakelijkheid en de automatische controle van de koopakte. Kortom, meer kort cyclisch kunnen opereren.’ ‘Tot slot maken we ons met elkaar hard om de wisselwerking tussen het bestuur en de Raad van Advies nog verder te verbeteren. Samengevat richt ik me, met de anderen, de komende periode vooral op het klaarstomen van ECH voor de volgende fase. Als ik naar mijn rol in dat geheel kijk dan heb ik veel zin om de wendbaarheid en snelheid waarmee we de toekomst in gaan nog verder te vergroten.’ Actieve bijdrage vanuit tweeledig perspectief ‘Wanneer je me vraagt waarom ik werken voor ECH waardevol vind, dan is het antwoord voor mij tweeledig. Ten eerste vind ik het leuk om buiten mijn eigen bedrijf een functie te vervullen. Dit verruimt mijn blikveld. En ten tweede, en dat gaat specifiek over ECH, is het een mooi, jong bedrijf om in te werken. Men timmert bijzonder goed aan de weg en zit midden in de transitie naar volwassenheid. Ik vind het zinvol en plezierig om daar vanuit mijn jarenlange ervaring een bijdrage aan te mogen leveren.’ Iedereen is gericht op succes ‘Trots ben ik ook op de sterke en harmonieuze sfeer die er binnen het bestuur heerst. Daar hebben we met zijn allen aan bijgedragen; dit gevoel maakt dat we vol vertrouwen de volgende fase in kunnen. De samenwerking, betrokkenheid en onderlinge loyaliteit is heel hoog. Ik heb al in veel verschillende situaties gewerkt, maar op deze manier heb ik dat nog niet vaak meegemaakt. Iedereen, en dat geldt zowel voor de directie, het bestuur en de Raad van Advies, wil er een succes van maken. Dit maakt dat thema’s gemakkelijk besproken kunnen worden en er geen ruis is onderling. Iedereen is gericht op het succesvol maken van ECH als een bedrijf dat stabiel en duurzaam in de markt staat. Misschien lijkt het zo specifiek benoemen van deze sfeer wat onbenullig, want ik had ook kunnen zeggen dat ik trots ben op een bepaalde prestatie die we geleverd hebben. Maar voor mij gaat het veel meer over de samenwerking en de manier waarop de reis naar het doel toe verloopt. Dát vind ik vooruitgang en geeft me bergen energie.’ Meer informatie Wil je meer weten over de visie van Peter Doornbos of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:20:05Z",
  "source": "ech.nl"
}