{
  "id": "1f3d7337d4732234b653b7ab7806f3bce89fbca8",
  "url": "https://www.ech.nl/meet-the-team-faheem-malhi/",
  "title": "Meet the team - Faheem Malhi - ECH",
  "text": "Meet the team - Faheem Malhi - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Faheem Malhi / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Collega Faheem vertelt over slim beheer, samenwerking, voetbal én darten ‘Ik richt me vooral op functionele beheerwerkzaamheden, en dan afwisselend voor stichting ECH en de KNB . Hoe mijn werkdag er eruitziet? Eén ding is zeker, geen dag is hetzelfde.’ Aan het woord is Faheem Malhi , functioneel beheerder en consultant vanuit Davinci Consulting voor ECH. ‘Uiteraard is er vanuit de verschillende partijen dagelijks overleg om de voortgang te bespreken en vervolgens gaan we aan de slag met onze tweewekelijkse release. De ene week ben ik, kort samengevat, bezig met het accepteren van de release en de andere week met het oppakken van taken rondom de werking daarvan. Zo houd ik me bezig met het uitvoeren van regressietesten om te kijken of alles rondom gerelateerde applicaties nog naar behoren werkt. Het bijhouden van de functionele mailbox en antwoord geven aan maatschappijen die vragen hebben, zijn andere taken die binnen mijn pakket horen. Daarnaast werken we dagelijks aan de tweedelijnstickets, welke via onze servicedesk binnenkomen. Deze komen vooral vanuit notariskantoren en soms vanuit andere partijen. Wanneer een individuele gebruiker er niet uitkomt dan geven wij uitleg en als het op grootschaliger niveau niet werkt, dan pakken we dit samen met het ontwikkelteam op. Kortom, ik hoef me niet te vervelen’, lacht Faheem. Faheem Malhi, Functioneel beheerder ECH Geslaagde dag als… ‘Mijn dag is geslaagd als er geen openstaande problemen meer zijn, dat vind ik het fijnst. Het liefst los ik problemen dezelfde dag op en als dat niet lukt wil ik er zeker van zijn dat ik de juiste taak bij de juiste persoon hebt aangekaart. Dit werk past prima bij mijn karakter: ik vind het fijn om afspraken na te komen, werk graag oplossingsgericht en vind tussentijdse communicatie belangrijk. Dat is belangrijk als iets niet direct opgelost kan worden. Mijn ervaring is dat klanten dit niet per se erg vinden, zolang er maar wel tijdig én duidelijke feedback gegeven wordt.’ ECH: een net bedrijf waarin de zaken goed georganiseerd zijn ‘Zelf heb ik een hypothecaire achtergrond, ik heb een kleine 15 jaar in de hypotheekbranche gewerkt. Uiteindelijk ben ik als ICT’er in de mid-office processen beland. Ik was veel bezig met het doorvoeren van verbeteringen, en het naadloos op elkaar aan laten sluiten van verschillende bronnen. Toen kwam ECH op mijn pad. Ik leerde dat kennen als een fijn en net bedrijf waarin de zaken goed georganiseerd zijn. En dat wekte mijn interesse. In mijn oude rol heb ik eerst nog de implementatie van ECH doorgevoerd en vervolgens heb ik concreet gesolliciteerd.’ ‘Ik werk nu zo’n anderhalf jaar voor de stichting en dit is vooral digitaal geweest vanwege de uitbraak van corona. En dat terwijl ik enorm van mensen om me heen houd, het koffiekamerpraatje vind ik belangrijk en gezellig. Aan de andere kant ben ik ook prima in staat om heel zelfstandig te werken. Ondanks het werken op afstand, ben ik prima opgevangen: de eerste positieve indruk die ik had is ook écht waargemaakt’, zegt Faheem. ‘We zijn, met elkaar, dag in dag uit bezig om de partijen waar we nauw contact mee hebben hun werk zo aangenaam mogelijk te laten doen. Die samenwerking met de partijen uit de keten is ook heel belangrijk, we krijgen graag vanuit hen de input zodat we de processen nog beter proberen te optimaliseren. Gelukkig is die samenwerking meer dan prima, dat zie je nu ook bij het proces rondom de bankgarantie dat opgepakt wordt.’ Faheem over trots zijn op ‘Ik vind het nog lastig om te zeggen waar ik trots op ben. Misschien dan toch de situatie waarin een release succesvol geïmplementeerd is zonder dat er storingen zijn ontstaan. Wanneer wij op een donderdagavond een implementatie doorvoeren en op vrijdag komen er storingsmeldingen binnen dan baal ik écht. We willen immers zoveel mogelijk gemak en zekerheid bieden. Gelukkig gaat het meestal goed: alleen storingen helemaal wegnemen kunnen we helaas (nog) niet. Aan de andere kant: in het eerste jaar dat ik voor de stichting werkzaam was is de vernieuwde webcliënt uitgerold en daar zijn geen problemen ervaren. Dat geeft mij het gevoel dat de werkzaamheden goed zijn uitgevoerd. Wanneer er onverhoopt incidenten ontstaan, dan wil ik die zo snel en correct mogelijk naar tevredenheid oplossen.’ ‘Verder ben ik, vanuit mijn rol als functioneel beheerder, vaker van plan om fysiek bij mijn relaties op bezoek te gaan. Dat was in de afgelopen periode natuurlijk lastig door het werken op afstand. Ik wil in de praktijk graag zien hoe het proces voor de gebruikers werkt, luisteren naar wat mensen ervaren en dit vervolgens inzichtelijk maken om nog meer verbeteringen door te voeren indien nodig.’ Over voetballen, wielrennen en darten ‘In mijn vrije tijd houd ik me, naast met mijn gezin, graag bezig met voetbal. Ik ben supporter van ADO Den Haag en probeer zo nu en dan een wedstrijd mee te pakken. Daarnaast speel ik darts in competitieverband. Dat doe ik al jaren en het is eigenlijk meer een samenkomen met vrienden. Door de wedstrijden die uitgezet zijn is er een terugkerend patroon waardoor je dezelfde mensen steeds opnieuw ziet. Dat geeft vriendschap en verbinding. Tot slot pak ik graag mijn wielrenfiets en maak ik, in mijn eentje, mijn hoofd leeg terwijl ik van de mooie omgeving geniet.’ Meer informatie Heb je vragen voor de Faheem, heb je ideeën of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor ieder klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:24:20Z",
  "source": "ech.nl"
}