{
  "id": "203d6bad25c762992ed8162f9f34cd643b322653",
  "url": "https://www.ech.nl/ech-rondt-soc2-type-i-audit-af/",
  "title": "ECH rondt SOC2 Type I audit af - ECH",
  "text": "ECH rondt SOC2 Type I audit af - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH rondt SOC2 Type I audit af / Nieuws / Door echadmin Goed nieuws! Na ruim een jaar intensieve voorbereiding heeft ECH op woensdag 20 mei de SOC2 type I rapportage van BDO mogen ontvangen. Hiermee sluit ECH de eerste fase van het SOC2-traject succesvol af. SOC2 is een internationale norm waarmee IT-serviceorganisaties inzicht geven in hun interne beheersingsmaatregelen ten aanzien van de beveiliging van IT-omgevingen/data. Dit gebeurt aan de hand van een assurance verklaring. Aandachtsgebieden zijn bijvoorbeeld beschikbaarheid, integriteit, vertrouwelijkheid en privacy. Met een SOC2-rapportage krijgen de op ECH aangesloten hypotheekverstrekkers en serviceorganisaties inzicht in de kwaliteit van de maatregelen die ECH heeft getroffen om haar dienstverlening zo betrouwbaar mogelijk aan te bieden. Uiteraard zijn we als ECH erg trots op het behaalde resultaat! We willen alle betrokkenen van Avisi, KNB, Davinci en de werkgroep security van harte bedanken voor hun bijdrage aan dit project. De komende tijd zullen we bepalen op welke wijze we vervolg geven aan het traject zodat we volgend jaar ook over een SOC2 type II rapport kunnen beschikken. Mocht u meer informatie willen hebben over het rapport, neem dan gerust contact op met ons op. Meer informatie over de SOC2-route van ECH kunt u vinden in ons vorige nieuwsbericht over SOC2 . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:22:06Z",
  "source": "ech.nl"
}