{
  "id": "20a8fddf451044bd6b972df0e8ac4fad3db4679d",
  "url": "https://www.ech.nl/samenwerking-tussen-knb-en-ech/",
  "title": "Hans Kuijpers, directeur KNB, over de samenwerking met stichting ECH - ECH",
  "text": "Hans Kuijpers, directeur KNB, over de samenwerking met stichting ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Hans Kuijpers, directeur KNB, over de samenwerking met stichting ECH / KNB , Nieuws , Notaris , Referenties notariaat / Door echadmin ‘Het is altijd de bedoeling geweest om de notarissen met de geldverstrekkers, ook op een digitale manier, met elkaar te verbinden. En na een aardige aanloopperiode, inmiddels al zo’n 10 jaar geleden, zijn de meeste kantoren, op enkele uitzonderingen na, wel aangehaakt.’ Dat zegt Hans Kuijpers, directeur van de Koninklijke Nederlandse Beroepsorganisatie. ‘Daarmee heb je als brancheberoepsorganisatie een prima uitgangspositie, omdat je als het ware een soort scharnierpunt wordt. Hoe meer partijen er aangesloten zijn, hoe interessanter het immers wordt. Je zou kunnen spreken van een zwaan-kleef-aan effect. Ik denk dat stichting ECH een mooie, natuurlijke positie heeft verworven die van belang is voor onder meer goede communicatie tussen de financiële dienstverleners en het notariaat.’ Hans Kuijpers, directeur van de KNB (Koninklijke Notariële Beroepsorganisatie) . Uitbreiding van processen ‘Zelf ben ik als directeur van de KNB niet echt betrokken bij de operationele kant rondom de samenwerking met ECH. Maar ik hoor niet terug dat het fout gaat, dus dan zal het wel naar behoren lopen. Als ik zelf denk aan de stichting ECH dan komen woorden als enthousiast en betrokken bij me op en daarnaast denk ik meteen aan Lisa die als directeur functioneert en natuurlijk aan Floris, actief als manager operations’, lacht Hans. ‘Maar, zonder gekheid, het platform van ECH en alles daaromheen heeft bewezen stabiel te zijn en goed te functioneren. Ook denk ik dat we met elkaar veel potentie voor de toekomst hebben, kijkend naar de groei van het dienstenpakket. Dit willen we graag verder verbreden. Ik zie bijvoorbeeld veel kansen voor het inrichten van nieuwe processen. En daarin sta ik niet alleen, want ECH is een gearriveerde partij, die bol staat van mensen en ervaring. De stichting heeft, ook kijkend naar innovatieve processen, al vele malen bewezen dat ze snapt hoe het werkt. En dat biedt een kans voor het dienstenpalet en voor de verbreding daarvan.’ “Het is tijd voor verandering en optimalisatie, en dat in de breedste zin van het woord.” Hans Kuijpers, directeur van de KNB (Koninklijke Notariële Beroepsorganisatie) Data-uitwisseling binnen de financiële keten Hans: ‘Verder denk ik dat we binnen de keten nog behoorlijke slagen kunnen maken wanneer we kijken naar data-uitwisseling over de keten heen. Dit kan echt verder geoptimaliseerd worden. Uiteindelijk wint de klant daarmee, en daar is het toch allemaal om begonnen. Daarom vind ik het onze gezamenlijke rol om positief-kritisch te blijven kijken naar klantprocessen binnen de financiële wereld. En daarnaast uiteraard of stichting ECH een verdere bijdrage kan leveren aan de verbetering daarvan. Geldverstrekkers die zich aansluiten bij deze digitale brievenbus tussen notariaat en financieel dienstverleners ervaren zonder uitzondering kwaliteit, betrouwbaarheid en efficiëntie. Uiteraard moet iedereen dat voor zichzelf bekijken, maar deelname aan de stichting staat garant voor vooruitgang en verder verbeteren van je dienstverlening.’ AVG versus de ouderwetse postduif ‘Ik vraag me sowieso wel af hoe geldverstrekkende partijen die niet aangesloten zijn op dit moment op een veilige manier informatie verstrekken aan cliënten. Want de gewoonte waarin we via e-mail offertes en andere privacygevoelige gegevens deelden ligt echt al wel even achter ons. Om van de fysieke post nog maar te zwijgen’, aldus Hans. ‘Je zou zelfs kunnen stellen dat dit op een breder vlak geldt, want uit onderzoek blijkt dat de eindklant een meer proactieve houding van de notaris waardeert. Er lijkt niets mis met een initiërend telefoontje om te informeren of de bedrijfsvorm nog bij die ondernemer past, het testament na jaren misschien nog eens nagekeken kan worden en of dat de huwelijkse voorwaarden nog altijd naar behoren zijn. Dat heeft niets met verkoop of commercie, maar álles met klantgerichtheid, rechtszekerheid en meegaan met de tijd, de gewenste proactiviteit, van nu te maken. En daar past de samenwerking tussen ECH en de KNB wat mij betreft helemaal bij’, besluit Hans. Meer informatie Wil je meer weten over de samenwerking tussen Stichting ECH en de Koninklijke Notariele Beroepsorganisatie? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:08:07Z",
  "source": "ech.nl"
}