{
  "id": "21d5771b026b473e908d082bbc94aaa3f625b89f",
  "url": "https://www.ech.nl/ech-gebruikersdag-2019-groot-succes/",
  "title": "ECH gebruikersdag 2019 groot succes! - ECH",
  "text": "ECH gebruikersdag 2019 groot succes! - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH gebruikersdag 2019 groot succes! / Nieuws / Door Ruby Donderdag 26 september heeft er op landgoed groots kievitsdal te baarn de ECH gebruikersdag plaatsgevonden met dit jaar als thema ‘dialoog in de hypotheekketen’. Het bestuur, het management en de betrokken consultants vanuit het ECH-team kijken terug op een interactieve, constructieve en vooral leuke dag! Klik hier voor de presentatie. Ervaringen Directeur lisa huisman stond tijdens de gebruikersdag stil bij de 16e verjaardag van stichting ECH en trok de parallel met een mensenleven. “als 16 jarige ben je een jong volwassene. De afgelopen jaren zijn grote stappen gezet in het verder professionaliseren (van de dienstverlening) van de stichting, maar we zijn er nog niet helemaal, het kan altijd beter. De komende tijd zullen we de spreekwoordelijke ‘puntjes op de i zetten’.” Ze deed aan alle partijen de oproep om ECH van input te voorzien om op die manier bij te dragen aan het ‘volwassen’ worden van de organisatie. Manager operations floris beerens van stichting ECH vond persoonlijk de ‘bankenmarkt’ het hoogtepunt van de dag. Het notariaat en de softwareleveranciers gingen in gesprek met de hypothecair financiers.  Wat gaat goed? Maar vooral; wat kan beter? Mooi voorbeeld van het bundelen van krachten om procesoptimalisatie te bewerkstelligen. Bankenmarkt Om de dialoog binnen de keten mogelijk te maken hebben we het concept de ‘ECH bankenmarkt’ in het leven geroepen. De ECH-maatschappijen, softwareleveranciers en (kandidaat-)notarissen en/of medewerkers uit het notariaat kregen de gelegenheid om in gesprek te gaan om de wederzijdse dienstverlening verder te verbeteren, met als doel een optimale klantbeleving. De bankenmarkt is erg positief ervaren. De interactiviteit zorgt voor meer inzicht over en weer. De geslaagde middag krijgt zeker een vervolg. Contact Mocht u nog vragen en of opmerkingen hebben (nu of in de toekomst) dan zijn wij bereikbaar via info@ECH.nl of via 070 – 33 07 111. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:04:18Z",
  "source": "ech.nl"
}