{
  "id": "222e84f71b85c3f41057506994dfd99a9977a8e8",
  "url": "https://www.ech.nl/bestuurswissel-stichting-ech-2/",
  "title": "Bestuurswissel stichting ECH - ECH",
  "text": "Bestuurswissel stichting ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestuurswissel stichting ECH / Nieuws / Door Ruby Stichting ECH verwelkomt jolanda de heer van de Rabobank als nieuw bestuurslid. Vanaf medio april heeft zij de bestuurszetel van geert roggen (eveneens Rabobank) overgenomen. Het bestuur van ECH vergadert elke maand en wordt van gevraagd en ongevraagd advies voorzien door de raad van advies. Geert roggen is 7,5 jaar lang bestuurslid bij ECH geweest. Samen met de andere bestuurders , peter doornbos (programmadirecteur bij Nationale Nederlanden bank), bernadette verberne (manager ict & innovatie bij de KNB), en remco van der kuijp (notaris en bestuurslid bij de KNB) heeft geert zich onder meer ingezet voor het verbeteren van de financiële positie van ECH zonder de kerntaak van de stichting uit het oog te verliezen. Mede dankzij zijn positief kritische blik heeft ECH inmiddels een positief eigen vermogen en zijn de weerstandsreserves zo goed als gevuld. De komende jaren zullen de deelnemers van ECH hier de vruchten van gaan plukken. Er is immers meer ruimte om te investeren in optimalisatie van de keten. Bovendien overweegt het bestuur een verlaging van de kosten voor de deelnemers vanaf 2020. ECH dankt geert voor alle tijd en energie die hij in het verder professionaliseren van ECH heeft gestoken. Mede door zijn toewijding en betrokkenheid heeft de stichting enorme stappen voorwaarts kunnen zetten. Zelf zegt hij er het volgende over: “ik kijk met bijzonder veel plezier en trots terug op de laatste 7,5 jaar. Samen met de KNB, de notarissen en de financiële instellingen hebben we grote stappen gezet voor de hypotheekketen en van ECH dé norm in hypotheekcommunicatie gemaakt. Het meest gebruikt in de markt, werkt altijd, is zeer veilig en levert dagelijks grote waarde in het foutloos bedienen van onze klanten. Ik heb hierbij de fantastische samenwerking met mijn mede bestuursleden en het geweldige ECH-team zeer gewaardeerd. Door de open communicatie, grote inzet en betrokkenheid hebben we de stichting telkens weer naar een hoger niveau gebracht. Ik weet zeker dat we met jolanda de heer een excellente ervaren opvolger hebben gevonden die met veel plezier en energie voor ECH aan de slag zal gaan.” Geert geeft het stokje aldus door aan jolanda de heer (business lead aanvraag & afsluiten hypotheken bij Rabobank). Met de komst van jolanda waait er een frisse wind binnen ECH. Jolanda begon bijna 20 jaar geleden als managementtrainee bij de Rabobank en heeft sindsdien zo goed als alle facetten van de hypotheekketen mogen ervaren. Haar expertise op het domein van digitalisering, it, verandermanagement, customer journey’s en hypotheekprocessen zal zij inzetten om een bijdrage te leveren aan het verwezenlijken van de ambities van ECH. “ik heb er ontzettend veel zin in om samen met mijn collega’s verder te bouwen aan de belangrijke bijdrage die ECH levert om iedere dag weer een 9+ klantbeleving te creëren.”  Wij heten jolanda van harte welkom en wensen haar veel succes en plezier bij ECH! Heeft u vragen aan het bestuur of wilt u punten agenderen voor de vergaderingen dan kunt u deze kenbaar maken via info@ECH.nl. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:06:11Z",
  "source": "ech.nl"
}