{
  "id": "237048017ab648dde3e6a001cfb5f62c72167b36",
  "url": "https://www.ech.nl/meet-the-team-skip-de-groot/",
  "title": "Meet the team - Skip de Groot - ECH",
  "text": "Meet the team - Skip de Groot - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Skip de Groot / ECH medewerkers , Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Alles draait om de inzetbaarheid voor de eindgebruiker’ ‘Mijn rol is helder: ik werk als ontwikkelaar, en dan in de meest brede zin van het woord. Ik houd me bezig met alles wat met software te maken heeft. Dat gaat van nieuwe software schrijven, tot overleggen en nadenken over nieuwe functionaliteiten tot het draaiend houden van de software zelf.’ Dat zegt Skip de Groot , softwareontwikkelaar, vanuit softwarebedrijf Avisi betrokken bij Stichting ECH. ‘Uiteraard doe ik dit niet alleen, maar werk ik binnen een team waarin iedereen zijn eigen specialisme heeft. Ik ben zelf vooral gericht op de back-end software, al kunnen we elkaar onderling qua kennis en kunde ook prima vervangen. Ik werk inmiddels alweer 4,5 jaar voor Avisi en voor ECH nu zo’n 2 jaar, waarvan het laatste half jaar in het fonkelnieuwe ECH-ontwikkelteam. Dit betekent dat we met het hele team dedicated voor ECH aan de slag zijn.’ Skip de Groot, softwareontwikkelaar voor ECH Eigen team werkt optimaal ‘Toen duidelijk werd dat de stichting een eigen team ging krijgen, heb ik meteen gevraagd of ik daar onderdeel van zou mogen zijn. Er was namelijk al langere tijd sprake van dat het project gebaseerde werken, wat we tot dan toe deden, niet helemaal opleverde wat we met elkaar voor ogen hadden. Toen werd er een project opgepakt, afgerond en ging een ander team dit onderhouden. Dat werkte niet optimaal, projectonderhoud is immers een doorlopend proces, want vaak zijn er nog vragen of aanpassingen die gedaan mogen worden. Nu, in dit ontwikkelteam, zijn we van het begin tot het eind bezig, verantwoordelijk en kunnen we nóg beter staan voor de kwaliteit van de applicatie die overigens een hoge standaard kent.’ Nauw betrokken bij ECH ‘De mensen in ons team zijn stuk voor stuk nauw betrokken bij ECH. We zijn met elkaar steeds bezig om alles in goede banen te leiden, en we functioneren heel soepel als team. Het voelt zeker niet als gedetacheerd werken. Het oppakken van de projecten, en de verschillende taken daarbinnen, gaan heel erg in samenspraak. Binnen die collegiale sfeer is er bovendien ook ruimte om écht kritische vragen aan elkaar te stellen. Dat maakt het niet alleen leuk, maar daardoor halen we er ook het maximale uit samen’, aldus Skip. Scrums, sprints en stand-ups ‘Hoe mijn werkweek eruitziet? Nou, dat is een vrij traditionele scrumwerkweek zoals gebruikelijk binnen de IT-wereld. Elke werkdag begint met onze stand-up en we werken in tweewekelijkse sprints. Naast onze zeer nauwe samenwerking met het ECH-team, werken we uiteraard geregeld samen met andere betrokken partijen om de software continu te verbeteren. Voor de zaken die uitgekristalliseerd zijn binnen het normale softwareontwikkelingsproces, kan ik vaak al voortvarend gaan bouwen. Daarnaast verzorgen we ook regelmatig afhandelingen van beheer en support, waarbij er meestal direct een antwoord nodig is. Bijvoorbeeld als iets niet functioneert bij een klant of als een hypothecair financier een foutmelding bij het verwerken van een bepaald bericht krijgt.’ Werk is leuke puzzel ‘Ik ervaar mijn werk niet per se als intensief en dat heeft ook te maken met de afwisseling door de dag heen. Ik ben niet de hele dag met code bezig, maar juist ook met overleggen en uitzoekwerk. Daarnaast vind ik het leuk om naast het oplossen van eventuele productieproblemen, uit te zoeken hoe we kunnen voorkomen dat deze terugkeren. Het is juist deze afwisseling die maakt dat ik me graag aanmeldde voor dit team. Ik voel me geestelijk behoorlijk uitgedaagd en kan er veel energie van krijgen als we een oplossing vinden die voor iedereen werkt en die bepaalde situaties structureel verbetert. We streven er natuurlijk naar dat er geen problemen voorkomen, maar áls ze dan voorkomen dan proberen we ervoor te zorgen dat dit in de toekomst niet meer gebeurt. Dat is een leuke puzzel’ ‘Het meest trots ben ik overigens op de switch naar dedicated werken, zodat onze aanpak niet meer project gebaseerd is. Doordat we nu als een vast team binnen ECH aan de slag zijn, worden we optimaal in staat gesteld om goede, stabiele software te bouwen. Software waar we ook op de lange termijn zelf verantwoordelijk voor zijn met ons hechte team.’ De komende periode op de agenda ‘Voor de komende periode staan er diverse thema’s op de agenda. Een belangrijke daarvan is een nieuw proces dat we aan het ontwikkelen zijn binnen ECH: dat gaat over het uitgeven van bankgaranties en de digitalisering daarvan. Ook hebben we ons de afgelopen tijd veel gefocust op onderhoud. Er zijn veel technische updates gedaan en dat blijven we zo doorzetten. Dit betekent dat er gemakkelijker nieuwe processen toegevoegd kunnen worden en het grondwerk van de software nog altijd verder verbeterd wordt. Daarnaast brengen we steeds technische wijzigingen aan op het platform en is er tijd en ruimte om klanten te bellen. We polsen dan hoe zij aankijken tegen bepaalde wijzigingen die we door willen voeren. Al met al gaat de kwaliteit daardoor omhoog. Tot slot hebben we de monitoring voor onszelf verbeterd, soms lossen we een probleem al op nog voor de klant dit opgemerkt heeft. Dat zijn mooie dingen en daar krijgen we ook regelmatig complimenten over.’ Over bordspellen en theatertechniek ‘Wanneer ik na een werkdag thuiskom, of mijn pc uitzet als ik vanuit huis werk, dan maak ik graag tijd vrij voor het spelen van (bord)spellen, zowel fysiek als online. Samen met een groep vrienden speel ik graag het rollenspel Dungeons & Dragons. Ook vind ik het fijn om met mijn handen bezig te zijn: ik heb een 3D-printer waarmee ik miniaturen kan maken, die ik vervolgens schilder. Op de middelbare school deed ik dat soort dingen al graag. Ik heb samen met een clubje nog jarenlang, ook toen ik al schoolverlater was, de theatertechniek voor musicals, evenementen en anderszins verzorgd. Bij alles wat ik doe, met name in mijn werkend leven, vind ik het belangrijk om waarde te leveren voor de eindgebruiker. Ik kan práchtig mooie code schrijven en uitleggen hoe trots ik ben, maar als de eindgebruiker het niet zinvol in kan zetten heeft het voor mij niet veel waarde.’ Meer informatie ‘Mensen die goede ideeën hebben of nog iets missen in de software van ECH, kunnen een mail sturen aan skip.groot@avisi.nl of info@ech.nl . We staan, met ons complete ontwikkelteam, áltijd open voor nieuwe feedback.’ Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:06:46Z",
  "source": "ech.nl"
}