{
  "id": "25dbea414a3c694b13663ab8cb515abdc9bfb94d",
  "url": "https://www.ech.nl/passeren-krijgt-een-nieuwe-versie-vestigen-5-0/",
  "title": "Passeren krijgt een nieuwe versie: Vestigen 5.0 - ECH",
  "text": "Passeren krijgt een nieuwe versie: Vestigen 5.0 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Passeren krijgt een nieuwe versie: Vestigen 5.0 / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door echadmin Na de zomer wordt dit proces beschikbaar gesteld voor implementatie door hypothecair financiers en leveranciers van notariële software. De nieuwe versie bevat belangrijke verbeteringen, zoals ondersteuning voor het ontslag uit hoofdelijke aansprakelijkheid en sluitende communicatie over de inzet van eigen geld door de cliënt. De naamswijziging van passeerproces naar vestigen komt voort uit het feit dat de kern van dit proces draait om het vestigen van een nieuw hypotheekrecht. Vanaf versie 5.0 draagt het proces daarom de naam Vestigen . Het nieuwe proces is tot stand gekomen na maanden van intensief onderzoek en ontwikkeling. In diverse bijeenkomsten hebben directe betrokkenen hun wensen kenbaar gemaakt. Deze wensen zijn vertaald naar een nieuwe flow en technische specificaties. Zo is een fonkelnieuw, gebruiksvriendelijk en efficiënt proces ontstaan dat de kwaliteit van de output verhoogt. Het nieuwe Vestigen proces biedt verschillende voordelen voor gebruikers. De communicatie over nieuw te vestigen hypotheken blijft het grootste onderdeel van dit ECH-proces. Een belangrijke verbetering is de afstemming over de bij het passeren benodigde gelden. Zo is er meer ruimte voor de hypothecair financier om informatie over de financieringsopzet en de inzet van eigen geld van de cliënt te delen met de notaris. En de notaris kan straks in één handeling de al dan niet gespecificeerde uitbetaling opvragen. Verder worden nu ook scheepshypotheken ondersteund en kan de hypotheekhouder bestaan uit natuurlijke personen. Daar komt bij dat communicatie over het ontslag uit hoofdelijke aansprakelijkheid en de verpanding van het lidmaatschap van een coöperatieve flatvereniging mogelijk is. Door deze zaken via ECH af te handelen, ontstaat er voor hypothecair financiers en notarissen een eenduidige, veilige en efficiënte manier om de benodigde instructies en documenten uit te wisselen. Een andere vernieuwing voor de notaris is de mogelijkheid om de concept-hypotheekakte geautomatiseerd te laten controleren op juistheid en volledigheid ten opzichte van de ontvangen instructies van de hypothecair financier. Eventuele afwijkingen worden zo in een vroeg stadium gesignaleerd. Ook het afschrift van de ondertekende definitieve akte kan automatisch worden gecontroleerd voordat dit via ECH  naar de hypothecair financier wordt verstuurd. De financier ontvangt dan naast het officiële afschrift ook een beveiligd gegevensbestand dat eenvoudig kan worden gebruikt om de essentialia uit de akte op te nemen in de administratie. Genereren van een kort verslag waaruit blijkt welke aanpassingen en uitbreidingen de notaris in de akte heeft aangebracht ten opzichte van de instructie behoort dan tot de mogelijkheden. Denk hierbij aan extra personen die gerechtigd zijn in het onderpand, extra kadastrale percelen, of correcties van eventuele fouten in het document. Deze functionaliteit wordt door de Koninklijke Notariële Beroepsorganisatie in samenwerking met ECH ontwikkeld en is nog in de ontwerpfase. Wij vertellen je hier later meer over. Ook ‘onder de motorkap’ is veel vernieuwd. Het proces is flexibeler ontworpen, waardoor toekomstige uitbreidingen gemakkelijker kunnen worden doorgevoerd En er zijn optimalisaties doorgevoerd die het onderhoud van het proces verbeteren en vereenvoudigen. ECH is zeer enthousiast over de ontwikkeling van het nieuwe processen ziet duidelijk de voordelen van de nieuwe aanpak. Het nieuwe proces is een belangrijke mijlpaal en gaat een stevige impuls geven aan de toekomst van het platform. Meer informatie Wil je meer weten over het nieuwe proces Verzoeken of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:30:01Z",
  "source": "ech.nl"
}