{
  "id": "27ba2633a05f53d9208917e525a585b85e747f13",
  "url": "https://www.ech.nl/meet-the-team-jeroen-vis/",
  "title": "Meet the team - Jeroen Vis - ECH",
  "text": "Meet the team - Jeroen Vis - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Jeroen Vis / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Elke werkdag is een nieuw avontuur’, Jeroen Vis, requirements engineer voor ECH Een requirements engineer houdt zich in de basis bezig met het uitvragen van requirements, het documenteren daarvan én het traceerbaar maken in de software.’ Dat zegt Jeroen Vis , sinds 2 jaar requirements engineer vanuit Avisi en daarmee lid van het ontwikkelteam voor ECH. ‘Waarom deze rol belangrijk is? Omdat je je, nog vóór je start met het bouwen van de software, met elkaar af wilt vragen wat er exact gemaakt moet worden om een specifiek doel te bereiken. In een breder kader gesteld: wat willen we vanuit ECH bereiken? Wanneer dit voortraject niet goed vormgegeven wordt, kan het zomaar zijn dat er iets ontwikkeld wordt dat uiteindelijk niet het gewenste doel invult. Omdat het niet de oplossing is waar de gebruiker op wacht. Als requirements engineer, en daar hebben we er drie van binnen Avisi, fungeer je feitelijk als de spin in het web tussen business, de gebruiker en development. Deze rol vraagt om een bepaalde mindset en is tegelijkertijd nét wat minder technisch dan de rol van een developer, omdat je je begeeft op het snijvlak van de verschillende disciplines.’ Jeroen Vis, Requirements Engineer ECH Techniek en business als gouden combinatie ‘Het is daarmee logisch dat ik bedrijfskundige informatica heb gestudeerd: ik wilde bewust meer de communicatieve kant op. Zo maak je mij niet echt gelukkig met 8 uur per dag achter een beeldscherm zitten met daarbij weinig contact met mensen. Verder houd ik van secuur werken en van efficiëntie. Dat heeft ook te maken met mijn karakter, ik ben wars van dingen die dubbel interpretabel zijn. Daarnaast voer ik ook testwerk uit voor ons team, dat overigens redelijk klein is. De combinatie van mijn werkzaamheden is gemakkelijk, want ik schrijf eerst de requirements, vervolgens gaat iemand anders deze ontwikkelen en daarna valideer ik of het werk wat beschreven is ook op de bedoelde manier gemaakt is.’ Veel waardering voor het ontwikkelteam ‘Wat ik erg fijn vind aan werken voor ECH, is dat er veel waardering is voor ons ontwikkelteam. En dat vind ik belangrijk, want als je gewaardeerd wordt zet je steeds nét dat stapje verder. Daarnaast zijn ook de lijntjes heel kort. Van de acceptanten tot de directie: ik kan iedereen vragen stellen en juist in mijn rol is het handig dat er dan geen extra mensen zitten tussen degene die een bepaalde wens heeft geuit en degene die ik rechtstreeks benader. Het voorkomt ruis op de lijn’, aldus Jeroen. Elke werkdag anders ‘Hoe mijn werkdag eruit ziet? Elke dag is anders: aan de ene kant heb ik de werkdag in duidelijke blokken ingedeeld. En aan de andere kant laat mijn werk zich heel moeilijk plannen omdat ik niet precies weet wat ik tegen ga komen. Soms lijkt iets heel eenvoudig, maar blijken er andere wensen bij te komen die een ogenschijnlijk eenvoudige opdracht dan toch complex en daarmee tijdrovend maken. Verder ben ik door de dag heen bezig met testwerk, heb ik veel afspraken met stakeholders en plan ik ruimte om zaken uit te werken. Ik wil niet zegen dat het chaotisch is, maar elke dag is wél weer een nieuw avontuur. Het is in mijn rol in elk geval belangrijk dat je snel kunt schakelen en niet meteen in paniek raakt als zaken anders lopen dan je gepland had. Verder ben ik trots op de executable specifications die we hebben en de bereidheid van ECH om daarin mee te gaan. We stellen op basis van voorbeelden requirements op zodat deze niet multi-interpretabel zijn en maken deze ook automatisch testbaar. Door de schrijfwijze zijn deze ook door minder technisch onderlegde mensen te lezen en weten we zeker dat deze requirements binnen de hele keten duidelijk zijn en onveranderd blijven. Ook over 5 jaar.’ Jeroen in privé: avontuurlijke natuurliefhebber ‘Buiten werktijd ben ik vooral een avonturier, en dat past net als mijn afwisselende rol van requirement engineer, goed bij me. Ik houd van reizen vol verrassingen, ik wandel en fiets graag lange afstanden. Daarnaast houd ik van zwemmen en motorrijden. Zo ben ik vorig jaar nog met mijn vriendin naar Rome gefietst en zijn we in het jaar daarvoor over de Himalaya gewandeld. We zijn op dit moment aan het nadenken over wat we dit jaar gaan doen, maar één ding is zeker: we gaan de natuur in en het onverwachte pad opzoeken.’ Meer informatie Heb je vragen voor Jeroen, heb je ideeën of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor ieder klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:35:39Z",
  "source": "ech.nl"
}