{
  "id": "2aaa956f01b76a2ebabf4f9e01f9986fdcc869f7",
  "url": "https://www.ech.nl/notarissen/vitru/",
  "title": "Vitru - ECH",
  "text": "Vitru - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Vitru B.V. Proces: Passeren E-mail: beheer@fast.vitru.nl Telefoon: 030-6005124 01 Nieuwsberichten 02 Passeren Deelnemersinfo Vitru B.V. Algemene informatie/nieuwsberichten (kort) Vitru B.V. Vitru B.V. is een nieuwe aanbieder van zakelijke vastgoedfinancieringen voor professionele beleggers. Vitru is er voor verhuurders die zich langdurig aan hun vastgoed willen verbinden en een maatschappelijk verantwoord rendement nastreven. De echte koplopers op dit gebied krijgen aanvullende kortingen. Daarnaast verstrekt Vitru leningen in bouwdepots waar rente op wordt vergoed om zo verduurzaming te stimuleren. Notarisinstructie passeer proces Passeerproces Het beheer van de financieringen is door Vitru uitbesteed aan BCMGlobal. Voor het passeren van nieuwe hypotheken wordt gebruik gemaakt van ECH. Nadat de lening door Vitru akkoord is gegeven, wordt de passeeropdracht door BCMGlobal via ECH naar de gekozen notaris gestuurd. Aan dit bericht worden de bindende offerte en de algemene voorwaarden toegevoegd. Daarbij zijn ook onderstaande notarisinstructies opgenomen: BCMGlobal ontvangt de passeerdatum minimaal 3 werkdagen voor de daadwerkelijke datum van passeren; De sluitnota wordt uiterlijk 2 werkdagen voor passeren door BCMGlobal aan u verzonden. Eventuele kosten worden in mindering gebracht op het te verstrekken leningbedrag. Het bouwdepot zal nooit worden uitgekeerd bij het passeren van de hypotheekakte; Wij verzoeken u om BCMGlobal na het passeren van de hypotheek, binnen 3 werkdagen na passeerbevestiging, een afschrift toe te sturen van de hypotheekakte met voetverklaring inclusief inschrijvingsbewijs. Wij kunnen pdf-documenten ontvangen met een maximale documentgrootte van 20MB per document. Vragen en opmerkingen Uw mening is belangrijk. Indien u tips, opmerkingen of verbeteringen heeft, vernemen wij dat graag. Wij zijn bereikbaar via 030-6005124. Contactgegevens Voor vragen zijn we bereikbaar op telefoonnummer 030-6005124. U kunt ons bellen van maandag tot en met vrijdag van 8.30 uur tot 17.00 uur. U kunt ook een e-mail sturen naar Beheer@fast.vitru.nl . Notarisinstructie royementenproces Aflosnota’s en royementsverzoeken kunt u opvragen door een email te sturen naar Beheer@fast.vitru.nl . Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:27:46Z",
  "source": "ech.nl"
}