{
  "id": "2b7ba0ba3b7cc19e5fdcccc16eff7b6c0f4d03d7",
  "url": "https://www.ech.nl/eerste-testresultaten-project-automatische-verificatie-hypotheekakten/",
  "title": "Eerste testresultaten project automatische verificatie hypotheekakten - ECH",
  "text": "Eerste testresultaten project automatische verificatie hypotheekakten - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Eerste testresultaten project automatische verificatie hypotheekakten / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Op 11 januari jl. hebben de KNB en Stichting ECH samen het project ‘Automatische verificatie hypotheekakten’ gelanceerd. Dit project is onderdeel van het ECH Change programma. Beide partijen werken samen aan de automatische verificatie van hypotheekakten. Dankzij innovatieve technologie worden gegevens van financiers van hypotheken, zoals banken en andere kredietverstrekkers, vergeleken met die in de opgestelde (concept) hypotheekakte. Zo kunnen fouten sneller worden ontdekt en gaan de kosten omlaag. Momenteel werken beide partijen aan de realisatie van een zogenoemd Proof of Concept. Met behulp van een vooraf ingeregelde taxonomie en ontologie worden documenten uitgelezen en geïnterpreteerd. Hiermee worden de relevante (rechts-)personen, onderpandgegevens en bedragen geëxtraheerd.  De verkregen akte-data worden vervolgens vergeleken met de data uit de door de financier opgestelde instructie. Hieruit wordt dan een overzicht gegenereerd van de geconstateerde verschillen. De uiteindelijke interpretatie van geconstateerde verschillen wordt door de notaris en/of de financier gedaan. Desgewenst kan ook deze interpretatie (gedeeltelijk) geautomatiseerd worden. Bijvoorbeeld in geval er extra onderpanden aanwezig zijn, wordt de afwijking wel geaccepteerd en in geval er minder onderpanden zijn niet. Het overzicht is daarom in meerdere formaten beschikbaar, zodat het zowel door een systeem als door de mens gelezen kan worden. Inmiddels zijn de eerste testen uitgevoerd en de resultaten daarvan beschikbaar. Deze worden gebruikt om de configuraties te laten aanpassen. Hierna worden de verbeterde resultaten met betrokken financiële instellingen en notarissen afgestemd. Deze input is van groot belang om een inschatting te maken in hoeverre deze technologie een daadwerkelijke ondersteuning in de dagelijkse praktijk kan zijn. Eind april verwachten wij de eindevaluatie te houden. Voordelen Dit project belooft grote voordelen voor de notariële sector en financiële instellingen. Door het automatiseren van de verificatieprocessen kunnen fouten sneller worden ontdekt en gecorrigeerd, wat leidt tot een hogere betrouwbaarheid en efficiëntie op elk moment in het proces. Bovendien draagt het bij in de vermindering van kosten van het verwerkingsproces, terwijl de klanttevredenheid toeneemt door snellere en nauwkeurigere dienstverlening. Meer informatie Wil je meer weten over het project of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T03:58:58Z",
  "source": "ech.nl"
}