{
  "id": "2bec25944dbbc6a6feb21c9853a0a5b7c6a4df15",
  "url": "https://www.ech.nl/implementatie-bankgarantieproces-gestart/",
  "title": "Implementatie 'Bankgarantieproces' gestart - ECH",
  "text": "Implementatie 'Bankgarantieproces' gestart - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Implementatie ‘Bankgarantieproces’ gestart / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Naast de processen voor het vestigen en royeren van hypotheken biedt ECH al enkele jaren een derde proces aan: ECH-bankgarantie . Dit proces is tot op heden nog niet in gebruik genomen door hypothecair financiers. De reden: het gebrek aan tijd op de overvolle ICT-kalenders. Daar komt nu verandering in, want diverse geldverstrekkers starten dit najaar met de implementatie. Voordeel voor eindgebruikers In de huidige werkwijze zonder ECH krijgt een notaris bankgaranties via post en of e-mail toegestuurd. Medewerkers bij hypothecair financiers zijn dagelijks druk met handmatig acties bij het aanmaken en verzenden van bankgaranties. Na ontvangst worden deze documenten veelal handmatig verwerkt door de notaris, die daarnaast moet beoordelen of de bankgarantie rechtsgeldig is. Staat er wel alles in wat erin moet staan? Na implementatie van het ECH-proces, kan de bankgarantie met één druk op de knop worden verstuurd via de beveiligde digitale snelweg van ECH. Omdat de bankgarantie rechtstreeks vanuit de systemen van de hypotheekverstrekker wordt samengesteld, kunnen er geen tikfouten in sluipen. Bij ontvangst kan de bankgarantie automatisch worden gekoppeld aan het juiste klantdossier. Ook de controles op de inhoudelijke juistheid van de garantie kunnen geautomatiseerd plaatsvinden. ECH kan garanderen dat elke notaris bankgaranties via haar platform kan ontvangen. Momenteel begeleiden wij bij een aantal partijen de implementatie. Voordat deze partijen bankgaranties via het platform mogen versturen, moeten zij gecertificeerd zijn. ECH controleert vooraf of de manier waarop de ECH-services zijn geïmplementeerd voldoen aan de gestelde criteria. Bij een positief resultaat van die certificering krijgt de partij toegang tot deze dienst van ECH. Overigens is dit proces ook geschikt voor partijen die geen hypotheken verstrekken, maar toegespitst zijn op het verstrekken van bankgaranties. Wij informeren het notariaat en andere betrokkenen tijdig over het moment waarop de eerste geldverstrekker met bankgaranties via ECH live gaat. Net als u kijken wij uit naar dat moment. Meer informatie Wil je meer weten over het nieuwe proces Bankgarantie of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:25:31Z",
  "source": "ech.nl"
}