{
  "id": "2cc425d655926ce25f4ce10803fad92ceb49281d",
  "url": "https://www.ech.nl/tarieven-ech-2022-kosten-passeer-en-royeerproces-meer-in-evenwicht/",
  "title": "Tarieven ECH 2022: kosten passeer- en royeerproces meer in evenwicht - ECH",
  "text": "Tarieven ECH 2022: kosten passeer- en royeerproces meer in evenwicht - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Tarieven ECH 2022: kosten passeer- en royeerproces meer in evenwicht / Bestuur , KNB , Nieuws , Notaris , Wijzigingen / Door Raymond Bloot Het bestuur van Stichting ECH heeft de tarieven voor komend jaar vastgesteld. De inkomsten uit het passeer- en royeerproces zullen meer met elkaar in evenwicht worden gebracht. Dat betekent een lager tarief voor een passeerzaak, een hoger tarief voor een royementszaak. Vanaf 1 januari 2022 zal voor een passeerzaak € 8,50 worden gerekend. Dat is € 0,45 minder dan in 2021. De korting op het tijdig versturen van de passeerbevestiging blijft 10 procent (€ 0,85 per 1 januari 2022). Daar tegenover staat dat het tarief van een royementszaak per 1 januari 2022 € 1,50 zal bedragen. Dit was € 1,00 in 2021. Beperkte impact Omdat er nagenoeg evenveel passeer- als royementszaken worden uitgewisseld via ECH is de impact voor het notariaat als geheel beperkt. De verschuiving helpt Stichting ECH om de inkomsten uit beide processen meer in lijn met elkaar te brengen. De kosten voor het gebruik van de webapplicatie van ECH blijven met € 1,90 per zaak onveranderd. Geen indexatie Gezien de positieve ontwikkelingen op de hypotheekmarkt het afgelopen jaar zullen de tarieven in 2022, net als vorig jaar, niet geïndexeerd worden. Dit ondanks het feit dat de leveranciers van ECH wel indexeringen zullen doorberekenen. Meer informatie Wil je meer weten over de tarieven van Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:10:13Z",
  "source": "ech.nl"
}