{
  "id": "2e5b6f6a7c43b761f153c78b8d8c1ed2ca424272",
  "url": "https://www.ech.nl/bestuur-aan-het-woord-jolanda-de-heer/",
  "title": "Bestuur aan het woord - Jolanda de Heer - ECH",
  "text": "Bestuur aan het woord - Jolanda de Heer - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestuur aan het woord – Jolanda de Heer / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken / Door Raymond Bloot Jolanda de Heer, combineert Rabobank én ECH: een mensgerichte bestuurder ‘Ik woon samen met mijn partner en twee puberzoons in het mooie Rosmalen. In mijn vrije tijd tennis ik met vriendinnen, we spelen competitie en hebben sinds kort ook padel ontdekt. Daarnaast kun je me één keer per week in de sportschool vinden, om een beetje fit en vitaal te blijven.’ Aan het woord is Jolanda de Heer , Area Lead Aanvraag en Afsluiten Hypotheken bij Rabobank én bestuurslid bij ECH.  ‘Verder lees ik heel graag en rommel ik bij voorkeur zo’n beetje rondom huis.’ Jolanda de Heer, Area Lead Aanvraag en Afsluiten Hypotheken, bij Rabobank Van heel actief naar meer balans ‘Vroeger ben ik heel erg actief geweest, maar ik heb in combinatie met het werk, inmiddels geleerd om de balans te houden. Ik houd nu eenmaal van organiseren en regel graag zaken. Zo ben ik lang klassenouder geweest, regelde ik het schoolkamp, was ik actief als leidster bij het voetbal van onze oudste en tot slot was ik betrokken bij het tennisteam van onze andere zoon. En onlangs heb ik, net zoals zoveel werkende ouders, een tijdelijke neventaak als docent gehad toen we tijdens corona van dichtbij meemaakten hoe thuisonderwijs in zijn werk ging. Naast werkzaam te zijn voor de Rabobank en stichting ECH ben ik uiteraard nog altijd moeder. En misschien is dat zelfs wel mijn belangrijkste taak’, lacht Jolanda. ‘Ik vind het prachtig om mijn kinderen te helpen en te coachen zodat ze zichzelf kunnen ontwikkelen naar zelfstandige volwassenen.’ Jolanda: een mensgerichte bestuurder ‘Voor ECH ben ik penningmeester en ik houd me bezig met hr-gerelateerde zaken en dan specifiek gericht op de directiefuncties. Dit betekent dat ik periodiek gesprekken heb met de drie directieleden. Voor mij is dan vooral de mens áchter het directielid belangrijk. Ik vraag me dan af wat je drijft, wat voor mens je bent, hoe je verder kunt groeien, hoe lekker je in je vel zit, wat je belangrijk vindt en dat soort zaken. Dat vind ik heel interessant’, aldus Jolanda. ‘Ook binnen de Rabobank, waar ik een team van 18 fte (direct reports) aanstuur, richt ik me veel op ontwikkeling van mensen. Soms kan dat gaan over het kiezen van een ander pad, waardoor de jas die iemand toch al niet lekker zat, net wat beter gaat passen. Ik vind het mooi om daar met elkaar het gesprek over aan te gaan. En daar waar het hr-schap binnen ECH dan vooral gaat over de menselijke kant, en de juiste mensen op de juiste plekken krijgen, houden én verder laten ontwikkelen, gaat het penningmeesterschap veel meer over de begroting, prijsstelling et cetera.’ Morgen steeds weer beter ‘Mijn werk voor ECH kenmerkt zich door enthousiasme. Het team waarmee ik samenwerk heeft veel energie en wil er elke dag weer een feestje van maken voor onze klanten. Daarnaast ervaar ik de professionals binnen de stichting stuk voor stuk als heel professioneel en sterk gericht op hoe het morgen nog beter kan’, vervolgt Jolanda. ‘Kortom, het is een erg fijn team om in te werken en we begrijpen elkaar in enkele woorden. Daarnaast vullen we elkaar aan, en dat vind ik belangrijk. Want juist door de verschillende competenties die in het bestuur aanwezig zijn, vormen we een sterke eenheid. Verder vind ik ECH, ondanks het feit dat ze pas aan het einde van de keten naar voren komen, een belangrijk element in de klantreis. We zijn daar 20 jaar geleden al mee gestart, met dat stukje veilige en betrouwbare digitalisering, en dat heeft zeker in de afgelopen jaren een enorme vlucht genomen.’ Van projectgericht naar productgericht ‘Waar ik persoonlijk trots op ben? Dat gaat toch wel over de omslag in ons denken. Waar we eerst vooral projectgericht, dus vanuit de dienst van ECH dachten, denken we nu tegenwoordig vooral productgericht, dus vanuit de klantreis. En ik vind het prachtig dat ik daar een bijdrage aan mag leveren. Tot slot vind ik de aanpassing naar de mindset, waarin we steeds kortcyclischer zijn gaan denken met elkaar, bewonderenswaardig. Het maakt dat we ook in de toekomst relevant blijven in de markt.’ De komende periode op de agenda ‘Ik noemde het al even, onze omslag naar kortcyclisch denken, en continu verbeteren. Dat blijft ontzettend belangrijk de komende periode, voor altijd wel denk ik. De time to market is immers steeds korter geworden, dat is eigenlijk een soort omschakeling die je in de hele maatschappij ziet. Als ik het kort samenvat gaat het vooral over kijken naar wat we wél kunnen doen, in plaats van bezig zijn met de dilemma’s die belemmeren. En dat past dan weer heel goed bij de manier waarop ik zélf in het leven sta.’ Meer informatie Wil je meer weten over de visie van Jolanda de Heer of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T03:56:46Z",
  "source": "ech.nl"
}