{
  "id": "3034e52f4d3b19f2546aad148b3e7c2cacb47a8d",
  "url": "https://www.ech.nl/casper-van-ginneken-breidt-rol-uit-met-relatiemanagement/",
  "title": "Casper van Ginneken breidt rol uit met relatiemanagement - ECH",
  "text": "Casper van Ginneken breidt rol uit met relatiemanagement - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Casper van Ginneken breidt rol uit met relatiemanagement / ECH medewerkers , Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Het is inmiddels alweer ruim vier jaar geleden dat ik onderdeel van het ECH-team werd. En dat ik nu de kans krijg om verder te groeien door aanvullend als relatiemanager voor de stichting op te treden, ervaar ik als een mooie kans om mezelf verder te ontwikkelen.’ Dat zegt Casper van Ginneken, tot voor kort Compliance Officer & Consultant en nu dus ook als relatiemanager voor ECH aan de slag. ‘Het is overigens niet alleen voor mijzelf een fijne mogelijkheid om persoonlijk te groeien, ook ECH is gebaat bij een relatiemanager die extern op operationeel en tactisch niveau naar buiten treedt. Kortom, het valt prachtig samen allemaal.’ Casper van Ginneken, relatiemanager Stichting ECH Teamwork makes the dream work ‘Op dit moment ben ik vooral bezig met het afronden van plannen waarin we beschrijven hoe we de rol verder in gaan vullen. Los van het contact met betrokken partijen, zetten we in op het ontwikkelen van nieuwe dienstverlening en procesverbetering’, aldus Casper. ‘Uiteraard trek ik, net als bij mijn andere werkzaamheden, samen op met mijn collega’s ten aanzien van nieuwe ontwikkelingen, maar anderzijds ook operationeel van aard in samenspraak met mijn andere collega’s. Voor het stuk relatiemanagement is dat vooral met Robert-Jan vanuit zijn rol als directeur Change. En met Lisa werk ik, binnen dit kader, vooral samen vanuit haar rol als algemeen directeur. Kortom, we versterken elkaar omdat iedereen zijn eigen sterke kanten en focuspunten heeft.’ Casper over een jaar ‘Werken in teamverband en samen mooie resultaten behalen vormt een belangrijke basis waar ik sowieso enthousiast van word. Daar past bij dat ik energie haal uit het werken op kantoor en onderweg zijn. Vanuit huis werken is niet echt mijn ding, omdat ik dan de interactie met mensen om me heen mis. Daarnaast vind ik het fijn om verschillende typen werkzaamheden op een dag te doen, zodat ik veel afwisseling in mijn werk ondervind’, vervolgt Casper. ‘Lekker onderweg zijn, mensen ontmoeten, contact hebben met partijen die ergens hulp bij nodig hebben en dan samen onderzoeken welke mogelijkheden er zijn. Dat zijn zaken die ik het komende jaar verder uit wil bouwen. En als dat lukt, kijk ik eind 2024 op een succesvolle periode terug.’ Brede blik op de keten: nodig ons uit! ‘Uiteraard zijn we, los van de vernieuwde inzet van relatiemanagement, vanuit stichting ECH altijd al op zoek naar het dagdagelijkse, reguliere contact met partijen zodat we weten wat er speelt. Daarnaast weten we dat er vragen of problemen kunnen spelen bij bijvoorbeeld softwareleveranciers, hypothecair financiers of notarissen’, aldus Casper. ‘Of er zijn onbenutte mogelijkheden om bepaalde verbeteringen door te voeren terwijl partijen daar niet van op de hoogte zijn óf men weet wel dat het optimaler kan, maar weet niet hoe deze verbetering door te voeren. Precies dat zijn zaken waarbij we graag in oplossingen meedenken. Door onze brede blik op de keten kan dat soms al heel laagdrempelig, bijvoorbeeld door een bepaalde procesverbetering door te voeren of te communiceren over een manier van werken. En dat hoeft lang niet altijd IT-gerelateerd te zijn. Ik nodig partijen van harte uit om contact met ons op te nemen zodat we met ze mee kunnen kijken. Stel dat er een probleem speelt bij een aantal hypothecair financiers, waar ze de hulp van het notariaat bij nodig hebben, dan kunnen wij dit vanuit onze rol adresseren richting de juiste personen of werkgroepen. Op die manier zorgen we ervoor dat de hele keten van de verbetering profiteert. Het is écht niet nodig voor individuele partijen om steeds opnieuw zelf het wiel uit te vinden. Ik hoop dat de drempel om ons te benaderen als zo laag mogelijk ervaren wordt.’ Feedback wordt gewaardeerd ‘En daarnaast werkt de nauwe samenwerking zoals ik deze omschreef, twee kanten op. Want ook wij hebben als ECH veel baat bij de feedback van partijen. We kunnen immers zelf allerlei zaken bedenken, maar de hypothecair financier en notaris zijn onze klanten. Het is aan hén om te beoordelen of ze wel behoefte hebben aan hetgeen wij bedenken. En misschien kan het beter of vinden ze een andere aanpak logisch zodat de gewenste verbetering efficiënter doorgevoerd kan worden. Dat zijn onderwerpen die we graag terug horen.’ ECH gelooft in co-creatie ‘We denken dan aan automatische aktecontrole, gericht op het vergelijken van in- en output, met als doel de kwaliteit te verbeteren. Maar ook de beweging in de keten waarbij er meer gebruikgemaakt wordt van brondata heeft onze aandacht, zodat er gemakkelijk analyses plaats kunnen vinden. Daarnaast is er heel veel data beschikbaar en dat biedt volop kansen. Zo zijn we benieuwd naar waar partijen meer inzicht in willen krijgen. Is dat bijvoorbeeld om de kwaliteit ten aanzien van deadlines en afspraken te verbeteren of juist om aanvullende inzichten te gaan genereren? Als er bijvoorbeeld behoefte aan een workshop is, dan geven we die graag vanuit ECH’, vervolgt Casper. Ruim een jaar geleden hebben we een complete change strategie uitgewerkt en inmiddels rollen we de verschillende onderdelen daarvan uit. Hier plukken we de komende tijd met elkaar de vruchten van. Kortom, niet twijfelen, gewoon vragen, misschien hebben wij de vraag waar je mee rondloopt al van andere partijen gehoord.’ Meer informatie Voor vragen of andere informatie over ECH kan contact worden opgenomen via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:04:44Z",
  "source": "ech.nl"
}