{
  "id": "305698569f0b90d9b01a16a5b522c097ddf37464",
  "url": "https://www.ech.nl/bestuur-aan-het-woord-john-buhrs/",
  "title": "Bestuur aan het woord - John Buhrs - ECH",
  "text": "Bestuur aan het woord - John Buhrs - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestuur aan het woord – John Buhrs / Bestuur , Directie ECH , ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , Notaris , Raad van Advies , Referenties banken / Door Raymond Bloot Even voorstellen: John Buhrs, ‘nieuw’ bestuurslid ECH ‘Inmiddels werk ik al ruim 25 jaar bij de Volksbank . Vroeger werd mijn rol bedrijfshoofd van de backoffice hypotheken genoemd. Tegenwoordig heet het Service Center Lead.’ Aan het woord is John Buhrs, tevens ECH-bestuurslid namens de Raad van Advies. Zij het naar verwachting tijdelijk omdat hij een collega-bestuurslid vervangt dat vanwege persoonlijke redenen teruggetreden is. ‘In de loop der jaren heb ik de complete keten rondom hypotheken wel gezien. Ik ben ooit begonnen als uitzendkracht waarbij het mijn hoofdtaak was om offertes in Word te tikken. Je zou kunnen zeggen dat ik écht uit de operatie kom. Of in de klei heb gestaan als je het anders verwoordt.’ John: ‘In principe ben ik aangesteld tot februari. Vooralsnog heb ik een aantal taken gekregen vanuit mijn bestuursrol, zo komen de rol van voorzitter van de Raad van Advies, HR-verantwoordelijke voor de directie en participatie aan het organisatieadvies-traject bij mij te liggen. Ook al moeten deze nog formeel vastgelegd worden.’ John Buhrs, Service Center Lead bij de Volksbank ‘Door elkaar als hypothecair financiers onderling niet als concurrenten te zien maar als partners in de keten, komen we verder.’, zegt John Buhrs Service Center Lead bij de Volksbank Van zorg naar zakelijk ‘Dat ik in de hypothekensector terechtkwam was niet direct logisch. Ik ben bovenmatig geïnteresseerd in mensen en heb een achtergrond in de psychologie en filosofie. Van huis uit ben ik afgestudeerd als sociaal psycholoog. Later heb ik mijn MBA’s gedaan. Dat was nadat ik mijn vrouw leerde kennen en er, zoals het leven lopen kan, brood op de plank moest. Ik ging naar het uitzendbureau en rolde het bankwezen in. Omdat ik van nature op mensen gericht ben focus ik me vooral op samenwerken binnen het bedrijf en daarbuiten. Mensen die mij kennen omschrijven me als verbindend, hulpvaardig en nuchter en die eigenschappen komen me goed van pas in mijn loopbaan. Ik heb geen moment spijt gehad van mijn keuze, want door de manier waarop ik mijn psychologische achtergrond in deze financieel georiënteerde omgeving gebruik, kan ik tóch vooral bezig zijn met mensen. En dan vanuit een positieve insteek. Mijn rol binnen de Volksbank past heel mooi bij ECH, waarbij we een optimale communicatie beogen tussen het notariaat en hypothecair financiers.’ Samen is beter voor de klant ‘Door elkaar als hypothecair financiers onderling niet als concurrenten te zien maar als partners in de keten, komen we verder. Dit soort ketenverbeteringen moet je mijns inziens samen doen, want dan ben je goedkoper en efficiënter. Je hoeft immers niet continu opnieuw het wiel uit te vinden. Niet alleen de notaris en de hypothecair financier hebben voordeel bij een systeem dat voor elke partij gelijk is, ook de klant wordt daar beter door geholpen. En dat gaat ook mijn bijdrage zijn: door mensen uit te dagen niet in belemmeringen te denken of in wij/zij. Het gaat veel meer om het gezamenlijk optrekken waarbij de initiatieven vanuit ECH de markt als geheel beter kunnen maken. Denk aan onderwerpen als digitale aktes en het uniformeren van aktes . Het kán niet zo zijn dat we 200 tot 300 hypotheekaktes hanteren die allemaal verschillend zijn en in die hoedanigheid bij de notaris worden gedeponeerd. Met 10 varianten zijn we wellicht ook al een heel eind. Dat wil ik graag met mijn collega-bestuursleden: uniformeren en uiteindelijk digitaliseren. Wanneer we dat goed aanvliegen met elkaar dan krijg je maximale optimalisatie in de keten. Daar is vooral de klant in zijn klantreis bij gebaat. En voor de klant, daar doen we het uiteindelijk voor.’ Meer informatie Wil je meer weten over de visie van John Buhrs of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:04:26Z",
  "source": "ech.nl"
}