{
  "id": "30c293038fe8f3382358f6aba7443168da45850e",
  "url": "https://www.ech.nl/meet-the-team-joost-konst/",
  "title": "Meet the team - Joost Konst - ECH",
  "text": "Meet the team - Joost Konst - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Joost Konst / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Collega Joost over zijn IT-familie, Japan en zaalvoetbal We zijn verheugd om Joost Konst te verwelkomen in ons team bij Stichting ECH. Al is hij niet zo heel nieuw meer in het team. Na zijn afstuderen in juli 2023 aan de Hogeschool van Arnhem en Nijmegen, waar hij ICT met een focus op software development studeerde, besloot hij zijn carrière bij ons voort te zetten. Hij begon in oktober vorig jaar als junior software engineer bij ECH en brengt een frisse blik mee, wat hem een waardevolle aanvulling maakt voor onze organisatie. Joost Konst, junior software engineer bij ECH Joost vertelt over zijn rol Joost: “Gedurende mijn opleiding heb ik al de nodige ervaring opgedaan, onder meer tijdens mijn stage-opdracht. In mijn huidige rol bij ECH werk ik aan het ontwikkelen van een nieuw proces genaamd Verzoeken, waarmee notarissen en hypothecair financiers eenvoudig toestemming kunnen vragen en verlenen voor diverse juridische transacties. Dat kan gaan om wijzigingen rondom splitsing van appartementsrechten, het verlenen van erfdienstbaarheden of andere wijzigingen rondom woningfinancieringen. Dit project stelt me in staat om mijn vaardigheden te gebruiken en uit te breiden, terwijl ik waardevolle oplossingen bied voor onze klanten.” “Ik voel me thuis in het team waarin ik werk en merk dat ik groei in mijn rol. Zo krijg ik steeds meer taken toebedeeld en probeer ik zoveel mogelijk als volwaardig teamlid mee te werken. De dagen beginnen met een stand-up en vervolgens werken we verder aan de taak waar we mee bezig waren of we pakken een nieuwe taak op. Binnen mijn rol heb ik ook te maken met een stukje architectuur van de software en dat maakt mijn werk lekker divers. Dan weer ben ik operationeel met een bepaalde functionaliteit bezig en op een ander moment richt ik me weer meer op de ontwikkeling van het product. Voor mij is een werkdag geslaagd als ik waarde heb kunnen toevoegen aan het product waar we mee bezig zijn.” Persoonlijke achtergrond Joost komt uit een familie waarin er veelvuldig in de IT gewerkt wordt. Deze achtergrond heeft zijn passie voor technologie en softwareontwikkeling aangewakkerd. Al van jongs af aan was Joost gefascineerd door de mogelijkheden van computers en games. “Mijn vader werkte in de IT en mijn twee broers zijn ook software engineers. Het zit dus aardig in de familie,” lacht Joost. Vrije tijd en reizen In zijn vrije tijd woont Joost nog bij zijn ouders en is hij vaak bezig met krachttraining en speelt zaalvoetbal op dinsdagavond met zijn nieuwe collega’s. Daarnaast houdt hij van reizen en heeft hij meerdere keren Japan en Korea bezocht. “Ik ben met twee vrienden twee keer naar Japan geweest. De eerste keer waren we daar vier weken en de tweede keer gingen we naar Korea en bezochten we Tsushima, een prachtig eiland tussen Japan en Korea. Wat me vooral aantrekt aan Japan en Korea is de cultuur, de discipline en het respect. Als ik zou moeten kiezen, zou ik overigens liever in Korea wonen dan in Japan. Dit vanwege de iets vrijere cultuur die meer lijkt op de westerse cultuur,” zegt Joost. Een blik op de toekomst Joost is vastberaden om zijn rol bij ECH verder te ontwikkelen en hoopt in de toekomst niet langer als junior te worden gezien. “Ik hoop over een tijdje meer ervaring te hebben en van dat junior-label af te zijn. Ik wil waarde toevoegen aan het product en echt als volwaardig teamlid bijdragen aan onze projecten. Gelukkig kan ik al steeds meer zelfstandig werken en dat vind ik fijn.” Wat hij zo mooi vindt aan IT? “Het mooie aan IT vind ik dat je iets kunt maken vanuit niets, en dan bij voorkeur iets wat écht waarde toevoegt voor anderen,” legt Joost uit. Meer informatie Heb je vragen voor Joost of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor iedereen klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:24:59Z",
  "source": "ech.nl"
}