{
  "id": "31c8b2b9296f62763feb5e13d14fa3e678373945",
  "url": "https://www.ech.nl/rabobank-tijdslijnen-rondom-feestdagen-3/",
  "title": "Rabobank: Tijdslijnen rondom feestdagen - ECH",
  "text": "Rabobank: Tijdslijnen rondom feestdagen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Rabobank: Tijdslijnen rondom feestdagen / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door echadmin Inleiding Rabobank hanteert rondom de komende feestdagen de reguliere aanlevertermijnen voor passeren en royeren. Om te waarborgen dat alle zaken tijdig kunnen worden verwerkt, vragen we nadrukkelijk om zaken waarvan de (passeer)datum bekend is zo snel mogelijk door te geven. Op die manier kunnen de werkzaamheden zo goed mogelijk gepland worden zodat zaken met een kortere doorlooptijd ook tijdig kunnen worden afgewikkeld. Om alle verzoeken tijdig af te kunnen wikkelen, wordt zéér terughoudend om gegaan met het in behandeling nemen van spoeddossiers. Tijdslijnen Royeren Royementsverzoeken dienen, conform de reguliere termijn, ten minste 15 werkdagen voor royementsdatum te worden doorgegeven. Op een aantal feestdagen is Rabobank gesloten, hier moet rekening mee worden gehouden bij het tijdig aanleveren van de verzoeken. Hieronder staan voorbeelden waarin rekening is gehouden met de feestdagen waarop de Rabobank gesloten is (Eerste en tweede Paasdag, Koningsdag, Hemelvaartsdag, Eerste en tweede Pinksterdag): Stuurt de notaris het royementsverzoek met aflosdatum dinsdag 22 april? Dan moet het verzoek uiterlijk maandag 31 maart bij ons binnen zijn;(2 e paasdag) Stuurt de notaris een royementsverzoek met aflosdatum dinsdag 6 mei? Dan moet het verzoek uiterlijk dinsdag 11 april bij ons binnen zijn; (Koningsdag en Bevrijdingsdag) Stuurt de notaris het royementsverzoek met aflosdatum woensdag 11 juni? Dan moet het verzoek uiterlijk maandag 19 april bij ons binnen zijn; (hemelvaart en 2 e pinksterdag) Indien u onderstaande bericht ontvangt via ECH naar aanleiding van een aangeleverd royementsverzoek, dan is er sprake van een zakelijk royement: “Het verzoek betreft een zakelijk royement en wordt verder op papier afgehandeld. Voor meer informatie kunt u contact opnemen met ons zakelijk team Klantenservice op telefoonnummer 088 722 6666”. Voor zakelijke royementsdossiers wordt het ECH dossier gesloten en vindt de verdere afhandeling van het royement niet via ECH plaats. U ontvangt van de afdeling Bedrijven een aflosnota of een brief waarin royement om niet verleend wordt. Tijdslijnen passeren Passeerverzoeken dienen ten minste 2 werkdagen voor passeren te worden doorgegeven: In verband met Goede Vrijdag (vrijdag 18 april) en 2 e Paasdag (maandag 21 april) Passeert de klant op dinsdag 22 april? Dan dient de notaris uiterlijk woensdag 16 april 12:00 uur de passeerdatum door te geven. Passeert de klant op woensdag 23 april? Dan dient de notaris uiterlijk donderdag 17 april 12:00 uur de passeerdatum door te geven. In verband met Koningsdag (zaterdag 26 april), Dag van de Arbeid (donderdag 1 mei) en Bevrijdingsdag (maandag 5 mei):. Passeert de klant op vrijdag 2 mei? Dan dient de notaris uiterlijk dinsdag 29 april 12:00 uur de passeerdatum door te geven. Passeert de klant op maandag 5 mei? Dan dient de notaris uiterlijk woensdag 30 april 12:00 uur de passeerdatum door te geven. Passeert de klant op woensdag 7 mei? Dan dient de notaris uiterlijk vrijdag 2 mei 12:00 uur de passeerdatum door te geven. In verband met Hemelvaart donderdag 29 mei: Passeert de klant maandag 2 juni? Dan dient de notaris uiterlijk woensdag 28 mei 12:00 uur de passeerdatum door te geven. In verband met 2 e Pinksterdag (maandag 9 juni): Passeert de klant dinsdag 10 juni? Dan dient de notaris uiterlijk donderdag 5 juni 12:00 uur de passeerdatum door te geven. Passeert de klant woensdag 11 juni? Dan dient de notaris uiterlijk vrijdag 6 juni 12:00 uur de passeerdatum door te geven. Bereikbaarheid Service Centrum Wonen Het Service Centrum Wonen is op Goede Vrijdag (vrijdag 18 april) en Dag van de Arbeid (donderdag 1 mei) regulier bereikbaar. Op alle andere feestdagen zijn wij gesloten. Wij zijn dit jaar ook op Bevrijdingsdag (maandag 5 mei) gesloten. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:10:34Z",
  "source": "ech.nl"
}