{
  "id": "32d8087a6037f5e87374aad74e70375aee19ff94",
  "url": "https://www.ech.nl/bestuur-aan-het-woord-bernadette-verberne/",
  "title": "Bestuur aan het woord - Bernadette Verberne - ECH",
  "text": "Bestuur aan het woord - Bernadette Verberne - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestuur aan het woord – Bernadette Verberne / Bestuur , ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door Raymond Bloot Bernadette Verberne (KNB en ECH) over woestijnen, street art én innovatie ‘Nieuwsgierig, onconventioneel en autonoom: dat zijn drie kernwoorden die in me opkomen als ik mezelf als de mens achter de bestuurder zou moeten beschrijven. Al zijn deze eigenschappen wel nauw met elkaar verbonden.’ Aan het woord is Bernadette Verberne , manager Innovatie bij de KNB én bestuurslid bij stichting ECH. ‘Ik zoek vaak naar creatieve oplossingen, omdat iets mijn interesse of nieuwsgierigheid wekt. En niet zelden leiden deze zoektochten tot onconventionele oplossingen. Dat past bij mijn karakter.’‘ Verder hoor ik van mensen terug dat ze me als authentiek ervaren. Al vind ik dat wel wat lastig om over mezelf te zeggen, lacht Bernadette. ‘Maar het is inderdaad zo dat ik niet van poses of maskers houd. Het is wat het is en echtheid vind ik belangrijk: in de samenwerking met mensen hecht ik veel waarde aan authenticiteit. Het werken in een team waarin we elkaar respecteren, motiveren en aanmoedigen om aan een gezamenlijk doel te werken vind ik heel prettig. Het betekent ook dat, wanneer het soms wat minder soepel loopt of wanneer er issues zijn, je ook daar een weg in moet zien te vinden met elkaar. Uiteindelijk gaat het wat mij betreft om de inhoud en het samenwerken. Samen kom je verder.’ Bernadette Verberne, manager ICT en innovatie bij de KNB en bestuurslid bij ECH Innovatie versus realisme ‘Aan de ene kant ben ik van de innovatie, van het verkennen en van ongewone dingen zien. Verder houd ik van beeldtaal: niet voor niets denk ik vaak in beelden. Aan de andere kant ben ik erg van het realisme en het pragmatisme. Daar bedoel ik mee dat het inslaan van wegen die leuk lijken, maar waarvan vooraf al duidelijk is dat het waarschijnlijk tot niets leidt, voor mij niet als zinvol voelt. En gelukkig sta ik daarin, zowel bij ECH als bij de KNB, zeker niet alleen.’ Als je doet wat je altijd deed, krijg je wat je altijd kreeg ‘Binnen ECH staan we voor de opdracht om te kijken naar hoe we onszelf kunnen blijven vernieuwen. En dat is, zeker binnen een beroepsgroep die als belangrijke schakel in de maatschappij zekerheid en vertrouwen biedt, soms best een uitdaging. Mensen in het notariaat zijn immers opgeleid om continu stabiliteit en betrouwbaarheid te bieden. Maar dat gedegen karakter mag innovatie in de sector dan weer niet in de weg staan. Dat resulteert regelmatig in een spannend speelveld’, vervolgt Bernadette. Trots op groei en stabiliteit ‘Sinds 2016 ben ik bestuurslid bij ECH en binnen deze rol komen nogal wat waarden terug waarvan ik denk dat ze nodig zijn om met elkaar tot een goed resultaat te komen. We komen vanuit verschillende organisaties en dat zou een uitdaging kunnen zijn. Maar ik ervaar juist heel veel stimulans, onderling respect en de mogelijkheid om als individu verder te groeien. Dat maakt het voor mij heel waardevol om aan ECH deel te nemen. Ik heb de directie in de afgelopen jaren in competenties zien groeien en ook binnen het bestuur is daar sprake van. Het beter toebedelen van de verschillende rollen aan de bestuursleden en het aanstellen van een directeur Change vind ik een goede zaak. Nu nog helderder is wie wat doet, kunnen we op de doordachte manier die men van ons gewend is efficiënter meters maken. Deze ontwikkelingen gaan ons als ECH in staat stellen om ons dienstenportfolio verder uit te breiden. Ik durf te stellen dat we door de jaren heen, ook in de moeilijkere tijden, stabiliteit en continuïteit hebben geboden in de transacties die we verzorgen. Maandelijks praat je dan al snel over het faciliteren van een totaalbedrag dat tussen de 10 en 15 miljard euro ligt. Daarmee praten we over een groot economisch belang voor zowel grote, zakelijke klanten als voor heel veel kleinere, individuele particulieren. Dát resultaat: daar ben ik trots op.’ De komende periode op de agenda ‘Ik ga me de komende periode bezighouden met ontwikkelingen en innovaties in de woonketen. Denk dan aan productontwikkeling en strategie. Deze taak past prima bij de rol die ik binnen de KNB heb, waartoe onder andere innovatie van de IT van onze notariële beroepsorganisatie behoort. Belangrijk in de aankomende tijd is de samenwerking met Zorgeloos Vastgoed, waar we al eerder over gecommuniceerd hebben. In de regiegroep Zorgeloos Vastgoed vertegenwoordig ik de KNB en voor de stichting ECH ben ik één van de contactpersonen. We staan aan de vooravond van een participatie in dit belangrijke initiatief waarvoor eerder al een intentie tot samenwerking is uitgesproken. Dat juich ik van harte toe, juist vanwege de vernieuwing die Zorgeloos Vastgoed met het nieuwe afsprakenstelsel bereikt: dit stelsel geeft de verschillende partijen in de keten de gelegenheid om op een uniforme wijze met elkaar te communiceren, mede omdat er een transparanter proces wordt aangeboden. Kortom, aanhaken is voor ECH heel relevant. Verder zijn we in gesprek met andere partijen in de markt, zoals bijvoorbeeld de makelaardij, om te onderzoeken hoe we de dienstverlening van ECH nog verder kunnen verbreden en verdiepen.’ Over woestijnen en street art ‘Net als in mijn zakelijk leven, vind ik het ook in mijn vrije tijd leuk om nieuwe gebieden te verkennen, zij het dan fysiek. Corona heeft daarin wat roet in het eten gegooid maar ik mag graag wandelen in… de woestijn’, vertelt Bernadette. ‘Eerder heb ik vijf dagen door de Sahara gewandeld en dat was heel bijzonder: ik heb iets met woestijnen. Juist omdat er zoveel niet is. De leegte van een land als Schotland kan ik ook enorm waarderen. Verder heb ik onlangs een bezoek aan de Poolse stad Krakau en het nabijgelegen (voormalig) concentratiekamp Auschwitz gebracht wat vanzelfsprekend een enorme indruk maakte.’ Interesse in illusie ‘En wanneer ik een stad bezoek? Dan kijk ik altijd uit naar street art: het is het type creatieve uitingen dat je op niet direct voor de hand liggende plaatsen brengt. Vaak zijn het buurten waar veel gebeurt en waar dientengevolge ontelbare verhalen te vertellen zijn. Ik vind het mooi en indrukwekkend om die beeldtaal, meestal vormgegeven door jonge mensen, terug te zien. Het thema illusies interesseert me daarbij in het bijzonder, zowel in de wereld van kunst als in het algemeen. Zo is er, heel wonderlijk, ook in Krakau een illusiemuseum dat dit thema mooi tot uiting brengt. Verder houd ik van muziek: mijn smaak varieert van experimenteel tot klassiek. Wat dat aangaat is mijn muzieksmaak net zo breed als mijn werk voor de KNB en stichting ECH. En in beiden vind ik nog altijd uitdaging, leermomenten én plezier.’ Meer informatie Wil je meer weten over de visie van Bernadette Verberne of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:04:21Z",
  "source": "ech.nl"
}