{
  "id": "33ec1baa822da10c1d52526bed0e0197a7cbefab",
  "url": "https://www.ech.nl/meet-the-team-mary-van-wensveen/",
  "title": "Meet the team - Mary van Wensveen - ECH",
  "text": "Meet the team - Mary van Wensveen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Mary van Wensveen / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Administratie en het notariaat? Dat leken me saaie mannen in grijze pakken’, Mary van Wensveen, hoofd financiën bij de KNB ‘Werken voor ECH is prettig, want het is een overzichtelijke administratie om bij te houden. Al moet je wel goed weten hoe het werkt en dan met name hoe de verbanden liggen. Maar als je dat eenmaal door hebt, dan is het een feestje om te doen’, aldus Mary van Wensveen, hoofd financiën bij de KNB. Samen met een tweetal collega’s en een externe partij, is zij verantwoordelijk voor de administratie van de KNB, stichting ECH en een aantal andere specialistenverenigingen van het notariaat. In totaal gaat het om ongeveer 10 administraties, waarvan KNB de grootste is. ‘Het ingewikkelde karakter van de administratie van ECH zit vooral in de ingewikkelde inkopen, waaronder de diensten die de stichting afneemt bij de KNB. Daarnaast gaat het om flinke bedragen, waardoor oplettendheid geboden is. Verder innen we via de KNB, namens ECH, bij het notariaat alle inkomsten van de stichting en we factureren de hypothecair financiers uiteraard.’ Mary van Wensveen, Hoofd financiën KNB en ECH Notariaat als logische keuze ‘Ik ben hier gestart als interim controller. Dat is inmiddels zo’n 14 jaar geleden’, vervolgt Mary. ‘Het werken voor de KNB leek me hartstikke leuk, en het leek me gezien mijn achtergrond waarbij ik meer dan 13 administraties beheerde, prima te doen. Maar twee weken na mijn eerste werkdag stond de accountant op de stoep omdat de jaarrekening opgeleverd moest worden. Ook die van ECH, dat er in die jaren financieel minder rooskleurig voor stond dan tegenwoordig. Dat was wel even aanpoten! Verder speelde in het begin de samenwerking tussen hypothecair financiers en het notariaat een rol. Dat leek een beetje op een kip en ei verhaal eerlijk gezegd. Want de financiers zeiden dat ze wel aan wilden sluiten bij ECH, maar alleen als alle notariskantoren aangesloten waren en vice versa gold dat ook qua aansluitingen van hypothecair financiers. Nadat het notariaat een stap maakte en ECH ging omarmen, gingen de hypothecair financiers wel overstag én kwamen er in rap tempo partijen bij. Inmiddels werken alle Nederlandse notarissen die met hypotheken te maken hebben via ECH. En natuurlijk blijft het nog altijd zaak om ervoor te zorgen dat zoveel mogelijk partijen aansluiten. Het behalen van 100% daarin zal misschien lastig zijn, want sommigen hebben een dusdanig klein marktaandeel dat ze aansluiten niet als interessant ervaren. Alhoewel ook met die ketenpartners actief overleg gevoerd wordt, omdat kiezen voor ECH gelijk staat aan kiezen voor minder fouten en minder handmatig werk. Als gevolg daarvan heb je weer minder mensen nodig. En dat is nu, met de huidige krapte op de arbeidsmarkt, een mooie bijkomstigheid.’ Over grijze mannen in pak ‘Dat ik op een administratie in het notariaat terechtgekomen ben is op zich niet gek’, vervolgt Mary. ‘Al op het vwo vond ik financiën erg leuk. Al had ik niet direct het idee dat ik op een administratie wilde werken. In die tijd waren administrateurs bijna allemaal mannen in saaie grijze pakken met een hoed op. Daar zag ik mezelf als jonge vrouw met lange lokken niet direct tussen werken. Na het vwo ben ik de heao gaan doen, in de richting economisch linguïstisch. Handig, want ik spreek vloeiend Engels, Frans en Duits en mede daardoor kwam ik in de verkoophoek terecht waarbij ik me ook bezighield met marketing. Maar dat had ik snel gezien, want ik vond dat bij lange na niet uitdagend genoeg. Toen ik eenmaal in aanraking kwam met administratie, wist ik wat ik wilde: de financiële wereld in. In de avonduren ben ik SPD en HOFAM gaan studeren en ben ik een andere baan gaan zoeken. Na wat omzwervingen kwam ik bij de KNB terecht.’ Over de samenwerking met ECH ‘Ik vind het leuk om voor ECH te werken, mede omdat de mensen altijd zo enthousiast zijn. Zo stuur ik elke maand rapportages door en dan krijg ik zonder uitzondering een persoonlijk bedankje. Daarin wordt aangegeven dat ze vinden dat ik het goed gedaan heb, of er wordt waardering uitgesproken voor het feit dat ik proactief meedenk en dat vind ik heel attent. Verder hebben we, met Lisa en Floris, op maandelijkse basis werkoverleg en dan nemen we de bijzonderheden door op financieel gebied. En dat is naast inhoudelijk interessant, standaard heel gezellig. Kort samengevat kan ik zeggen dat het een relatief kleinschalig team is, goed te overzien en de mensen die ik spreek zijn altijd meelevend. ECH is gewoon een heel leuk bedrijf.’ Drie dagen werken als bewuste keuze ‘Ik werk overigens bewust drie dagen per week, zodat ik de andere dagen vrij heb om mijn werk te laten bezinken.  Ik vind het heel prettig om, bijvoorbeeld met vriendinnen op de tennisbaan te staan, mijn hoofd leeg te maken en bepaalde situaties te laten bezinken. Ik geloof dat dit de kwaliteit van mijn werk ten goede komt’, vervolgt Mary. ‘Als het enigszins kan om in deeltijd te werken, raad ik dit iedereen aan omdat je daardoor echt even afstand van je werk kunt nemen. Het helpt om de zaken te relativeren.’ ‘Mijn werkdagen zijn sowieso heel afwisselend. Zo krijg ik veel vragen uit het veld over de meest uiteenlopende financiële zaken. En ik maak financiële rapportages, controleer cijfers, maak begrotingen et cetera. Wat ik eigenlijk vooral probeer is cijfers begrijpelijk en toegankelijk te maken voor niet financieel georiënteerde mensen. Verder komt in augustus de accountant, waardoor ik dan weer volop voor ECH aan de slag kan. Het idee is dat we begin september de jaarrekening gaan goedkeuren.’ Op vakantie met de jeugd ‘In mijn overige vrije tijd wandel ik veel met de hond, volg ik tennislessen, schaats ik in het winterseizoen en ga ik graag op wintersport om te skiën. Verder lees ik graag, en houd ik van lekker eten en koken. Ik ben bij voorkeur actief bezig, want dat helpt me om mijn zinnen te verzetten. Ook vind ik het mooi dat mijn dochters, ze zijn 20 en 22, beiden nog thuis wonen. Zij brengen naast hun vriendje, ook veel leeftijdgenoten mee en dat houdt ons jong van geest. We gaan zelfs samen op vakantie en ondernemen dan veel sportieve activiteiten, waarbij wij natuurlijk de oudjes van de groep zijn’, besluit Mary lachend. ‘Al doen we niet onder hoor, voor de jongvolwassenen, we lopen vóórop als het gaat om het maken van reuring.’ Meer informatie Heb je vragen voor Mary, heb je ideeën of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor ieder klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:26:45Z",
  "source": "ech.nl"
}