{
  "id": "347fcf57814dd68e6409f35a8e73c79aaba4b090",
  "url": "https://www.ech.nl/aegon-live-met-ech/",
  "title": "Aegon live met ECH - ECH",
  "text": "Aegon live met ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Aegon live met ECH / Nieuws / Door Ruby Aegon heeft vandaag haar eerste elektronische passeeropdracht via ECH naar een notaris verstuurd. Daarmee zet Aegon een nieuwe stap in het verder optimaliseren en automatiseren van haar hypotheekprocessen. Lisa Huisman (directeur Stichting ECH): “De afgelopen tijd is er met veel toewijding gewerkt aan de aansluiting. Ik ben dan ook erg trots dat ik nu kan melden dat de eerste passeerzaak van Aegon inmiddels is verstuurd.” Aegon zal vanaf vandaag gebruik maken van ECH voor het passeren van een hypotheek. Deze keuze past bij haar uitgangspunt om haar processen in het algemeen, en specifiek voor wat betreft hypotheken, zo veilig en efficiënt mogelijk in te richten om zo haar dienstverlening richting klanten te verbeteren en te versnellen. Aegon is gestart met de aansluiting op het onderdeel Vestigen hypotheek. De ambitie is om in de toekomst ook het onderdeel Aflossen hypotheek toe te voegen. Belangrijke informatie voor de notaris Om als notariaat de Aegon dossiers goed te kunnen verwerken in ECH heeft Aegon richtlijnen geformuleerd in een zogenaamde notarisinstructies. U vindt deze notarisinstructie hier . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T03:59:00Z",
  "source": "ech.nl"
}