{
  "id": "35dc254f51f2ec5df4c181d02c35e164b446fc95",
  "url": "https://www.ech.nl/rabobank-tijdslijnen-rondom-feestdagen-2/",
  "title": "Rabobank: Tijdslijnen rondom feestdagen - ECH",
  "text": "Rabobank: Tijdslijnen rondom feestdagen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Rabobank: Tijdslijnen rondom feestdagen / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Faheem Malhi Inleiding Rabobank hanteert rondom de komende feestdagen de reguliere aanlevertermijnen voor passeren en royeren. Om te waarborgen dat alle zaken tijdig kunnen worden verwerkt, vragen we nadrukkelijk om zaken waarvan de (passeer)datum bekend is zo snel mogelijk door te geven. Op die manier kunnen de werkzaamheden zo goed mogelijk gepland worden zodat zaken met een kortere doorlooptijd ook tijdig kunnen worden afgewikkeld. Om dit jaar nog alle verzoeken tijdig af te kunnen wikkelen, wordt zéér terughoudend omgegaan met het in behandeling nemen van spoeddossiers. Tijdslijnen Royeren Royementsverzoeken dienen, conform de reguliere termijn, ten minste 15 werkdagen voor royementsdatum te worden doorgegeven: Stuurt de notaris het royementsverzoek met aflosdatum dinsdag 31 december? Dan moet het verzoek uiterlijk vrijdag 6 december bij ons binnen zijn; Stuurt de notaris het royementsverzoek op of na maandag 9 december? Dan kan er niet eerder dan in 2025 worden geroyeerd. Is er sprake van een lening met een opbouwproduct? En wordt dit opbouwproduct afgelost op de lening? Om de aflossing van het opbouwproduct op de lening in 2024 te garanderen, gelden de volgende termijnen: Banksparen (Rabo OpbouwSpaarrekening): Royementsdatum is uiterlijk donderdag 12 december om de aflossing met de afkoop van het opbouwproduct dit jaar nog te garanderen. Het royementsverzoek dient dan uiterlijk donderdag 21 november bij ons binnen te zijn. Verzekerde producten (Interpolis opbouwproducten): Royementsdatum is uiterlijk dinsdag 3 december om de aflossing met de afkoop van het opbouwproduct dit jaar nog te garanderen. Het royementsverzoek dient dan uiterlijk dinsdag 12 november bij ons binnen te zijn. Tijdslijnen passeren Passeerverzoeken dienen ten minste 2 werkdagen voor passeren te worden doorgegeven: Passeert de klant op dinsdag 24 december 2024? Dan dient de notaris vóór vrijdag 20 december 2024 12:00 uur de passeerdatum door te geven. Passeert de klant op vrijdag 27 december 2024? Dan dient de notaris vóór maandag 23 december 2024 12:00 uur de passeerdatum door te geven. Passeert de klant op maandag 30 december 2024? Dan dient de notaris vóór maandag 23 december 2024 12:00 uur de passeerdatum door te geven. Passeert de klant op dinsdag 31 december 2024? Dan dient de notaris vóór donderdag 26 december 2024 12:00 uur de passeerdatum door te geven. Passeert de klant op dinsdag 2 januari 2024? Dan dient de notaris vóór maandag 30 december 2024 12:00 uur de passeerdatum door te geven. Passeert de klant op woensdag 3 januari 2024? Dan dient de notaris vóór dinsdag 31 december 2024 12:00 uur de passeerdatum door te geven. Bereikbaarheid Service Centrum Wonen Het Service Centrum Wonen is op dinsdag 24 december en vrijdag 27 december gedurende de reguliere openingstijden bereikbaar. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:28:04Z",
  "source": "ech.nl"
}