{
  "id": "38456898b5b0eee8962d26b8de24d43dba80c972",
  "url": "https://www.ech.nl/ech-schoont-op/",
  "title": "ECH schoont op - ECH",
  "text": "ECH schoont op - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Terug naar 'Zo werkt ECH' ECH schoont op Aan de dienstverlening van ECH worden strenge eisen gesteld op het gebied van privacy en security. Dit heeft te maken met de privacygevoelige gegevens waarmee gewerkt wordt. ECH als postbode, niet als archief Stichting ECH stelt zich daarom zoveel mogelijk op als postbode en niet als (extra) archiefmogelijkheid. Berichten worden daarom niet langer bewaard dan nodig is. Alle zaken die zes maanden of langer geleden zijn afgerond én alle inactieve zaken waar al langer dan een jaar geen activiteit op is uitgevoerd, worden daarom maandelijks opgeschoond. Eigen archief Stichting ECH raadt daarom aan om de uitgewisselde berichten en documenten direct na afronding van een zaak zelf op te slaan in pdf-vorm. In verband met de bewijslast, adviseert Stichting ECH om in ieder geval de berichten ‘passeeropdracht’ (en eventuele aanvullingen daarop) en ‘aflosnota’ van elk dossier te bewaren. Tot slot raden we ook aan om de door maatschappijen afgegeven volmachten zorgvuldig te bewaren. Software óf webcliënt Notariskantoren die ECH gebruiken via een softwarepakket doen er goed aan om bij de softwareleverancier na te vragen of en welke berichten automatisch worden opgeslagen. Gebruikers van de webcliënt kunnen zaken in hun geheel downloaden.” Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T03:58:40Z",
  "source": "ech.nl"
}