{
  "id": "3a4bc640bf1a8a5a8f2b55fbdbe6fcf344c1c61c",
  "url": "https://www.ech.nl/notarissen/quion-bv/",
  "title": "Quion BV - ECH",
  "text": "Quion BV - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Quion Groep B.V. Proces: Passeren & Royeren E-mail: info@quion.com Telefoon: 010 – 242 15 98 01 Nieuwsberichten 02 03 Passeren Royeren Deelnemersinfo Quion Groep B.V. Algemene informatie/nieuwsberichten (kort) Royeerverzoeken van Woonnu moeten nog steeds verstuurd worden naar Quion Per 17 augustus 2024 is Woonnu gefuseerd met NN Bank en is de naam van ‘Woonnu BV’ niet meer actief. De juridische entiteit is gewijzigd naar: Nationale-Nederlanden Bank N.V., handelend onder de naam Woonnu. Sinds de naamswijziging is ons opgevallen dat de Royementen ten onrechte bij Nationale-Nederlanden Bank NV terecht zijn gekomen. Het proces is ongewijzigd dus de Royementen moeten nog steeds aan Quion worden doorgegeven. Welke bestandstypes worden geaccepteerd? De meest voorkomende bestandstypen zoals Word en PDF kunt u als bijlage meesturen. Informatie over maatschappijen Op NotarisNet vindt u bij ‘Thema’s en onderwerpen’ in de categorie ‘Hypotheekmodellen’ onder ‘Quion Hypotheekbemiddeling’ de volmachten voor welke maatschappijen u bij ons terecht kunt met uw (aflos)verzoeken. Hier vindt u een compleet overzicht van de hypotheeklabels en bijbehorende volmachten. Notarisinstructie passeer proces Passeerproces Steeds meer labels van Quion stappen over op het passeerproces via ECH. Voor onderstaande labels ondersteunt Quion ook het passeeproces via ECH. Een goede stap in procesoptimalisatie. Informatie en instructies met betrekking tot het passeerproces zijn te vinden op de instructiepagina’s van de verschillende partijen: Allianz Argenta Attens Hypotheken Centraal Beheer Clarian Wonen HollandWoont Hypotrust IQWoon Robuust Hypotheken Syntrus Achmea Tellius Hypotheken Vista Hypotheken Woonfonds Woonnu Notarisinstructie r oyementenproces Royementenproces Meerdere aflosverzoeken per klant Heeft u voor een klant meerdere aflosverzoeken bij verschillende maatschappijen? Dan ontvangen wij graag per maatschappij een apart verzoek. Heeft u voor een klant meerdere aflosverzoeken bij dezelfde maatschappij? Dit kunt u aan ons doorgeven in een gezamenlijk ECH-verzoek. Geeft u dan per hypotheek de kadastrale gegevens door. Gaat het om overbruggingshypotheek? Dan graag altijd in een apart verzoek. Deze royementen kunnen via ECH Een geheel royement van een hypotheek op een onderpand Een gedeeltelijk royement van overbruggingshypotheken. Deze royementen gaan via info@quion.com (kan niet via ECH) Een aflosverzoek waarbij het onderpand wijzigt. Bijvoorbeeld met een verkoop van de garagebox, schuur of parkeerplaats of een ruiling van een stuk grond. Een geheel royement van een hypotheek die voor 01-06-2012 volledig is afgelost. Graag meesturen met de e-mail: een royementsvolmacht onder vermelding van het dossiernummer van de afgeloste hypotheek. Voor een snelle doorstroom van uw verzoek vragen wij u in het onderwerp van de e-mail aan te geven of het een aflosverzoek voor wijziging onderpand betreft of een aflosverzoek van voor 01-06-2012. Aflosnota opvragen Wij hanteren een aankondigingstermijn van 30 dagen. Wij streven er naar om aflosnota’s uiterlijk 5 werkdagen voor aflosdatum aan te leveren, bij uitzondering is dit korter. Heeft u vier werkdagen voor de aflosdatum niets van ons gehoord, neemt u dan contact met ons op via 010-2421598. Wijziging op een lopend ECH-zaaknummer Gewijzigde aflosdatum Wijzigt de aflosdatum meer dan 4 werkdagen eerder of later: Dan kunt u via een lopend ECH-zaaknummer gemakkelijk een wijziging van de aflosdatum doorgeven. Wijzigt de aflosdatum minder dan 4 werkdagen eerder of later Dan kunt u  het totaalbedrag vermeerderen of verminderen met de dagrente voor elke dag dat de betaling later of eerder heeft plaatsgevonden ten opzichte van de huidige aflosdatum. Overige wijzigingen Ook alle overige wijzigingen kunt u aan ons doorgeven via het lopende ECH-zaaknummer. Zoals het toevoegen van een kadastrale inschrijving of het toevoegen van een klant. Contact Heeft u een vraag over aflossen? Neemt u dan contact met ons op via telefoonnummer 010-2421598. Wij helpen u graag op werkdagen van maandag tot en met vrijdag van 8.30 tot 17.30 uur of via info@quion.com . Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:09:23Z",
  "source": "ech.nl"
}