{
  "id": "3a8bdd8a0ab71af1c5f41285a936647dc1a15905",
  "url": "https://www.ech.nl/stichting-ech-en-notariaat-tips-tricks-ech/",
  "title": "Stichting ECH en Notariaat: tips & tricks ECH - ECH",
  "text": "Stichting ECH en Notariaat: tips & tricks ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Stichting ECH en Notariaat: tips & tricks ECH / Nieuws / Door echadmin Stichting ECH bestaat dit jaar 17 jaar. Door de jaren heen zijn er steeds meer notariskantoren die gebruik zijn gaan maken van ECH. Circa 99% van het notariaat communiceert inmiddels op een snelle, makkelijke en veilige manier met de hypothecair financiers via de berichtenstandaard van ECH. ECH blijft inzetten op een snel, gemakkelijk en veilig proces. Om ervoor te zorgen dat de communicatie tussen hypothecair financiers en het notariaat steeds efficiënter kan verlopen, geeft Maykel van Londen (consultant bij Stichting ECH) een aantal Tips & Tricks. Meesturen van onderpanden Bij het opvoeren van de gegevens in het aflosverzoek kunnen onderpanden worden opgegeven waarop de betreffende inschrijving van toepassing is. Een inschrijving kan gedeeltelijk of geheel worden doorgehaald. Bij een gedeeltelijke doorhaling is het verplicht om de betreffende onderpanden mee te geven. ECH verplicht het meesturen van onderpanden niet bij een gehele doorhaling. Bij een gehele doorhaling wordt de inschrijving namelijk bij alle onderpanden weggehaald. Om de verwerking van een aflosverzoek soepel en snel te laten verlopen ontvangen de hypothecair financiers graag altijd de betreffende onderpanden van u, ongeacht of het een gedeeltelijke of gehele doorhaling betreft. Hypothecair financiers kunnen de bijbehorende lening het snelst vinden aan de hand van de onderpandgegevens. Als de financier deze gegevens van u ontvangt, dan kunt u ook sneller de aflosnota of het akkoord royement verwachten. Wijzigen van data In de praktijk kan het gebeuren dat de klant – om welke reden dan ook – een geplande aflos- of passeerdatum niet haalt. In dat geval is het van belang om de hypothecair financier hier zo snel mogelijk via ECH van op de hoogte te stellen. Zo kan ook de hypothecair financier haar administratie aanpassen op de wijziging. Vervolgstappen zoals het plannen van incasso’s of het openzetten van klantportalen kunnen op deze manier worden uitgesteld. Daarnaast zal de zaak in ECH automatisch worden aangepast. Zo zullen de deadlines van de nog openstaande taken worden aangepast op basis van de nieuwe datum die wordt doorgegeven. Contact opnemen met de servicedesk of met de hypothecair financier? Zodra u bezig bent met een ECH-zaak kan het zijn dat u ergens tegenaan loopt. In deze gevallen kunt u contact opnemen met de Servicedesk van de KNB, de Servicedesk van uw softwareleverancier of met de betreffende hypothecair financier. Maar wanneer neemt u nu contact op, en met wie? Contact opnemen met de hypothecair financier Wanneer u zaakinhoudelijke vragen heeft, dan zult u deze vragen moeten stellen aan de betrokken hypothecair financier. Dit kunnen vragen zijn over het nog ontvangen van een bericht of over het ontvangen van de gelden. Contact opnemen met de Servicedesk van de KNB Zodra u vragen heeft over de werking van ECH of de ECH internetapplicatie, dan kunt u deze vragen stellen aan de Servicedesk van de KNB. Contact opnemen met de Servicedesk van uw softwarepakket Als u vragen heeft over de werking van uw softwarepakket, dan kunt u deze vragen stellen aan de Servicedesk van uw softwareleverancier. Denk bijvoorbeeld aan het toevoegen van onderpanden of inschrijvingen bijvoorbeeld in een ECH-zaak. De contactgegevens van bovenstaande partijen zijn te vinden op www.ech.nl Wilt u meer weten over de Tips & Tricks binnen ECH voor u als notariskantoor? Of heeft u zelf nog tips voor het gebruik van ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T04:04:47Z",
  "source": "ech.nl"
}