{
  "id": "3c252b767607474d47bcb0a42df147fef52c9778",
  "url": "https://www.ech.nl/hdn-en-ech-een-sterke-combinatie-met-oog-voor-de-consument/",
  "title": "HDN en ECH: een sterke combinatie met oog voor de consument￼ - ECH",
  "text": "HDN en ECH: een sterke combinatie met oog voor de consument￼ - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X HDN en ECH: een sterke combinatie met oog voor de consument￼ / Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘ HDN , voluit Hypotheken Data Netwerk , is 27 jaar geleden opgericht om de communicatie tussen de verschillende marktpartijen, zoals financieel adviseurs, hypothecair financiers en traditionele banken te verbeteren. Het was in die tijd dat het internet zo’n beetje opkwam en men met elkaar bedacht dat het handig zou zijn om de manier waarop er onderling gecommuniceerd werd uniform te maken.’ Aan het woord is Merlyn van den Berg , adjunct-directeur van coöperatieve vereniging HDN. Reinier van der Heijden en Merlyn van den Berg, directie Hypotheken Data Netwerk De overeenkomsten tussen HDN en ECH ‘Wat stichting ECH aan haar kant doet voor de communicatie tussen hypothecair financiers en het notariaat, is wat wij doen voor de communicatie tussen adviseurs, franchiseketens, serviceorganisaties en IT-leveranciers én vrijwel alle grote aanbieders van hypotheek- en hypotheekgerelateerde producten. Ten eerste helpen we de adviseur door een gestandaardiseerd, uniform aanvraagformulier te bieden, waarmee hij overal terecht kan met zijn aanvraag. Voor hypothecair financiers is dat bovendien gemakkelijker, vanwege de herkenbaarheid van dit formulier. Feitelijk gaat het over een gestandaardiseerde manier van met elkaar communiceren. Ten tweede verzorgen wij het transport van die informatie. Die gaat over de HDN-lijn.’ HDN-netwerk bevat 85% van het hypotheekverkeer ‘Ongeveer 85% van het hypotheekverkeer gaat over het HDN-netwerk. Omdat er zo’n belangrijk deel van de Nederlandse hypotheekaanvragen via ons platform verloopt, hebben we een goed beeld van hoe de hypothekenmarkt er op dit moment voor staat’, vult collega Reinier van der Heijden , directeur van HDN, aan. ‘Je zou kunnen zeggen dat we op een goudmijn zitten, kijkend naar de enorme hoeveelheid data waar we over beschikken. Maar we zijn een vereniging: banken, hypothecair financiers en verzekeraars zijn onze leden en we hebben geen commerciële inslag. Dit betekent dat we de data teruggeven aan de markt. Dat doen we onder meer door het maken van kwartaal- en jaarverslagen en we schrijven berichten aan de Tweede Kamer om deze belangrijke informatie zinvol in te zetten.’ Digitaal koopcontract dit jaar live ‘Ook proberen we onze dienstverlening steeds verder door te ontwikkelen. Zo hopen we in dit jaar het digitale koopcontract, in het initiatief Zorgeloos Vastgoed waar we participeren, live te brengen. Het doel is dat dit specifieke document digitaal door de hele keten heen ingezet kan worden, zodat de consument nog gemakkelijker door het aankoopproces kan gaan. Elke betrokken partij, van adviseur, makelaar tot notaris heeft dit koopcontract immers nodig tijdens het doorlopen van het proces’, aldus Reinier. ‘Door dit contract te digitaliseren is de benodigde informatie eenvoudig naar boven te halen en binnen de keten te delen. Het is dan ook niet verwonderlijk dat de overheid erg geïnteresseerd is in deze ontwikkeling, net als het notariaat trouwens.’ ‘De samenwerking tussen ECH en HDN is bovendien een hele logische, omdat we met elkaar in staat zijn om een verbetering te creëren voor de consument door het koppelen van meerdere ketenpartners.’, zegt Reinier van der Heijden – directeur HDN Over de samenwerking met ECH Merlyn vervolgt: ‘En dan komt al snel de samenwerking met ECH naar voren. Wanneer wij bijvoorbeeld een bericht rondom een bankgarantie over onze lijn sturen, en een adviseur vult in dit bericht de benodigde velden in, dan zou het vreemd zijn als ECH andere datavelden hanteert bij de verzending naar de notaris. Die informatie is er immers al in een bestaand bericht vanuit ons. Je zou dan de situatie krijgen dat de bank een bericht van HDN ontvangt en dan bij het doorzetten naar de notaris een ander bericht moet gebruiken. Terwijl als je dezelfde definities gebruikt, je naast het extra werk dat je voorkomt, je ook maar één in plaats van twee berichten hoeft te onderhouden. Daarom kijken we samen met stichting ECH steeds naar hoe we deze berichtenuitwisseling zo slim en uniform mogelijk in kunnen passen binnen beide communicatiestromen. We blijven nadrukkelijk uit elkaars vaarwater, en zoeken vooral naar hoe en waar we elkaar kunnen versterken binnen de keten. Overigens is het proces rondom de bankgarantie een voorbeeld van laaghangend fruit plukken, maar het maakt wel duidelijk welke mogelijkheden er zijn voor andere digitale documenten.’ Reinier: ‘Daarnaast werken we gewoon heel goed samen met ECH en leren we van elkaar als het gaat om zaken als governance, bestuursaangelegenheden en meer.’ Een blik op de vastgoedmarkt ‘Kijkend naar de vastgoedmarkt is het duidelijk dat verschillende zaken, waaronder corona, grote invloed hadden op de voorbije periode’, vervolgt Merlyn. ‘In het afgelopen jaar zagen we voor het eerst dat de oversluitmarkt groter was dan de aankoopmarkt van woningen. Mensen braken massaal hun rentecontracten open, om te profiteren van de lage rentestand. Verder verwachten we een daling van het aantal hypotheekaanvragen. Voor de tweede helft van het jaar schatten we in dat de hypothekenmarkt het lastig krijgt, want er zijn immers relatief weinig woningen die nog verkocht worden en zij die een rentecontract open wilde breken hebben dit inmiddels al gedaan. Oversluiten zal voornamelijk gaan om consumenten die tegen het einde van hun rentevastperiode aanlopen, en verplicht een nieuw rentecontract moeten kiezen. Al blijft het een lastig te voorspellen situatie, zo grillig is de markt immers wel. Verder speelt verduurzaming in de hypotheekmarkt een belangrijke rol, ook met het oog op het klimaatakkoord van Parijs. Banken hebben toezeggingen gedaan om bij te dragen aan dit klimaatakkoord. Wij hebben overigens relatief weinig inzicht in de resultaten van die afspraken en kunnen niet exact meten hoeveel er concreet wordt gedaan aan verduurzaming. Wel kunnen we inzicht geven in hoe het ervoor staat, omdat we weten bij hoeveel aanvragen er daadwerkelijk een budget voor verduurzaming wordt meegenomen. Als dit niet gefinancierd wordt, dan weten wij bijvoorbeeld niet of het überhaupt wel aan bod is gekomen in het adviesgesprek.’  Reinier: ‘Maar al met al merken we dat er steeds meer drive is binnen de hypotheekmarkt om actief in te zetten op duurzaamheid, voor het leefbaar houden van onze planeet dus.’ De mens achter het bedrijf ‘Wanneer ik kijk naar de samenwerking met ECH, dan kan ik niet anders dan constateren dat er ook een klik is op menselijk vlak. Men vult elkaar heel goed aan en je merkt aan alles dat er vertrouwen is onderling. En dat vertrouwen ervaren wij ook in de contacten die we met de stichting hebben’, vervolgt Reinier. ‘De samenwerking tussen ECH en HDN is bovendien een hele logische, omdat we met elkaar in staat zijn om een verbetering te creëren voor de consument door het koppelen van meerdere ketenpartners.’ Merlyn vult aan: ‘Uiteraard vormt het belang van de consument daarbij altijd de basis. Daar oog voor hebben is een belangrijke rol die wij bewust op ons nemen: de klant centraal blijven zetten in het proces. Dus ondanks het feit dat wij zelf vanuit onze vereniging geen klantcontact hebben, zijn we erg bezig met die customer journey. En dat belang van die consument vooropstellen, ervaren we precies zo bij ECH.’ Meer informatie Wil je meer weten over de visie van HDN of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:02:35Z",
  "source": "ech.nl"
}