{
  "id": "3c4ae0b4cf9dea27cbc90d63ad8667f9917f2daa",
  "url": "https://www.ech.nl/naast-regiobank-ook-passeeropdrachten-van-blg-wonen-en-sns-via-ech/",
  "title": "Naast Regiobank ook passeeropdrachten van BLG wonen en SNS via ECH - ECH",
  "text": "Naast Regiobank ook passeeropdrachten van BLG wonen en SNS via ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Naast Regiobank ook passeeropdrachten van BLG wonen en SNS via ECH / Nieuws / Door Ruby Vanaf maandag 14 mei gebruiken BLG wonen en SNS elektronische communicatie hypotheken (ECH) voor het passeerproces. Bij de volksbank ging eerder Regiobank live met ECH. Tot die tijd werkte de bank alleen met ECH voor het proces van algehele aflossingen en deelroyementen. Alle passeeropdrachten worden vanaf maandag 14 mei via ECH verzonden. Lopende zaken worden nog buiten ECH om verwerkt. Notarissen wordt gevraagd om voor deze zaken de melding ‘passeergegevens’ zo snel mogelijk, maar uiterlijk 24 mei op te sturen in verband met de ingang van de algemene verordening gegevensbescherming (AVG). Per 18 mei past het kadaster de kik modelakte voor Regiobank en SNS aan. Dit omdat de offertedatum niet in de ECH notarisinstructie is ondersteund. De offertedatum komt op dit moment niet in de notarisinstructie. Afhankelijk van de snelheid waarmee uw softwareleverancier de wijziging doorvoert komt deze ook in het betreffende softwarepakket beschikbaar. Daarnaast verzoeken BLG wonen, Regiobank en SNS om digitaal via ECH de hypotheekaktes en passeerbevestiging naar de bank te sturen. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:09:47Z",
  "source": "ech.nl"
}