{
  "id": "3e2503162acdbd66ba8bc0becf06155a9013fa97",
  "url": "https://www.ech.nl/eerste-gebruikers-actief-met-royeren-5-0/",
  "title": "Eerste ECH gebruikers actief met Royeren 5.0 - ECH",
  "text": "Eerste ECH gebruikers actief met Royeren 5.0 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Eerste ECH gebruikers actief met Royeren 5.0 / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Op 17 november zijn de nieuwe en verbeterde functies van royeren toegevoegd aan de ECH webapplicatie. Met deze stap realiseert Stichting ECH een belangrijke mijlpaal in de uitrol van het vernieuwde royeren proces (versie 5.0). Gebruikers van de webapplicatie gaan enkele kleine aanpassingen merken. Het vernieuwde royeren proces biedt diverse nieuwe en verbeterde functionaliteiten. Verbeterde en nieuwe functionaliteiten Binnen het royeren proces zijn verbeteringen en vernieuwingen aangebracht welke in samenspraak met een afvaardiging van de notarissen en hypothecair financiers zijn afgestemd om zo het proces van royeren van een hypotheek nog beter op elkaar af te stemmen. De doorgevoerde verbeteringen zijn op verschillende gebieden, zo is de term “aflossen” overal vervangen door “royeren” en zijn er enkele wijzigingen aangebracht in de indeling van de overzichten. De rubriek “verzekeringen” is hernoemd naar “opgebouwde waarde”. Met dit gegeven geeft de notaris aan of er sprake is van een meeverbonden spaar- of beleggingsproduct en zo ja, of deze wel of niet verrekend gaat worden met het af te lossen bedrag. Zo zijn de onderpandgegevens altijd verplicht aanwezig in het verzoek en is een specifiek veld om het leningnummer of kenmerk van de hypotheek die geroyeerd gaat worden door te geven toegevoegd. Samen met de onderpandgegevens geeft dit de hypothecair financier betere mogelijkheden om het juiste leningdossier te vinden in de eigen administratie, wat resulteert in een snellere afhandeling van het verzoek. Bovendien is de keuzelijst voor de reden van royement uitgebreid, met name voor situaties van scheiding. Hierdoor kan de hypothecair financier beter bepalen of er een vergoeding voor vervroegde aflossing van toepassing is. Daarnaast zijn er aangepaste PDF documenten voor de nieuwe versie van royeren in gebruik genomen. Alle hypothecair financiers die zijn aangesloten op het ECH royeren proces zijn momenteel bezig om de vernieuwde functionaliteiten in gebruik te nemen. Ook werken de door ons gecertificeerde notariële softwareleveranciers aan de integratie van de nieuwe functies van het royeren proces. Meer informatie Wil je meer weten over het nieuwe proces royeren 5.0 of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:01:59Z",
  "source": "ech.nl"
}