{
  "id": "3eee75a08290a265be4339dd585b0de1c053fbc2",
  "url": "https://www.ech.nl/notarissen/rabobank/",
  "title": "Rabobank - ECH",
  "text": "Rabobank - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Rabobank Proces: Passeren & Royeren E-mail: SCFparticulieren@rabobank.nl Telefoon: 088 7288728 01 Nieuwsberichten 02 Passeren 03 Royeren 04 Bankgaranties Deelnemersinfo Rabobank Algemene informatie/nieuwsberichten (kort) Rabobank hanteert tijdens de komende feestdagen afwijkende tijdslijnen. Deze afwijkende tijdslijnen zijn hier te vinden. Vanaf dinsdag 18 maart kunnen notarissen bankgaranties van de Rabobank via ECH ontvangen. De bankgarantie is te raadplegen via de ECH-webapplicatie. Voor meer informatie omtrent het bankgarantieproces kunt u onderaan deze pagina kijken of de FAQ raadplegen. Het SCW (Service Centrum Wonen) is een administratief centrum van de Rabobank. Bij het SCW worden alle Rabobank-hypotheken afgehandeld. Alle lokale Rabobanken zijn aangesloten bij het SCW. Het SCW verzorgt de volgende werkzaamheden: De administratieve afhandeling van woningfinancieringen voor alle lokale Rabobanken. Het beheer van woningfinancieringen voor alle lokale Rabobanken. Vragen? Contact opnemen met het SCW kan als volgt: afhandelen@rabobank.nl voor vragen over de administratieve afhandeling van te verstrekken hypothecaire financieringen. royeren@rabobank.nl voor vragen over royementdossiers. zekerheden@rabobank.nl voor vragen over of het insturen van verzoeken voor notariële volmachten, toestemmingsverklaringen en beslagen e.d. Het algemene e-mailadres, SCFparticulieren@rabobank.nl , blijft gewoon bestaan. Bellen naar het SCW kan ook: 088-728 87 28. Het nummer is op werkdagen bereikbaar van 8.30 uur tot 16.30 uur. LET OP : dit telefoonnummer is alleen bedoeld voor de notaris, het SCW behandelt geen klantvragen. Voor vragen over het gebruik van ECH vanuit uw softwarepakket kunt u contact opnemen met de servicedesk van uw eigen leverancier. Voor vragen over het gebruik van de ECH applicatie op notarisnet en technische vragen kunt u contact opnemen met de servicedesk van ECH via het telefoonnummer 070-330 71 35 of via info@ech.nl . Aandachtspunten algemeen Bijlagen De notaris heeft de mogelijkheid in ECH om bijlagen toe te voegen aan het bericht. De enige bijlage die het SCW in behandeling neemt, is de royementsvolmacht, de kopie van de hypotheekakte en de notarisverklaring. Alle overige bijlagen, zoals bijvoorbeeld kadastrale tekeningen, neemt het SCW niet in behandeling. Vrije tekstberichten worden niet in behandeling genomen omdat deze niet voor het SCW zichtbaar zijn. Wilt u iets aan ons doorgeven, dan dient u ten alle tijden telefonisch contact met ons op te nemen of een gewijzigd verzoek in het bestaande dossier in te dienen. Notarisinstructie passeerproces Melden passeergegevens Houd bij het maken van de passeerafspraak met de klant rekening met de aanlevertermijn bij het SCW. De aanlevertermijn voor het melden van de passeerdatum is tenminste 5 werkdagen voor het daadwerkelijk passeren. Voor aanvragen die, ten gunste van de klant, eerder moeten passeren geldt een afwijkende aanlevertermijn. De passeerdatum moet dan minimaal 2 werkdagen in de toekomst liggen. Voor deze aanvragen geldt dan wanneer SCW de passeerdatum bijvoorbeeld op maandag voor 12:00 uur van u ontvangt, de zaak op woensdag bij u kan passeren. U kunt alleen een passeerdatum doorgeven als u als notaris vanuit SCW een kennisgeving heeft ontvangen. Meld de passeerdatum direct bij het SCW na het maken van een passeerafspraak met de klant. Melden Uitstel/Afstel Wordt een passeeropdracht uitgesteld of geannuleerd? Meld dit zo spoedig mogelijk en uiterlijk op de dag van passeren. Dit is van groot belang voor zowel de klant, SCW als onze adviseurs. Dit heeft te maken met de geldstromen die worden uitgevoerd bij geplande verstrekking en het tijdsverlies dat kan optreden bij herstel of latere verstrekking. Passeerbevestiging Wij vragen u de passeerbevestiging, inclusief een afschrift van de hypotheekakte, notarisverklaring en inschrijfgegevens (datum/deel/nummer) uiterlijk 3 werkdagen na passeren aan te leveren. U kunt het dossier dan snel sluiten en wij kunnen ons dossier ook afhandelen binnen de termijn die we met de lokale Rabobank hebben afgesproken. Controle op onherroepelijkheid omgevingsvergunning Vanaf 1 januari 2023 vraagt de Rabobank notarissen om voortaan te controleren of de omgevingsvergunning onherroeplijk is alvorens de hypotheekakte te passeren. Meer informatie is hier te vinden. Notarisinstructie royementenproces Verzoek aflosnota Stuur een aflosverzoek uiterlijk 15 werkdagen voor de gewenste aflosdatum in. Het streven is om de getekende royementsvolmacht inclusief eventuele aflosnota 7 werkdagen voor de aflosdatum bij u aan te leveren. Helaas is dit niet altijd mogelijk omdat het SCW hierbij afhankelijk is van informatie van andere afdelingen binnen de Rabobank. Wanneer u 3 werkdagen voor passeren nog niets van ons heeft ontvangen kunt u telefonisch contact met ons opnemen. Spoedroyement Afwijken van de aanlevertermijn kan alleen onder strikte voorwaarden. Heeft u een spoedverzoek, neem dan contact met ons op en geef het aangemaakte ECH zaaknummer door. SCW Royeren beoordeelt dan of het dossier voldoet aan de voorwaarden en kan onder voorbehoud een spoedprocedure in gang zetten. SCW Royeren is bereikbaar op telefoonnummer 088 7288728, keuze 1.2. Nog niet alle verzoeken via ECH mogelijk Onderstaande verzoeken kunnen niet via ECH ingediend worden en kunt u indienen via mail: royeren@rabobank.nl : Gedeeltelijke doorhaling van een Scheepshypotheek Executieveiling Een gedeeltelijk royement waarbij méér dan 35 registergoederen geroyeerd worden Aflosdatum in het verleden Als u een royementsverzoek wilt indienen met een aflosdatum in het verleden dan kunt u deze via ECH aanleveren. Bij de aflosreden kiest u dan voor “Geen aflossing, datum passeren niet relevant (aflosdatum = fictieve datum)”. Wel dient u de aflosdatum 15 werkdagen vooruit te plaatsen. Algeheel/gedeeltelijk royement U dient voor dezelfde klant, waarbij sprake is van meerdere royementsverzoeken voor hetzelfde onderpand, dit in één aflosverzoek bij ons op te vragen. Het is dus mogelijk om binnen één aflosverzoek een inschrijving geheel en een andere inschrijving gedeeltelijk te laten doorhalen. Geef bij een gedeeltelijk royement ook de kadastrale omschrijving aan ons door. Dit betreft onderpandgegevens, sectie, nummer, perceelgrootte en evt. het perceelgedeelte. Dit voorkomt vertraging bij afwikkeling van het royement. Wijzigen Iedere wijziging dient in het reeds lopende ECH-dossier te worden doorgevoerd. Hiervoor hoeft u geen nieuw ECH dossier te starten. Als de passeerdatum wijzigt Op de aflosnota staat de dagrente. Als de passeerdatum wijzigt met uiterlijk 5 werkdagen, verreken dan de dagrente met het af te lossen bedrag. Wijkt de datum af met meer dan 5 werkdagen, dan dient u dit zo spoedig mogelijk door te geven via ECH. Zo kunnen wij alle vervolgstappen uitvoeren en zal de klant geen nadelige gevolgen ondervinden van een foutieve aflosdatum. Houdt u hierbij wel rekening met de aanlevertermijn zoals hierboven beschreven. Geef de wijziging via ECH niet door via een wijzigingsbericht. Aflossing gaat niet door Gaat de aflossing voor onbepaalde tijd niet door? Sluit het dossier door stoppen passeren door te geven en stuur te zijner tijd een nieuw verzoek in met een nieuw ECH zaaknummer. Vervallen van een dossier aan SCW zijde Wanneer sprake is van een afkeuring door het SCW dan blijft het SCW-dossier maximaal 3 maanden actief. Na deze periode wordt het SCW-dossier opgeschoond en zullen eventuele wijzigingen niet verwerkt worden. Stuur dan een nieuw verzoek in met een nieuw ECH zaaknummer. Akkoord royement Ongeveer 5 werkdagen nadat we het af te lossen bedrag hebben ontvangen krijgt u een akkoord voor het royement. Was de hypotheek al ingelost, dan ontvangt u samen met de volmacht het bericht dat wij geen vorderingen meer hebben. Het definitieve akkoord ontvangt u in dat geval +/- 5 werkdagen voor de aangegeven passeerdatum. Aandachtspunten Het SCW behandelt royementsverzoeken vanaf 3-4 weken voor passeerdatum van het royement. Dit betekent dat u een eventuele reactie op uw royementsverzoek vanaf deze termijn kunt verwachten. Voor zakelijke royementsdossiers wordt het ECH dossier gesloten en vindt de verdere afhandeling van het royement op papier en niet via ECH plaats. U ontvangt van de afdeling Bedrijven een aflosnota of een brief waarin royement om niet wordt verleend. Voor eventuele vragen kunt u terecht op het telefoonnummer dat u ontvangt in ons bericht. U kunt inspreken dat u de zakelijke afdeling nodig heeft, zodat u juist wordt doorverbonden . Bankgaranties Rabobank verzendt vanaf 18 maart 2025 de bankgaranties via ECH. De bankgarantie is te raadplegen via de ECH-webapplicatie. Voor meer informatie omtrent het bankgarantieproces kunt u deze FAQ raadplegen. LET OP! Een deel van de bankgaranties ontvangt u ook na 18 maart 2025 per post. Het is niet mogelijk om een per post ontvangen bankgarantie via ECH in te zien of te corrigeren. Voor vragen of opmerkingen over de gestelde bankgarantie kunt u contact opnemen met SCW: 088-728 87 28. Het nummer is op werkdagen bereikbaar van 8.30 uur tot 16.30 uur. LET OP dit telefoonnummer is alleen bedoeld voor de notaris, het SCW behandelt geen klantvragen. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:08:12Z",
  "source": "ech.nl"
}