{
  "id": "40296f104ea74ff3dba20b18b51680d8c3a7891b",
  "url": "https://www.ech.nl/hypothecair-financiers/",
  "title": "Voor hypothecair financiers | ECH",
  "text": "Voor hypothecair financiers | ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Voor hypothecair financiers Alle informatie voor hypothecair financiers Je zet ECH in voor het goed regelen van processen rondom het passeren en royeren van hypotheken en het versturen van bankgaranties. ECH levert een kwalitatief communicatiemiddel voor banken en notariskantoren en maakt daarbij gebruik van de standaarden die met elkaar zijn afgesproken. Dit doen we niet: een backoffice bieden waar fysieke hypotheekdossiers worden uitgewerkt. Zie ECH als hét toonaangevende Nederlandse platform dat dient als digitale brievenbus voor het uitwisselen van alle gegevens tussen notarissen en banken. 0 % van de Nederlandse notarissen is aangesloten bij ECH. Veilig & betrouwbaar ECH geldt als dé digitale brievenbus voor de communicatie tussen notarissen en hypothecair financiers. Het ECH-systeem ontvangt berichten met daarin privacygevoelige informatie. Al deze berichten worden (tijdelijk) bewaard in de database van de stichting. De ECH applicatie draait op het notariële Platform Elektronische Communicatie (PEC) van de Koninklijke Notariële Beroepsorganisatie. Uiteraard voldoet dit platform volledig aan de eisen die de Europese privacywet GDPR  stelt. info@ech.nl 070 330 7135 Vragen? Neem contact met ons op. Zaakinhoudelijke vragen over een dossier? Neem contact op met de betrokken notaris. Technische vragen over de werking van het systeem? Neem contact op met de functioneel beheerder van je bank. Aansluiten bij ECH of overige vragen? Neem contact op met de servicedesk ECH. Softwareleveranciers Wij werken graag samen met deze partijen Het passeren (vestigen) en aflossen (royeren) van een hypotheek verloopt in één keer juist, eenvoudig én razendsnel dankzij de integratie met alle soorten softwarepakketten van onderstaande partijen waar we graag mee samenwerken. Deze softwareleveranciers bieden een standaardoplossing voor communicatie met ECH en dat vergemakkelijkt het proces van aansluiting. Bovendien certificeren wij de maatwerkimplementatie bij de desbetreffende bank, verzekeraar of serviceorganisatie. info@topicus.nl 0570 662 662 Meer over Topicus info@ohpen.com 020 72 21 000 Meer over Ohpen Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:08:36Z",
  "source": "ech.nl"
}