{
  "id": "4117ce65fd8187b99ba689db9d53383f6b02f0b7",
  "url": "https://www.ech.nl/notarissen/dcmf/",
  "title": "Dutch Commercial Mortgage Finance - ECH",
  "text": "Dutch Commercial Mortgage Finance - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Dutch Commercial Mortgage Finance (DCMF) Proces: Passeren E-mail: beheer@dcmf.nl Telefoon: 088-6006853 01 Nieuwsberichten 02 Passeren Deelnemersinfo Dutch Commercial Mortgage Finance (DCMF) Algemene informatie/nieuwsberichten (kort) DCMF Welkom bij Dutch Commercial Mortgage Finance (DCMF) , een nieuwe aanbieder van financieringen voor professionele beleggers in vastgoed. Wij zijn gespecialiseerd in het verstrekken van hypothecaire overbruggingsleningen voor (commercieel) vastgoed dat wordt getransformeerd naar vastgoed met een woonbestemming en verhuur hypotheken voor de zakelijke markt. Notarisinstructie passeer proces Passeerproces Het beheer van de hypotheken is door DCMF uitbesteed aan BCMGlobal. Voor het passeren van nieuwe hypotheken wordt er gebruik gemaakt van ECH. Nadat de lening door DCMF akkoord is gegeven, wordt de passeeropdracht door BCMGlobal via ECH aan u verzonden. Hierin zijn ook de bijbehorende notarisinstructies opgenomen. BCMGlobal ontvangt de passeerdatum minimaal 3 werkdagen voor de daadwerkelijke datum van passeren. De sluitnota wordt uiterlijk 2 dagen voor passeren door BCMGlobal aan u verzonden. Op het uit te keren bedrag worden, in geval er sprake is van een bouwdepot, de bouwdepotkosten in mindering gebracht. Wij verzoeken u om BCMGlobal ná het passeren van de hypotheek binnen drie dagen de passeerbevestiging, een afschrift van de hypotheekakte met voetverklaring inclusief inschrijvingsbewijs te doen toekomen. Toelichting DCMF is onderdeel van Pontifex Bridge Financing BV .; Wij kunnen de volgende documenttype ontvangen: PDF; De maximale documentgrootte is 20MB. Vragen en opmerkingen Uw mening is belangrijk. Indien u tips, opmerkingen of verbeteringen heeft, kun u die ons laten weten via onderstaande contactgegevens. Contact Voor vragen zijn we bereikbaar op telefoonnummer 088-6006853 . U kunt ons bellen van maandag tot en met vrijdag van 8.30 uur tot 17.00 uur. U kunt ook een e-mail sturen naar beheer@dcmf.nl . Notarisinstructie royementenproces Aflosnota’s en royementsverzoeken kunt u opvragen door een email te sturen naar beheer@dcmf.nl Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:37:14Z",
  "source": "ech.nl"
}