{
  "id": "413329e23b7162123cd323a4acf7370d9ba33f26",
  "url": "https://www.ech.nl/notarissen/solidbriq/",
  "title": "SolidBriQ - ECH",
  "text": "SolidBriQ - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: SolidBriQ Proces: Passeren E-mail: beheer@solidbriq.nl Telefoon: 085 – 8200 002 01 Nieuwsberichten 02 Passeren 03 Royeren Deelnemersinfo SolidBriQ Algemene informatie/nieuwsberichten (kort) Welkom bij SolidBriQ. SolidBriQ biedt hypothecaire financieringen aan voor professionele vastgoedbeleggers, gespecialiseerd in hypotheken voor te verhuren woningen en appartementen in Nederland. SolidBriQ B.V. staat bij de kamer van koophandel ingeschreven onder nummer 77196511. Notarisinstructie passeer proces Passeerproces Passeren nieuwe hypotheken SolidBriQ gebruikt ECH voor het passeren van nieuwe hypotheken. Uitgangspunten: Kenmerk maatschappij is dossiernummer. Wij kunnen de volgende documenttypen ontvangen: doc, docx, pdf en rtf. De maximale documentgrootte is 20MB. Passeeropdracht Na finaal akkoord van de lening sturen wij via ECH een bericht naar u als notaris. Aan dit bericht worden de volgende bijlagen toegevoegd: De definitieve offerte. De algemene voorwaarden. We verzoeken u vriendelijk om de getekende definitieve lening overeenkomst en de algemene voorwaarden te hechten aan de minuut van de akte. Passeerdatum De passeergegevens dienen minimaal 3 werkdagen voor passeerdatum in ons bezit te zijn. Indien er binnen 3 werkdagen gepasseerd moet worden dient u contact met ons op te nemen via onderstaande contactgegevens. Sluitnota De sluitnota wordt uiterlijk 2 werkdagen voor passeren aan u verstrekt en zoveel eerder als mogelijk. We willen u vragen contact met ons op te nemen als u 2 werkdagen voor passeerdatum nog geen sluitnota van ons heeft ontvangen. Eventuele kosten worden in mindering gebracht op het te verstrekken leningbedrag. Het bouwdepot zal nooit worden uitgekeerd bij het passeren van de hypotheekakte. Passeerbevestiging Wij verzoeken u binnen drie dagen na passeren een afschrift van de hypotheekakte met notarisverklaring inclusief inschrijvingsrelaas te verstrekken. De leningovereenkomst hoeft niet aan ons teruggestuurd te worden. Vragen en opmerkingen Uw mening is belangrijk. Als u tips, opmerkingen of verbeteringen heeft, laat ze ons weten! U kunt ons bereiken via onderstaande gegevens. Contact Voor vragen zijn we bereikbaar op telefoonnummer 085-8200002. U kunt ons bellen van maandag tot en met vrijdag van 9.00 uur tot 17.00 uur. U kunt ook een e-mail sturen naar beheer@solidbriq.nl Notarisinstructie r oyementenproces Royementenproces Royementsverzoeken Royementsverzoeken kunnen opgevraagd worden via: beheer@solidbriq.nl . Opvragen aflosnota Aflosnota’s kunnen opgevraagd worden via: beheer@solidbriq.nl . Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:11:19Z",
  "source": "ech.nl"
}