{
  "id": "431d8d97dd7737edb3a7707de086e3d5ed6fa5b7",
  "url": "https://www.ech.nl/faq/",
  "title": "FAQ - ECH",
  "text": "FAQ - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Veelgestelde vragen Algemeen Wat zijn de deadlines voor het afhandelen van een ECH-zaak? De berichtenstandaard van ECH kent vaste deadlines voor het versturen van berichten in het royeer- en passeerproces. Deze deadlines zijn ook terug te vinden in de takenlijst van de betreffende zaak in ECH. Royeren Royeren Notaris Hypothecair financier Verzoek royement Vanaf 2 maanden tot uiterlijk 15 werkdagen vóór royeren Aflosnota* 5 werkdagen vóór royeren Getekende royementsvolmacht 5 werkdagen vóór royeren Akkoord royement 10 werkdagen ná royeren* * Bij royement ‘om niet’ wordt binnen ECH in principe géén aflosnota verstuurd. In plaats daarvan volgt uiterlijk 5 werkdagen vóór aflosdatum het bericht ‘akkoord royement’. Uit dit bericht blijkt dat aan alle voorwaarden, zoals gesteld in de royementsvolmacht, is voldaan. Passeren Passeren Hypothecair financier Notaris Passeeropdracht 10 werkdagen vóór passeren Melden passeergegevens 6 werkdagen vóór passeren Melden gelden 3 werkdagen vóór passeren Sluitnota 2 werkdagen vóór passeren Passeerbevestiging 3 werkdagen ná passeren De Rabobank hanteert een afwijkend proces: Passeren (Rabobank) Hypothecair financier Notaris Voorlopige Passeeropdracht 10 werkdagen vóór passeren Melden passeergegevens 6 werkdagen vóór passeren Passeeropdracht 5 werkdagen vóór passeren Melden gelden 3 werkdagen vóór passeren Passeerbevestiging 3 werkdagen ná passeren Een afgeronde ECH-zaak staat nog als actief. Wat moet ik hiermee doen? Er kunnen verschillende redenen zijn waarom een ECH-zaak in de actieve zakenlijst blijft staan: U heeft nog niet de passeerbevestiging ingestuurd naar de maatschappij. Het versturen van dit bericht is noodzakelijk voor het afsluiten van de zaak. De zaak zal uit de actieve zakenlijst verdwijnen zodra dit bericht is verstuurd. U heeft nog niet alle ontvangen berichten in deze zaak gelezen/geopend. Indien u dit alsnog doet, zal de zaak uit de actieve zakenlijst verdwijnen. Doet u dit niet? Dan zal de zaak voor de duur van 1 jaar zichtbaar blijven. Een technische storing of fout is hiervan de oorzaak. Neem contact op met de ECH Servicedesk voor assistentie. Waar moet ik op letten als ik in kantoorinstellingen iets  aan wil passen? 1. E-mailadres wijzigen. U kunt het bij ECH bekende e-mailadres wijzigen. Het e-mailadres wordt beschikbaar gesteld aan de op ECH aangesloten maatschappijen om contact met u te zoeken over hypotheekdossiers. Daarnaast ontvangt u op dit adres notificaties en herinneringen, tenzij u ervoor kiest om deze uit te schakelen. Let op! Een wijziging van het e-mailadres bij KNB wordt niet automatisch overgenomen bij ECH. Werk het e-mailadres bij ECH daarom altijd handmatig bij. 2. Rekeningnummer verwijderen. Wilt u controleren of er nog lopende passeerzaken zijn, waarbij het te verwijderen rekeningnummer is opgegeven? Als dit het geval is, dan is het voor de maatschappijen wenselijk om voor die zaken aan te geven wat het gewenste rekeningnummer moet worden waar de gelden naar overgemaakt kunnen worden. 3. Hoe kan ik de link naar de webclient in mijn notificaties verwijderen? U kunt onder het e-mailadres het vinkje bij “Voeg directe link toe naar de desbetreffende zaak in de ECH webapplicatie.” uitvinken. 4. Hoe kan ik mijn herinneringen en of notificaties aan- of uitzetten? De herinneringsmails krijgt u bij een openstaande taak van “Melden gelden” of “Versturen passeerbevestiging” wanneer de deadline binnenkort gaat verlopen. Een notificatiemail krijgt u bij ieder inkomend bericht dat verstuurd is vanuit de maatschappij. De herinneringen en/of notificaties kunt u los van elkaar aan of uit laten zetten. Momenteel kan dat door een mail naar ECH Servicedesk te sturen. In de toekomst kunt u dit zelf beheren als de functionaliteit onder kantoorinstellingen in de webcliënt is opgeleverd. Hoe kan ik een adreswijziging doorgeven bij ECH? Stichting ECH maakt gebruik van de kantoornaam en adresgegevens van notariskantoren zoals opgenomen in de ledenadministratie van de KNB. U hoeft een adreswijziging daarom niet los bij ECH te melden. Adreswijzigingen die zijn opgenomen in de ledenadministratie van de KNB worden uiterlijk de volgende werkdag automatisch verwerkt in ECH. De op ECH aangesloten banken verwerken deze wijzigingen kort daarna in hun eigen administratie. Geeft u een wijziging van het e-mailadres van uw kantoor door bij de KNB? Zorg er dan voor dat u deze wijziging óók doorvoert bij ECH. De e-mailadressen worden namelijk niet automatisch overgenomen van KNB. Hoe gaat ECH om met notariskantoren met meerdere vestigingen? Heeft uw kantoor meerdere vestigingen? Als deze vestigingen zijn opgenomen in de ledenadministratie van de KNB dan zijn deze vestigingen ook bij ECH bekend. Het is belangrijk om aan te geven hoe u met ECH wilt werken op deze andere vestiging(en). Zo kunt u kiezen voor aparte ECH-aansluiting(en) op deze vestiging(en). Ontvangt u passeeropdrachten liever op één vestiging? Dan kunt u bij ECH verzoeken om een ‘aansluitnummer’ in te stellen. Hiermee wordt bij hypothecair financiers duidelijk gemaakt dat passeerzaken moeten worden verstuurd aan de ECH-aansluiting die u prefereert. Ontvangt u regelmatig passeeropdrachten buiten ECH? Dan kan het zijn dat het aansluitnummer nog niet is ingesteld bij uw nevenvestiging. Neem in dat geval contact op met de Servicedesk van ECH. Welke feestdagen worden door stichting ECH niet als werkdagen gezien bij het bepalen van een deadline? Stichting ECH ziet wettelijk erkende feestdagen niet als werkdagen. Deze dagen tellen niet mee als werkbare dag voor het bepalen van de deadline. Het gaat om de volgende dagen: Nieuwjaarsdag GoedeVrijdag Pasen Koningsdag Dag van de Arbeid Bevrijdingsdag Hemelvaartsdag Pinksteren Kerstmis Door het wettelijk besluit gelijkstelling wordt vrijdag 30 mei 2025 binnen het Notariaat als een vrije dag beschouwd en telt daarmee ook niet mee in de bepaling van de deadline. Welke bestandstypen worden door de hypothecair financiers geaccepteerd als bijlage? Binnen ECH is het mogelijk een bijlage te versturen (van en naar hypothecair financiers). Stichting ECH houdt bij welke bestandstypen per hypothecair financier kunnen worden ontvangen: Aegon | PDF Allianz | PDF Argenta | PDF ASN Bank | DOC, DOCX, PDF & RTF Attens | PDF BLG Wonen | DOC, DOCX, PDF & RTF Brug Financieringen | PDF Build | PDF Casarion | PDF Centraal Beheer | PDF Centraal Beheer (voorheen Woonfonds) | PDF Clarian Wonen | PDF Coöperatieve Rabobank U.A. | PDF DCMF | PDF De Nederlandse | PDF Holland Woont | PDF Hypotrust | PDF ING Bank N.V. | PDF Impact Hypotheken | PDF IQWOON | PDF Merius Hypotheken | PDF Nationale Nederlanden | PDF Nestr Smart Finance | PDF Quion | PDF RegioBank | DOC, DOCX, PDF & RTF RNHB | DOC, DOCX, PDF & RTF Robuust Hypotheken | PDF SNS Bank | DOC, DOCX, PDF & RTF Solidbriq | PDF Syntrus Achmea | PDF Tellius | PDF Vista Hypotheken B.V. | PDF Woonnu | PDF Waarvoor is het bericht “Melden Wijziging” binnen ECH? Het bericht “Melden Wijziging” gebruikt u om de andere partij te vragen een wijziging door te voeren in een verzonden bericht. Dit bericht is te gebruiken door het notariskantoor en de maatschappij. Dit bericht wordt gebruikt als veilig communicatiemiddel tussen het notariskantoor en de maatschappij. Het is daarom van belang dat u de wijzigingsberichten altijd leest. Waarvoor is het bericht “Stoppen Proces” binnen ECH? Het bericht “Stoppen Proces” kan door een maatschappij en door een notariskantoor worden verstuurd. Met dit bericht wordt de ECH-zaak definitief stopgezet. Dit bericht dient dus niet te worden gebruikt voor zaken die worden uitgesteld! Er kunnen verschillende oorzaken zijn voor het stoppen van de ECH-zaak: Indien er een “Verzoek Aflosnota” is verstuurd naar een verkeerde maatschappij Indien er een passeeropdracht is verstuurd naar een verkeerd notariskantoor Indien de zaak niet verder via ECH afgehandeld kan worden. Het bericht “Stoppen Proces” bevat altijd een reden voor het beëindigen van de ECH-zaak. Zijn er gevolgen voor de notariële dienstverlening ingeval van schorsing of ontzetting? Bij schorsing van een notaris of ontzetting uit het ambt zorgt de rechter voor een waarnemer. Hiermee wordt de continuïteit van de notariële dienstverlening gegarandeerd, ook in lopende (hypotheek-)dossiers. Informatie over schorsingen en ontzettingen is op de publiekswebsite van de KNB in een actueel overzicht beschikbaar: https://www.notaris.nl/page/het-opvolgersarchief . De waarnemend notaris is het eerste aanspreekpunt bij vragen over lopende dossiers. Een schorsing dan wel ontzetting heeft geen gevolgen voor de ECH aansluiting. ECH kent overigens geen aangesloten notarissen, maar notariskantoren. Zolang de vestiging in het register voor het notariaat (dat wordt bijgehouden door de KNB) als ‘actief’ wordt aangemerkt, blijft de aansluiting in ECH ook ‘open’ staan. ECH zal zelf een aansluiting niet sluiten, dat kan alleen als de waarnemer daar een valide reden voor heeft en om verzoekt. Omdat de notariële dienstverlening gegarandeerd is door benoeming van een waarnemer, met inbegrip van de verzekering van diens werkzaamheden, is er geen verhoogd risico bij de uitboeking van gelden. Onderzoekt ECH de herkomst van gelden? Stichting ECH controleert niet de herkomst van hypotheekgelden. Regelmatig ontvangt ECH vragen van notarissen over de eisen die ECH stelt aan de hypothecair financiers die van het ECH-platform gebruik maken. ECH faciliteert het berichtenverkeer tussen hypothecair financiers en het notariaat zonder een oordeel te vormen over de financiering of de herkomst van gelden. Net als bij hypotheekdossiers die buiten ECH worden afgehandeld, blijft u ook bij ECH-dossiers volledig verantwoordelijk voor de controles op dossierinhoud en voor de Wet ter voorkoming van witwassen en financieren van terrorisme (Wwft). De op ECH aangesloten financiers vallen niet per definitie onder DNB- en/of AFM-toezicht dan wel de Wwft. Dit heeft mogelijk gevolgen voor de Wwft-controles die u moet uitvoeren. Royeerproces Moet ik bij een algehele doorhaling ook onderpanden opgeven? Bij een algehele doorhaling is het niet verplicht om de onderpanden (lees: adresgegevens en de kadastrale omschrijving) op te geven. Wij adviseren echter om de onderpanden wél op te geven. Het is voor maatschappijen dan mogelijk om sneller de juiste lening en leningdelen op te zoeken. Hierdoor kan de aflosnota tijdig worden opgemaakt. Hoe wijzig ik de aflosdatum van een ECH-afloszaak? Ga voor het wijzigen van een afloszaak naar Taken. Vervolgens klikt u achter “Aflosopdracht en Royementsvolmacht” op de knop “ Wijzig ” en gaat u naar het veld “Verzoek Aflosnota”. Daar wijzigt u de datum en kunt u het bericht opnieuw versturen. De maatschappij zal, indien van toepassing, een nieuwe aflosnota voor u agenderen. Hoelang van tevoren mag ik een aflosverzoek indienen? De afgesproken aanlevertermijn voor het verzoek royement is tussen 2 maanden en 15 werkdagen voor de aflosdatum. Een verzoek kan echter wel eerder of later ingediend worden als dat noodzakelijk is. Het is echter niet mogelijk om een royementsverzoek eerder dan 6 maanden voor aflossing in te dienen. Welke royeerreden moet ik selecteren? Het opnemen van de juiste royeerreden in het aflosverzoek is in het belang van de cliënt, de hypothecair financier en de notaris. Het verzoek kan sneller en beter verwerkt worden en de cliënt ontvangt de juiste aflosnota met eventuele vergoeding voor vervroegde royering. In onderstaande tabel kunt u lezen welke aflosreden er in welke situatie gekozen dient te worden. Bij twijfel kunt u contact opnemen met de betreffende hypothecair financier. Download het overzicht royeerredenen hier in PDF, of zie het overzicht hieronder. Overzicht reden royeren Keuze in ECH Situaties Verkoop onderpand Verkoop en levering aan een derde met geheel royement. Verkoop gedeelte van het onderpand Verkoop en levering aan een derde met gedeeltelijk royement van een gedeelte van het onderpand . Bijvoorbeeld na splitsing van het kadastrale perceel of na (onder-)splitsing in appartementsrechten. Verkoop van 1 vastgoed van het onderpand Verkoop aan een derde bij gedeeltelijk royement. Verdeling na (echt)scheiding met interne herfinanciering Toedeling en levering na uit elkaar gaan van samenwonenden of na ontbinding huwelijk/geregistreerd partnerschap. Nieuwe hypotheek bij dezelfde hypotheekhouder als de huidige hypotheekhouder. Verdeling na (echt)scheiding met externe oversluiting Toedeling en levering na uit elkaar gaan van samenwonenden of na ontbinding huwelijk/geregistreerd partnerschap. Nieuwe hypotheek bij andere hypotheekhouder dan de huidige hypotheekhouder. Oversluiten hypotheek bij huidige financier Eigendomssituatie ongewijzigd. Nieuwe hypotheek bij dezelfde hypotheekhouder als de huidige hypotheekhouder. Oversluiten hypotheek bij andere financier Eigendomssituatie ongewijzigd. Nieuwe hypotheek bij andere hypotheekhouder dan de huidige hypotheekhouder. Einde looptijd hypotheek Eigendomssituatie ongewijzigd. Aflossing via de notaris met geheel royement. Geen aflossing, aflosdatum = fictieve datum Eigendomssituatie ongewijzigd. Geheel royement om niet. Executieveiling Verkoop aan een derde na executieveiling. Overig Levering van een onverdeeld aandeel aan een (van de) mede-eigena(a)r(en). Andere uitzonderlijke en bijzondere situaties die hierboven niet zijn genoemd. Meerdere royementen voor dezelfde maatschappij Soms moeten er voor één transactie (verkoop, oversluiting, etc.) meerdere hypotheken van dezelfde hypothecair financier geroyeerd worden. Bijvoorbeeld een overbrugginshypotheek naast de oorspronkelijke hypotheek. Die royementen kunnen binnen ECH gecombineerd worden in één royementsvolmacht/ECH-zaak. Het is ook mogelijk om die royementen in separate royementsvolmachten/ECH-zaken op te nemen. De manier waarop de notaris het verzoek moet samenstellen is per hypothecair financier verschillend. In onderstaande tabel is per hypothecair financier aangegeven of er een gecombineerd verzoek ingediend moet worden of juist separate verzoeken. Hypothecair financier Indienen AEGON Bij voorkeur in separate ECH-zaak. ING Bank Combineren in één ECH-zaak. Nationale-Nederlanden In separate ECH-zaak. Quion Overbruggingshypotheek in separate ECH-zaak. Anders gecombineerd in één ECH-zaak. Rabobank Combineren in één ECH-zaak. Volksbank Combineren in één ECH-zaak. Hoe verwerk ik een verzekeringspolis die afgekocht moet worden in de afloszaak? U kunt in het verzoek aflosnota bij de entiteit Verzekering aangeven of er aan de hypotheek nog verpande polissen zijn gekoppeld en of deze bij het aflossen dienen te worden afgekocht. Deze entiteit kunt u ook gebruiken om aan te geven of er een (bank)spaarrekening of een beleggingsrekening moet worden afgekocht. Gebruik dan de keuze “ overig ” bij soort verzekering. Komt u er na het verzenden van het verzoek aflosnota erachter dat er nog één of meerdere polissen moeten worden afgekocht? Open de ECH-zaak via de lijst met actieve afloszaken. Klik op “ Taken ” , klik vervolgens achter “Aflosopdracht en Royementsvolmacht” op de knop “ Wijzig ” . U kunt dan alsnog de polissen opgeven. Hoe wijzig ik de Royementsvolmacht van de ECH-afloszaak? De royementsvolmacht wordt opgemaakt aan de hand van de door u ingevoerde gegevens. De volmacht is daarmee een exacte weergaven van uw input. ECH dwingt af dat de volmacht pas kan worden meegezonden als deze als laatste stap in het proces is aangemaakt. Hierdoor kunnen er geen inhoudelijke afwijkingen tussen de volmacht en de ingevoerde gegevens ontstaan. Iedere aanpassing in de zaak leidt per definitie tot een nieuwe volmacht. De volmacht kan niet handmatig worden gewijzigd. U wijzigt de volmacht bij “Taken” Klik achter “Aflosopdracht en Royementsvolmacht” op de knop Wijzig. Daarna kunt u naar het betreffende veld gaan om de wijziging aan te brengen om vervolgens een nieuwe Royementsvolmacht te genereren. Hoe weet ik dat de aflossing in één of meerdere betalingen moet geschieden? Een belangrijke voorwaarde voor een algeheel royement is uiteraard dat alle leningdelen die onder het hypotheekrecht vallen geheel worden afgelost. De bijkomende vraag is hoe de notaris herkent of die aflossing dan in één of meerdere betalingen moet geschieden? Als er sprake is van meerdere hypotheken, dan kan een maatschappij deze elk afzonderlijk opnemen in de aflosnota die via ECH wordt verstuurd. Hierdoor is het voor de debiteur duidelijk welke hypotheken er worden afgelost en wat per hypotheek de specificatie van het te betalen bedrag is. Voor de debiteur is het daardoor gemakkelijk om de opgave te controleren aan de hand van diens eigen administratie. In alle jaaropgaven en online hypotheekdossiers zijn immers ook de diverse hypotheken separaat opgenomen. In de aflosnota kan voor elke hypotheek separaat het (sub)totaalbedrag, de IBAN en het betalingskenmerk worden vermeld. Hieraan kan de notaris gemakkelijk herkennen of de overboeking van de aflossing uiteindelijk in één of meerdere betalingen moet plaatsvinden. Geeft een maatschappij aparte betalingskenmerken mee? Zorg er dan in ieder geval voor dat u de betalingen ook daadwerkelijk apart verricht. Het combineren van betalingen met verschillende betalingskenmerken leidt tot administratieve problemen. Passeerproces Waarom krijg ik als notaris de melding dat de actie “Melden Gelden” niet is uit te voeren? Er is eerder aangegeven dat er geen specifieke gelden opgevraagd gaan worden (bij het bericht “Melden Passeergegevens”). Dit is de reden dat ECH de mogelijkheid voor het melden van gelden blokkeert (en een rood kruis weergeeft). Dit is te herstellen door de zaak te openen en naar “Taken” te gaan. U kunt nu bij “Melden Passeergegevens” aangeven dat u het bericht wilt wijzigen. Na het aangeven dat u een specifiek bedrag nodig heeft, kunt u het bericht bewaren en opnieuw verzenden. Nu is het bericht “Melden Gelden” weer te gebruiken in deze zaak. Bij de hypotheekgegevens staan meerdere hypotheekrechten, hoe moet ik die instructie verwerken? Meerdere hypotheekrechten dienen bij één hypotheekakte gevestigd te worden. Een afschrift van deze akte schrijft u ook als geheel in bij het kadaster (dus níet 2x een uittreksel). Het van het Kadaster ontvangen deel en nummer kunt u via het bericht Passeerbevestiging doorgeven aan de hypothecair financier. Wanneer kan ik gebruik maken van de nieuwe functies? Dat hangt af van de applicatie die u gebruikt: de webapplicatie op Notarisnet vanaf 15 juni 2018; de applicatie in uw eigen kantoorsoftware; zodra uw leverancier dat aangeeft. Let op! Wij raden u aan om zaken niet met verschillende applicaties af te handelen. Het bericht Bewaardersverklaring heet voortaan Passeerbevestiging. De datum van passeren is toegevoegd. Het afschrift van de hypotheekakte en een losse notarisverklaring zijn verplicht als bijlage toegevoegd. De kortingsregeling voor het tijdig versturen is niet gewijzigd. Hoe kan ik een afspraak annuleren? U kunt gebruik maken van de knop “annuleren afspraak”. Deze staat bij Passeergegevens nadat u eerder passeergegevens hebt verzonden. Hoe kan ik het afschrift van de hypotheekakte en de notarisverklaring meesturen? Elektronisch afschrift Als een zaak via de laatste versie van ECH wordt afgehandeld, moet een elektronisch afschrift van de hypotheekakte worden meegezonden. Het sturen van een papieren afschrift is dan niet meer nodig. De voordelen van het verstrekken van een elektronisch afschrift ten opzichte van papieren afschriften zijn onder meer: kostenbesparing papier en porto; snellere ontvangst; zodra het wordt verzonden wordt het ook ontvangen; logging; aantoonbaar verzonden en ontvangen; gemak; een afschrift voor meerdere partijen geschikt. Om een elektronisch afschrift te maken moet het afschrift in pdf/A formaat worden voorzien van een gekwalificeerde elektronische handtekening. Voor het ‘zetten’ van een dergelijke handtekening heeft de notaris speciale software nodig. Een afschrift dat eenmaal is voorzien van een gekwalificeerde elektronische handtekening kan meerdere keren worden verzonden aan verschillende partijen. Binnen ECH wordt de digitale handtekening al ondersteund via het PADES-formaat. In dat geval zal gebruik worden gemaakt van een nieuwere versie van pdf/A-bestanden (pdf/A-2u, pdf/A-2a, pdf/A-3u, PDF/A-3a). In de CDR-applicatie is deze software geïntegreerd en maakt de notaris van elke akte een elektronisch afschrift. Door hiervan gebruik te maken hoeft de notaris geen aparte software te installeren. Ook hoeft de notaris maar één keer het afschrift te ‘ondertekenen’. Als u van ECH gebruikmaakt door middel van een notarieel softwarepakket, zal uw software zorgdragen voor het klaarzetten van het juiste (reeds ondertekende) elektronische afschrift bij het versturen van de passeerbevestiging. Het gebruik van een notarieel softwarepakket biedt in dat geval extra voordeel. Notarisverklaring Het digitale afschrift van de hypotheekakte dat middels de CDR-applicatie is gemaakt bevat echter geen notarisverklaring. Daarom is binnen ECH afgesproken dat gebruik wordt gemaakt van een losse notarisverklaring, die moet worden meegezonden met de Passeerbevestiging. Omdat het een losse verklaring betreft is het noodzakelijk om de notarisverklaring te koppelen aan het afschrift waar deze betrekking op heeft. Dat is binnen ECH op twee manieren geborgd. Er kan maar één afschrift en één notarisverklaring worden verzonden in een bericht. Hierdoor is duidelijk dat de notarisverklaring bij dat afschrift hoort. Bovendien bevat de ECH-versie (in aanvulling op de reguliere notarisverklaring) een tekstuele verwijzing naar het afschrift van de akte. U wordt geacht de notarisverklaring volgens het ECH-model op te stellen. De notarisverklaring hoeft niet te worden voorzien van een gekwalificeerde elektronische handtekening. Het verzenden van de notarisverklaring binnen ECH leidt (net zoals bijvoorbeeld de royementsvolmacht) tot dwingend bewijs. De notarisverklaring kan voor elke zaak specifiek worden opgesteld, maar dat hoeft niet. Als u voor elke notaris of combinatie van waarnemer – notaris een notarisverklaring maakt en deze op een centrale locatie opslaat, kan bij het verzenden van de Passeerbevestiging de juiste notarisverklaring eenvoudig gekozen worden. U dient zelf te regelen dat de notarisverklaring die wordt verzonden in een ECH-zaak de persoon vermeldt die bevoegd is om die verklaring af te leggen. Het ondertekende afschrift is te vinden door uw repertorium in te zien in uw notariële softwarepakket of via notarisnet (zie paragraaf 5.14.1 van de handleiding ). De notarisverklaring stelt u zelf op volgens het ECH model notarisverklaring . U vult de namen en standplaats in van de (kandidaat-)notaris die de verklaring aflegt. Vervolgens maakt u hier een pdf-bestand van. Wanneer moet ik gebruikmaken van Melden Gelden? In het passeerproces van ECH dient u als notaris in het bericht ‘Melden Passeergegevens’ aan te geven of u wel of niet de op te vragen gelden specificeert. Maar wist u al dat de hypothecair financier in de Passeeropdracht aangeeft of zij de benodigde gelden gespecificeerd wil ontvangen? Indien de hypothecair financier het niet nodig acht om de gelden gespecificeerd te ontvangen, dan hoeft u de ‘Melden Gelden’ niet te versturen. U kunt dan in de ‘Melden Passeergegevens’ aangeven dat u het beschikbare bedrag nodig heeft. Hiermee komt de taak ‘Melden Gelden’ te vervallen en voorkomt u dat de hypothecair financier op dit bericht moet wachten, zij kan direct de Sluitnota versturen. Dit versnelt het gehele passeerproces! Bankgarantieproces Waarom kan ik de garantie niet behandelen vanuit mijn softwarepakket? Zolang dit proces niet is geïntegreerd in uw softwarepakket, kunt u gebruik maken van de ECH-webapplicatie. Neem hiervoor contact op met uw leverancier. Waarom bevat de garantie geen handtekening? Het garantiebericht dat via ECH aan de notaris wordt gestuurd, voldoet aan de bepalingen van een fysieke garantie en aan het verstrekken/afgeven daarvan. Voor de volledige juridische onderbouwing kan contact opgenomen worden met de Servicedesk van ECH. Kan een Bankgarantiezaak gestopt worden? Nee, dat kan niet. En dat is ook niet nodig. Nadat de garantie verzonden is via ECH, is de zaak afgerond. Bovendien is de afgegeven garantie onherroepelijk. Hoe kan ik een noodzakelijke wijziging aanvragen? In het Bankgarantieproces is het niet mogelijk om een wijzigingsbericht te sturen. U kunt telefonisch of via email een wijziging aanvragen bij de instantie die de garantie heeft afgegeven. Wat moet ik doen als de garantie onjuiste gegevens bevat? Als de notaris constateert dat de garantie onjuiste gegevens bevat, dan dient die buiten ECH om contact op te nemen met de maatschappij. De garantie kan dan wel met de juiste gegevens binnen dezelfde ECH-zaak opnieuw verzonden worden. Daar zijn geen extra kosten aan verbonden. Hoe kan de garantie aan een andere notaris afgegeven worden? Als de garantie aan een andere notaris moet worden gestuurd, dan dient de hypothecair financier een nieuwe ECH-zaak te starten met die andere notaris. De eerste notaris moet op de hoogte worden gesteld dat de garantie aan een andere notaris is gestuurd. De ‘onjuiste’ ECH-zaak wordt na verloop van tijd automatisch verwijderd. Hoe kan de garantie toegezonden worden als de notaris een hoofd- en nevenvestiging heeft? Als de notaris via een hoofdvestiging (ook wel ‘aansluitnummer’) ECH-berichten ontvangt, dan is de hypothecair financier ervoor verantwoordelijk dat de passerende notaris in de garantie als begunstigde is vermeld en dat het bericht wordt afgeleverd in de postbus van de hoofdvestiging. Kan de geldigheid van de garantie verlengd worden als dat nodig is? Als de geldigheid van de garantie verlengd moet worden, dan dient de notaris buiten ECH om contact op te nemen met de hypothecair financier. De garantie kan dan met de nieuwe einddatum binnen dezelfde ECH-zaak opnieuw verzonden worden. Daar zijn geen extra kosten aan verbonden. Hoe kan ik de garantie inroepen? Het inroepen van een garantie is niet mogelijk via ECH. In het garantiedocument staat op welke wijze u deze kunt inroepen. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:02:20Z",
  "source": "ech.nl"
}