{
  "id": "43876d0a1a8da9cc3644aa22887c5383626645e2",
  "url": "https://www.ech.nl/syntrus-achmea-hypotheken-en-attens-hypotheken-moderniseren-hypotheekproces-en-sluiten-aan-op-ech/",
  "title": "Syntrus Achmea hypotheken en Attens hypotheken moderniseren hypotheekproces en sluiten aan op ECH - ECH",
  "text": "Syntrus Achmea hypotheken en Attens hypotheken moderniseren hypotheekproces en sluiten aan op ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Syntrus Achmea hypotheken en Attens hypotheken moderniseren hypotheekproces en sluiten aan op ECH / Nieuws / Door Ruby Syntrus Achmea en Attens sluiten op korte termijn aan op het passeerproces van elektronische communicatie hypotheken (ECH). Vanaf 1 juli kunt u de eerste passeerinstructie via ECH verwachten. Met het afhandelen van passeerzaken via ECH zetten Syntrus Achmea hypotheken en Attens hypotheken de volgende stap in het moderniseren van het hypotheekproces. Hugo ouwehand, director hypotheken Syntrus Achmea real estate & finance: “ECH is de logische volgende stap in het verder automatiseren van onze processen. Het is dus absoluut een mooie aanvulling op onze dienstverlening.” Lisa huisman, directeur stichting ECH, is blij met de aansluiting: “we zijn er trots op Syntrus Achmea en Attens te mogen verwelkomen bij ECH. Het snel, efficiënt en veilig kunnen bedienen van de klant staat bij beide organisaties hoog in het vaandel. We kijken uit naar de samenwerking!” ECH zet zich in voor een volledig digitale, eenduidige en betrouwbare samenwerking tussen het notariaat en de hypothecair financiers. Er wordt continu gewerkt aan een verbetering van de processen en het voldoen aan de europese wet- en regelgeving op het gebied van veiligheid en privacy. Meer informatie Voor het notariaat zijn notarisinstructies opgesteld die zijn gepubliceerd op de website van ECH. Deze instructies voor Syntrus Achmea kunt u hier vinden en de instructies voor Attens hier . Bij vragen over dit nieuwsbericht kunnen notariskantoren zich wenden tot de servicedesk van stichting ECH. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:40:01Z",
  "source": "ech.nl"
}