{
  "id": "486ad6b779ab4928b0d28d35b0ef3106bf7efe78",
  "url": "https://www.ech.nl/nextassyst-implementeert-nieuwe-webservice-voor-pdf-berichten/",
  "title": "NextAssyst implementeert nieuwe webservice voor PDF-berichten - ECH",
  "text": "NextAssyst implementeert nieuwe webservice voor PDF-berichten - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X NextAssyst implementeert nieuwe webservice voor PDF-berichten / Nieuws / Door Ruby Stichting ECH heeft recentelijk een webservice ontwikkeld waarmee XML-berichten op de ECH server worden omgezet naar een leesbaar PDF-formaat. Middels deze nieuwe webservice kunnen PDF’s sneller worden aangepast waardoor notariskantoren hiervan onmiddellijk kunnen profiteren. Het notariële softwarepakket “NextAssyst” vande firma Devoon maakt als eerste gebruik van deze webservice. In de afgelopen jaren heeft Stichting ECH altijd PDF-templates verstrekt aan de aangesloten notariële softwareleveranciers.De softwareleveranciers implementeren deze templates in haar software en rollen deze daarna uit onder haar kantoren. Het doorvoeren van een dergelijke wijziging kost veel tijd en dat zal niet meer het geval zijn wanneer er gebruik wordt gemaakt van deze nieuwe webservice. Met de introductie van de nieuwe webservice, zullen PDF-templates centraal worden beheerd door Stichting ECH en zullen wijzigingen sneller worden doorgevoerd zonder dat de notariële softwareleverancier daar iets voor hoeft te doen. Het in gebruik nemen van deze webservice gebeurt onder toezicht van Stichting ECH. Voordat de nieuwe webservice in gebruik genomen mag worden door de notariële softwareleverancier, zal de implementatie hiervan eerst getest worden met Stichting ECH. Maakt u gebruik van een notariële softwarepakket en wilt u weten of uw pakket al gebruik maakt van deze webservice? Neem dan contact op met uw notariële softwareleverancier. Klik hier voor een overzicht van alle notariële softwarepakketten die zijn aangesloten op ECH. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:25:03Z",
  "source": "ech.nl"
}