{
  "id": "4a77351b0f54cbcf41e0398bbaec69ec99511043",
  "url": "https://www.ech.nl/aankondiging-ech-gebruikersdag-2019/",
  "title": "Aankondiging ECH gebruikersdag 2019 - ECH",
  "text": "Aankondiging ECH gebruikersdag 2019 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Aankondiging ECH gebruikersdag 2019 / Gebruikersdag , Nieuws / Door Ruby Ieder jaar organiseert stichting ECH voor al haar deelnemers en geïnteresseerde partijen de gebruikersdag. Het betreft daarbij zowel deelnemers uit het notariaat als medewerkers van de aangesloten hypothecair financiers. Ook de notariële softwareleveranciers zijn op deze dag van harte welkom.via deze weg willen wij u informeren over de gebruikersdag die dit jaar zal plaatsvinden op donderdag 26 september 2019! Het thema van deze middag zal zijn ‘dialoog in de hypotheekketen’. Bankenmarkt Wij nodigen u graag uit om met elkaar de dialoog aan te gaan over alle zaken die betrekking hebben op de samenwerking tussen het notariaat en de hypothecair financiers. Daarom organiseren we dit jaar de ‘ECH bankenmarkt’. Op deze manier kunnen het notariaat en de geldverstrekkers met elkaar het gesprek aangaan over het verder verbeteren van de wederzijdse dienstverlening met als doel een optimale klantbeleving. Mocht uit de gebruikersdag blijken dat er behoefte is om bepaalde onderwerpen meer in detail te bespreken dan kunnen deze worden aangedragen voor de werkgroepen. Uiteraard praten we u op deze dag ook bij over de ontwikkelingen bij stichting ECH. Denk daarbij aan nieuw aansluitende partijen, cijfers, financiën en security alsmede de toekomstige ontwikkelingen. Inschrijven en agenda Wij ontvangen u graag op donderdag 26 september vanaf 12.30 uur. Graag verzoeken wij u zich voor 31 augustus 2019 in te schrijven via www.ECH.nl/gebruikersdag . De definitieve agenda volgt zo spoedig mogelijk. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:03:49Z",
  "source": "ech.nl"
}