{
  "id": "4a90b0e9f60ed5974e2cd521ac62f8e79d142ef0",
  "url": "https://www.ech.nl/notarissen/aegon/",
  "title": "Aegon - ECH",
  "text": "Aegon - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Aegon Levensverzekering N.V. Proces: Passeren & Royeren E-mail: – Telefoon: 058 244 3400 01 Nieuwsberichten 02 Passeren 03 Royeren Deelnemersinfo Aegon Algemene informatie/nieuwsberichten (kort) Informatie inzake overgang Aegon naar ASR Meer informatie over de overgang van Aegon naar ASR en daarmee het gebruik van ECH en E-notaris, vindt u hier . Geldigheid van de (proforma)aflosnota Vanaf maandag 20 januari 2025 is de geldigheid van de (proforma)aflosnota aangepast van 14 dagen naar 7 dagen . Hierdoor versturen wij de (proforma)aflosnota voortaan uiterlijk een week voor passeren toe. Wij vragen u nog steeds om drie weken aan te houden bij het opvragen van een (proforma)aflosnota. Periode voor berekeningsdatum aflossingskosten ingekort Door onze overgang naar ECH kunnen wij de periode tussen de geplande aflosdatum en de berekeningsdatum van de aflossingskosten bij oversluiten ook inkorten. Daarom is deze termijn verkort naar één week in plaats van de eerdere twee weken. Dit betekent dat de aflosnota’s vier werkdagen voor de geplande aflosdatum voor u klaarstaan. Dit is altijd in de ochtend. Ons proces bij verkoop verandert niet. Geen aparte depotaktes\nmeer aanmaken Per 22 februari 2022 gelden er nieuwe algemene voorwaarden , hierdoor is het niet langer noodzakelijk\nom een aparte depotakte te maken. Het komt de komende tijd voor dat er nog wel\neen aparte depotakte moet worden gemaakt. Dit zijn nog dossiers met oudere\nvoorwaarden. Notarisinstructie passeerproces Passeerproces (Voorlopige) passeeropdracht Melden passeergegevens Sluitnota/Passeeropdracht Melden gelden Passeerbevestiging Aandachtspunten maatschappij Melden Gelden Aan de hand van de bijlage “concept afrekening” bepaalt Aegon wat het bouw- of rentedepot bedrag is. In het bericht “melden passeergegevens” graag “Melden Gelden” als niet van toepassing indiceren. Uitstellen passeren Indien 1 dag voor de passeerdatum of op de passeerdatum blijkt dat het passeren niet doorgaat gelieve telefonisch contact opnemen met de Service Desk Hypotheken (058 244 3400) Hogere rangorde overbruggingskrediet Aegon gaat altijd akkoord met het verzoek voor een hogere rangorde, hiervoor hoeft u geen toestemming te vragen voorbeeld: Aegon geeft in de invulinstructie door dat er een derde hypothecaire inschrijving op het overbruggingspand dient te komen. Uit kadasterrecherche blijkt dat er slechts 1 inschrijving op het overbruggingspand zit. In dat geval hoeft u voor de hogere (tweede i.p.v. derde) inschrijving geen expliciete toestemming te vragen bij Aegon. Aanvullende instructie aflossen krediet Staat er in het passeerbericht dat er een krediet afgelost wordt bij passeren? U kunt de gegevens hiervoor opvragen bij de tussenpersoon of de klant. Doorgeven wijzigingsverzoek / vragen toestemming U kunt wijzigingen doorgeven in een ECH-wijzigingsbericht. Ook kunt u verzoeken met betrekking tot toestemming kwijt in een ECH-wijzigingsbericht. In dat geval zal Aegon het verzoek in behandeling nemen. Bouwdepot In het geval van nieuwbouw gaan wij uit van de koop-aanneemovereenkomst en houden wij altijd de aanneemsom en het meerwerk in het bouwdepot. Indien er aannemingstermijnen verstreken zijn dient u dit op te nemen in de nota van afrekening en de nota mee te sturen. Aan de hand van deze nota van afrekening bepalen wij het uiteindelijke bouwdepotbedrag. Contact over passeerproces U kunt contact opnemen met Service Desk Hypotheken, 058 244 3400 Notarisinstructie royeerproces Verzoek aflosnota U kunt bij ons aflosverzoeken indienen voor zowel Aegon Levensverzekering NV (en rechtsvoorgangers) als Aegon Hypotheken BV. Goed om te doen: controleer altijd aan de hand van de hypotheekakte of u het aflosverzoek bij de juiste geldverstrekker indient. Interne verpanden zekerheden Vaak is het mogelijk om de afkoopwaarde van de verpande kapitaalverzekering, beleggingsverzekering, spaarpolis, bankspaarrekening of beleggingsrekening te verrekenen op de aflosnota. Vermeld in het aflosverzoek dat er verrekend moet worden. Externe zekerheden Wij verrekenen geen externe polissen met de openstaande hypotheek. Tijdstip opvragen Natuurlijk proberen we alle aflosnota’s op tijd aan te leveren. We vragen u daarom om het verzoek aflosnota uiterlijk 15 werkdagen voor de geplande aflosdatum in te dienen. Verzoeken die u meer dan zes maanden voor de aflosdatum indient, neemt Aegon niet in behandeling. Vestiging van twee hypotheekrechten in één akte In het verleden gebruikte AEGON een specifieke constructie voor overbruggingen en hogere inschrijvingen. Er werden twee hypotheekrechten in één hypotheekakte gevestigd. De verwerking bij het Kadaster gebeurde op verschillende manieren, afhankelijk van de wijze waarop de notaris de akte ter inschrijving werd aangeboden. Werden er twee uittreksels ter inschrijving aangeboden, dan kreeg elk hypotheekrecht een eigen deel en nummer. Werd er één uittreksel aangeboden, dan kregen beide hypotheekrechten hetzelfde deel en nummer. Volmacht en verzoek royement ECH heeft het mogelijk gemaakt om het royement voor deze beide hypotheekrechten in één verzoek in te dienen bij AEGON. In de royementsvolmacht worden beide inschrijvingen genoemd, beide aangevuld met het inschrijvingsbedrag. Hierdoor is het duidelijker dat het om twee aparte hypotheekrechten gaat. Op basis van deze volmacht kunt u AEGON vertegenwoordigen voor de ondertekening van de royementsakte waarin beide inschrijvingen worden doorgehaald. Royementsakte Op basis van de via ECH ontvangen royementsvolmacht bepaalt u zelf de redactie van de royementsakte. Let er daarbij op dat de royementsakte op de juiste wijze door het Kadaster verwerkt kan worden! Akkoord royement Uiterlijk 10 werkdagen nadat aan de betalingsverplichting is voldaan, ontvangt u van ons het bericht ‘Akkoord Royement’. Nadat u dit bericht heeft ontvangen, kunt u de doorhaling van de hypothecaire inschrijving verzorgen. Overbrugging Een verzoek tot aflossing van een overbrugging dient u in door te kiezen voor aflosreden “Verkoop van 1 vastgoed van het onderpand”. Wij hebben het deel en nummer van het overbruggingspand niet in onze administratie staan. Wij vragen u daarom het hypotheeknummer van het overbruggingskrediet op te nemen in het opmerkingenveld. Daarnaast brengen wij op de aflosnota geen dagrente in rekening, wij verrekenen dit bij de klant in de maandelijkse termijn. U ziet dus altijd een bedrag van €0,00. Gebruik opmerkingenveld Wij vragen u het opmerkingenveld alleen te gebruiken als dit echt noodzakelijk is, zoals bij een overbrugging. Het om andere redenen vullen van het opmerkingenveld leidt tot vertraging in de verwerking van uw verzoek. Aflosnota Op de aflosnota vermelden wij het betalingskenmerk en IBAN, waar u het af te lossen bedrag op overmaakt. Maak de betalingen separaat van elkaar over als wij meerdere betalingskenmerken opgeven. Dan loopt de financiële afwikkeling geen vertraging op en kan het akkoord royement tijdig worden afgegeven. Wijziging aflosdatum (eerder of later passeren) U mag bij een aflosnota maximaal 2 weken dagrente bijtellen of aftrekken. Is deze periode langer? Dan ontvangen wij graag de nieuwe aflosdatum via een gewijzigd aflosverzoek in ECH. Ook als u al een aflosnota van ons heeft ontvangen. Nog niet alle verzoeken via ECH mogelijk Voor onderstaande verzoeken gebruikt u ons webformulier op Aegon.nl. Zodra u kiest voor de aflosreden “Verkoop gedeelte van het onderpand” of voor “Executieveiling”, dan ontvangt u van Aegon een stoppenbericht. –          Gedeeltelijk royement; –           Hoofdelijk ontslag; –           Wijzigen zekerheden (bijv. in geval van wijziging splitsingsakte, recht van overpad); –          Toestemming inschrijving overbrugging / tweede of hogere hypotheek bij een andere financier. Contact over royeerproces Heeft u zaakinhoudelijke vragen over een dossier? Neem contact op met de AEGON Service Desk Hypotheken 058 244 66 50, Optie 1. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:05:23Z",
  "source": "ech.nl"
}