{
  "id": "4d577caf3ff70dc0b15615eb03743f0afe1a5f2d",
  "url": "https://www.ech.nl/rabobank-tijdslijnen-rondom-feestdagen-2023/",
  "title": "Rabobank: Tijdslijnen rondom feestdagen - ECH",
  "text": "Rabobank: Tijdslijnen rondom feestdagen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Rabobank: Tijdslijnen rondom feestdagen / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Inleiding Rabobank hanteert rondom de komende feestdagen de reguliere aanlevertermijnen voor passeren en royeren. Om te waarborgen dat alle zaken tijdig kunnen worden verwerkt, vragen we nadrukkelijk om zaken waarvan de (passeer)datum bekend is zo snel mogelijk door te geven. Op die manier kunnen de werkzaamheden zo goed mogelijk gepland worden zodat zaken met een kortere doorlooptijd ook tijdig kunnen worden afgewikkeld. Om dit jaar nog alle verzoeken tijdig af te kunnen wikkelen, wordt zéér terughoudend om gegaan met het in behandeling nemen van spoeddossiers. Tijdslijnen Royeren Royementsverzoeken dienen, conform de reguliere termijn, ten minste 15 werkdagen voor royementsdatum te worden doorgegeven. Op een aantal feestdagen is Rabobank gesloten, hier moet rekening mee worden gehouden bij het tijdig aanleveren van de verzoeken. Hieronder staan voorbeelden waarin rekening is gehouden met de feestdagen waarop de Rabobank gesloten is (Eerste en tweede paasdag, Koningsdag, Hemelvaartsdag, Eerste en tweede pinksterdag): Stuurt de notaris het royementsverzoek met aflosdatum dinsdag 2 mei? Dan moet het verzoek uiterlijk vrijdag 7 april bij ons binnen zijn; Stuurt de notaris het royementsverzoek met aflosdatum woensdag 7 juni? Dan moet het verzoek uiterlijk maandag 15 mei bij ons binnen zijn; Indien u onderstaande bericht ontvangt via ECH naar aanleiding van een aangeleverd royementsverzoek, dan is er sprake van een zakelijk royement: “Het verzoek betreft een zakelijk royement en wordt verder op papier afgehandeld. Voor meer informatie kunt u contact opnemen met ons zakelijk team Klantenservice op telefoonnummer 088 – 722 6666”. Voor zakelijke royementsdossiers wordt het ECH dossier gesloten en vindt de verdere afhandeling van het royement niet via ECH plaats. U ontvangt van de afdeling Bedrijven een aflosnota of een brief waarin royement om niet verleend wordt. Tijdslijnen passeren Passeerverzoeken dienen, conform de reguliere termijn, ten minste 2 werkdagen voor passeren te worden doorgegeven. Zodat Rabobank de gelden minimaal 1 werkdag voor passeren kan overmaken.  Op een aantal feestdagen is Rabobank gesloten en/of is er geen betalingsverkeer mogelijk, daarom gelden de volgende afwijkende aanleverdata: In verband met Goede Vrijdag/Pasen : Passeert de klant op dinsdag 11 april? Dan dient de notaris uiterlijk woensdag 5 april 12:00 uur de passeerdatum door te geven. In verband met 2 e Paasdag : Passeert de klant op woensdag 12 april? Dan dient de notaris uiterlijk donderdag 6 april 12:00 uur de passeerdatum door te geven. In verband met Koningsdag/Dag van de Arbeid : Passeert de klant op maandag of dinsdag 2 mei? Dan dient de notaris uiterlijk woensdag 26 april 12:00 uur de passeerdatum door te geven. Passeert de klant op woensdag 3 mei? Dan dient de notaris uiterlijk vrijdag 28 april 12:00 uur de passeerdatum door te geven. In verband met Hemelvaart : Passeert de klant maandag 22 mei? Dan dient de notaris uiterlijk woensdag 17 mei 12:00 uur de passeerdatum door te geven. In verband met 2 e Pinksterdag : Passeert de klant woensdag 31 mei? Dan dient de notaris uiterlijk vrijdag 26 mei 12:00 uur de passeerdatum door te geven. Bereikbaarheid Service Centrum Wonen Het Service Centrum Wonen is op Goede Vrijdag (vrijdag 7 april), Dag van de Arbeid (maandag 1 mei) en Bevrijdingsdag (vrijdag 5 mei) regulier bereikbaar. Op alle andere feestdagen zijn wij gesloten. Meer informatie Voor vragen of andere informatie aangaande dit artikel kan contact worden opgenomen met Rabobank Service Center Wonen via de gebruikelijke methode. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:38:59Z",
  "source": "ech.nl"
}