{
  "id": "4e60e47991956067ac1f1b21469165b6b5edec20",
  "url": "https://www.ech.nl/start-ai-traject-stichting-ech/",
  "title": "ECH start AI-traject in samenwerking met Macaw - ECH",
  "text": "ECH start AI-traject in samenwerking met Macaw - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH start AI-traject in samenwerking met Macaw / Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door echadmin Artificial Intelligence (AI) is door ECH benoemd als een van de strategische pijlers en opgenomen als aparte track binnen het changeprogramma. Om inzicht te krijgen in de kansen van AI – zowel op interne processen als binnen de keten – is een scan uitgezet. Na een uitgebreide en zorgvuldig selectieprocedure met meerdere organisaties is Macaw gekozen als strategisch partner om dit traject gezamenlijk vorm te geven. De officiële kick-off vond afgelopen dinsdag, 1 april, plaats op het kantoor van Macaw. Tijdens deze bijeenkomst volgden de betrokkenen een interactieve AI-masterclass, gericht op kennisdeling en om samen eerste ideeën over mogelijke toepassingsmogelijkheden te vormen. De sessie werd enthousiast ontvangen door alle interne stakeholders. Met vertegenwoordigers van het Bestuur, de Raad van Advies, het Ontwikkelteam en het ECH-team zijn we het traject sterk gestart. We kregen een inkijk in de meest recente ontwikkelingen op het gebied van AI, zoals de snelle evolutie van Large Language Models en de inzet van AI-agents. We onderzochten welke kansen deze technologieën bieden voor organisaties en hoe ze concreet ingezet kunnen worden binnen bedrijfsprocessen. Diverse use cases maakten de toepassingen tastbaar en lieten zien hoe voorlopers in andere sectoren AI al effectief gebruiken. Tot slot werkten we in teamverband aan de eerste ideeën voor mogelijke AI-toepassingen binnen ECH; de voorstellen waren uiteenlopend en sloten aan bij alle drie de horizonnen. Horizon 1 richt zich op kernactiviteiten en korte termijn (1–3 jaar); Horizon 2 op opkomende kansen en middellange termijn (2–5 jaar); en Horizon 3 op innovatie en lange termijn (5–12 jaar). Hoe deze ideeën verder worden uitgewerkt? Wordt vervolgd! We kijken terug op een inspirerende en veelbelovende start van dit traject. Dank aan Macaw en alle deelnemers voor de energie en betrokkenheid. Samen zetten we de volgende stap richting een AI-gedreven toekomst. Meer informatie Wil je meer weten over de dienstverlening van ECH? Laat het ons weten via info@ech.nl . Samen bouwen we aan de toekomst van ECH! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:09:41Z",
  "source": "ech.nl"
}