{
  "id": "4f446d6913e66d4a7133c12fa3038417f8625e8e",
  "url": "https://www.ech.nl/controle-op-onherroepelijkheid-omgevingsvergunning/",
  "title": "Controle op onherroepelijkheid omgevingsvergunning - ECH",
  "text": "Controle op onherroepelijkheid omgevingsvergunning - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Controle op onherroepelijkheid omgevingsvergunning / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Rabobank vindt het belangrijk dat de controle op de onherroepelijkheid van de omgevingsvergunning zo goed mogelijk wordt uitgevoerd. In dit controleproces vertrouwen wij graag op de expertise en kunde van het notariaat. Daarom vraagt de Rabobank per 1 januari 2023 aan notarissen om voortaan deze controle uit te voeren alvorens de hypotheekakte te passeren. In alle nieuwbouwdossiers wordt de volgende verplichte aanvullende instructie opgenomen: “ Passeren hypotheekakte kan slechts plaatsvinden als u heeft vastgesteld dat er een onherroepelijke omgevingsvergunning is afgegeven. Stel dit bij voorkeur vast voor het maken van de passeerafspraak”. Wij verzoeken u vriendelijk om deze controle zo vroeg mogelijk in het rechercheproces uit te voeren om uitstel/afstel van passeren te voorkomen. Heeft u vragen naar aanleiding van dit bericht, dan kunt u via mail contact opnemen met: fm.nl.its.tribe.wonen.aa.verantwoord.financieren@rabobank.nl ter attentie van Fenna Jacobs. Meer informatie Wil je meer weten over of heb je algemene vragen voor ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:00:13Z",
  "source": "ech.nl"
}