{
  "id": "4fdf91f334eca3bac86606a1d42d6cd0a663e31d",
  "url": "https://www.ech.nl/nieuwe-hypotheekakte-voor-nationale-nederlanden/",
  "title": "Nieuwe hypotheekakte voor Nationale-Nederlanden - ECH",
  "text": "Nieuwe hypotheekakte voor Nationale-Nederlanden - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Nieuwe hypotheekakte voor Nationale-Nederlanden / Nieuws / Door Ruby Nationale-Nederlanden heeft haar hypotheekakte vernieuwd. In de nieuwe akte (Versie HYNNB00) is alleen nog informatie opgenomen die noodzakelijk is voor de zekerheidsstelling van de hypotheek. Ook voldoet de nieuwe akte aan het model voor een KIK-akte en kan hierdoor automatisch worden ingelezen bij de inschrijving in het Kadaster. Dit was een grote wens vanuit het notariaat, zodat u hypotheken van Nationale-Nederlanden beter kunt verwerken en de akte tegen een voordeliger tarief kunt inschrijven in het Kadaster. De invulinstructie voor de nieuwe hypotheekakte is ook gewijzigd. De nieuwe invulinstructie vindt u, zoals u gewend bent, in de passeeropdracht. Let op: Voor de invulinstructie gelden een aantal aandachtspunten. Meer informatie vindt u hier . Hypotheekofferte opslaan in uw archief U ontvangt bij een passeeropdracht van Nationale-Nederlanden met de nieuwe hypotheekakte ook de hypotheekofferte. Deze hypotheekofferte hoeft bij het passeren niet te worden getekend of retour te worden gestuurd, maar u dient deze hypotheekofferte wel samen met de hypotheekakte op te slaan in uw archief. Let op: Tijdelijk kan het voor komen dat klanten nog dienen te passeren met de oude hypotheekakte (Versie 2018-4). In de passeeropdracht staat vermeld of de nieuwe of de oude versie van de hypotheekakte van toepassing is. Het is belangrijk dat u de juiste versie van de hypotheekakte gebruikt. Meer informatie U vindt meer over het passeren van Nationale-Nederlanden hypotheken op deze pagina . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:36:18Z",
  "source": "ech.nl"
}