{
  "id": "502549719f8a9e97394b484d697d3591d8d6dd39",
  "url": "https://www.ech.nl/ech-effectief-efficient-en-uniform-remco-van-der-kuijp-notaris/",
  "title": "‘ECH: effectief, efficiënt en uniform’, Remco van der Kuijp, notaris - ECH",
  "text": "‘ECH: effectief, efficiënt en uniform’, Remco van der Kuijp, notaris - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘ECH: effectief, efficiënt en uniform’, Remco van der Kuijp, notaris / Bestuur , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Ik ben eind 2013 toegetreden tot het bestuur van de KNB en al snel werd ik penningmeester. Het is gebruikelijk dat er iemand van het KNB-bestuur in het bestuur zit bij ECH. Toen een lid daarvan afscheid nam in 2016 heb ik zijn plaats ingenomen.’ Dat zegt Remco van der Kuijp , notaris bij Van der Kuijp Notariaat Strijen. ‘Ik heb verschillende mijlpalen meegemaakt en één daarvan ging over het financiële stuk. Toen ik net bij ECH startte bevond de stichting zich aan het eind van een uitdagende periode. Stichting ECH heeft namelijk geen winstoogmerk en de initiële investering heeft een lange terugverdientijd gekend. Er moest een spreekwoordelijk vliegwiel gaan draaien om het tij te keren. En dat lukte waardoor we in een financieel gezonde situatie terecht zijn gekomen. Dat hebben we onder meer bereikt door heel aandachtig te kijken naar waar we heen wilden en hoe we dat wilden bereiken. Tegelijkertijd werden de aantallen die door de pijplijn heen gingen ook steeds groter.’ Remco van Kuijp, notaris bij Van der Kuijp notarissen Strijen Succes dankzij collectief karakter ‘Toen ik het bestuur in 2020 verliet, verkeerde de stichting in een uitstekende situatie en dat is met recht een collectieve bijdrage geweest. Een speciale vermelding voor Lisa Huisman en Floris Beerens is overigens wel op zijn plaats. Mede dankzij hun gedrevenheid en enthousiasme sluiten er nog altijd meer hypothecair financiers aan. En dat is mooi in een flink gegroeide hypotheekmarkt. De trouwe kern van klanten is continue bij de stichting gebleven. Dat zegt wat volgens mij. De volgende mijlpaal waar we ons op richtten was die van digitalisering. Omdat het inmiddels zo goed ging met ECH ontstond er ruimte voor andere gesprekken. Kort samengevat kun je zeggen dat we 10 jaar lang op allerlei manieren flink hebben geïnvesteerd. En dat heeft zich in de afgelopen 5 jaar uitbetaald.’ ECH: effectief, efficiënt en uniform ‘Wanneer ik denk aan ECH, dan denk ik vooral aan termen als effectief, efficiënt en uniform. Effectief zijn is altijd het streven geweest, of het nu ging om een eenvoudige of complexe aanpassing maakte daarbij niet uit. Zolang het maar het gewenste effect bereikte. Uitgangspunt was én is steeds het gemak van de klant’, aldus Remco. ‘Efficiënt gaat dan vooral over het ontlasten en ontzorgen van de partijen in de keten. Van klant tot bank tot notaris. De tijdlijn wordt nog altijd efficiënter en het hele proces steeds prettiger voor de betrokken ketenpartners en daarmee de eindgebruiker. Uniform tot slot, gaat vooral over zo eenduidig mogelijk werken. Uiteindelijk wil je naar straight-through processing (STP) toe door zoveel mogelijk gebruik te maken van gestructureerde data. In de ideale situatie komt de informatie uit het systeem bijna automatisch in de akte bij de notaris terecht. En vice versa.’ Uniforme digitale berichtenstroom ‘Inmiddels is 99% van de notarissen aangesloten. Dat is aantrekkelijk voor hypothecair financiers. ECH levert het beste proces in de uniforme, digitale berichtenstroom richting de notaris. En dat kenmerkt meteen het DNA van ECH waarbij blijven werken aan effectiviteit, security, efficiency en andere gerichte acties de boventoon voert’, vindt Remco. ‘Sterk is dat in het bestuur en de Raad van Advies gebruikers aanwezig zijn. De lijnen zijn dan ook kort en er is een sterke betrokkenheid. Dat maakt de wensen uit de markt duidelijk. Alle betrokkenen uit de markt zijn constant bezig om de pijplijn zo goed mogelijk werkend te houden én verder te verbeteren. Naast het vestigen en royeren van hypotheken kan ECH in de toekomst wellicht andere communicatiestromen in de keten standaardiseren, denk dan aan het bankgarantie-proces of ontslag hoofdelijke aansprakelijkheid bij echtscheiding. Kortom, ECH heeft de wind in de zeilen. Ik vind het mooi dat ik mijn steentje heb mogen bijdragen aan een solide fundering voor de toekomst.’ Meer informatie Wil je meer weten over de de visie van Remco van der Kuijp of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:21:25Z",
  "source": "ech.nl"
}