{
  "id": "50d92d4a9a51ad56222800e6fd46c2c3b6dcb954",
  "url": "https://www.ech.nl/notarisdossier-pro-start-met-ech-integratie/",
  "title": "Notarisdossier Pro start met ECH-integratie - ECH",
  "text": "Notarisdossier Pro start met ECH-integratie - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Notarisdossier Pro start met ECH-integratie / Nieuws / Door Ruby Het notariële softwarepakket Notarisdossier Pro beschikt sinds deze maand over een volledige ECH-integratie. Via de applicatie zijn alle voor de notaris relevante berichten in te zien en te versturen. Dat de integratie er zou komen is nooit een vraag geweest. Rob van Weeghel (directeur): “Notarisdossier is een modern softwarepakket met een open structuur. Wij hebben koppelingen met alle relevante registers. ECH biedt functionaliteit die logischerwijs onderdeel is van onze software.” Dankzij de integratie van ECH binnen Notarisdossier pro kunnen notariskantoren die de software gebruiken direct vanaf de zaak gegevens versturen. Gegevens van cliënten en objecten worden automatisch ingevuld. Dat scheelt tijd en voorkomt typfouten. De kantoren die met ECH werken zijn enthousiast. “In ons vorige systeem hadden we ook ECH zitten, maar dat moest ik apart opstarten en was niet overzichtelijk. Nu heb ik alle berichten duidelijk bij de zaak staan. Dit is echt makkelijk.” Aldus één van de gebruikers die vandaag gestart is met ECH. De afgelopen tijd is er hard gebouwd aan ECH. Doordat de module gecertificeerd moest worden had het ontwikkelteam van Dirict een strakke deadline. Toch zijn er geen compromissen gesloten. Luc Busser, ontwikkelaar bij Dirict: “We hebben een gebruiksvriendelijk ontwerp gemaakt waar iedere medewerker van een notariskantoor mee overweg kan. Het was een flinke klus maar we zijn trots op het eindresultaat.” De komende tijd gaan de ontwikkelaars zich richten op meer nieuwe functionaliteit waar klanten van Dirict graag mee starten. Nu de ECH-module helemaal gecertificeerd is hebben de ontwikkelaars daar weer tijd voor. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:05:17Z",
  "source": "ech.nl"
}