{
  "id": "512ccd7623740d10f7433fefd04a420cbfaa05f4",
  "url": "https://www.ech.nl/privacy-statement-ondersteuning-ech/",
  "title": "Privacy statement ECH - ECH",
  "text": "Privacy statement ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Privacy Statement ECH Stichting ECH verwerkt persoonsgegevens van u doordat u: Zich heeft aangemeld voor de ECH Nieuwsbrief; Zich heeft aangemeld voor een ECH bijeenkomst; Medewerker of vertegenwoordiger bent van een Aangesloten hypothecair financier Aangesloten servicer Aangesloten notariskantoor Als niet aangesloten partij contact met ons hebt opgenomen. Contactgegevens Stichting ECH Stichting ECH Aan de afdeling Privacy Spui 184 2511 BW Den Haag Telefoon: 070-3307201 E-mail: privacy@ech.nl Website: www.ech.nl Persoonsgegevens die worden verwerkt Stichting ECH verwerkt in geval (1 of 2) u zich heeft aangemeld voor de ECH Nieuwsbrief of een ECH bijeenkomst, de volgende gegevens: Mailadres Voor- en achternaam Evt. organisatie waarvoor u werkt Evt. geboortedatum Evt. klik-historie Stichting ECH verwerkt in geval (3 of 4) u medewerker of vertegenwoordiger bent van een hypothecair financier, een servicer, een notariskantoor of een niet aangesloten partij die contact met ECH heeft opgenomen, één of meerdere van de volgende gegevens: Voor- en achternaam Geslacht Gegevens werkgever Contactgegevens waaronder (zakelijk) e-mail en (zakelijk) telefoonnummer Gegevens over uw activiteiten op de internetapplicatie van ECH Internetbrowser en apparaat type Bijzondere en/of gevoelige persoonsgegevens die worden verwerkt Stichting ECH verwerkt geen bijzondere en/of gevoelige persoonsgegevens van u. Verwerkingsdoeleinden Stichting ECH verwerkt uw persoonsgegevens voor de volgende doelen: In geval (1): het doel hiervan is het kunnen versturen van de ECH Nieuwsbrief aan degenen die zich hiervoor hebben aangemeld. In geval (2): het doel hiervan is het kunnen organiseren van bijeenkomsten voor degenen die zich hiervoor hebben aangemeld. In geval (3): het doel hiervan is het naleven van de overeenkomsten tussen Stichting ECH en de hypothecair financiers of notariskantoren, waaronder het verzorgen van de facturatie van de afgenomen diensten en het bieden van ondersteuning bij, vragen over of verkoop van de dienstverlening van Stichting ECH. In geval (4): het doel hiervan is het kunnen opvolgen van het contactverzoek. Grondslag gegevensverwerking In geval (1): het versturen van de nieuwsbrief aan geïnteresseerden. Het verwerken van deze persoonsgegevens heeft als grondslag toestemming. In geval (2): registratie voor bijeenkomsten georganiseerd door Stichting ECH. De grondslag hiervoor is: toestemming. In geval (3): het uitvoeren van de overeenkomst tussen de hypothecair financier of notariskantoor en Stichting ECH, waarbij eerstgenoemde verwerkingsverantwoordelijke (partij die bepaalt waarom en hoe uw persoonsgegevens verwerkt worden) is en Stichting ECH optreedt als verwerker (een partij die uitsluitend in opdracht van de verwerkingsverantwoordelijke uw persoonsgegevens verwerkt); of indien de hypothecair financier gebruik maakt van een zogenaamde ‘servicer’, dan is deze laatstgenoemde verwerker en treedt ECH op als sub-verwerker. De grondslagen hiervoor zijn: toestemming, overeenkomst, wettelijke verplichting. In geval (3): facturatie van de door u afgenomen diensten. De grondslagen hiervoor zijn: toestemming, overeenkomst, wettelijke verplichting. In geval (3): communicatie m.b.t. ondersteuning bij / vragen over / verkoop van de dienstverlening van Stichting ECH. De grondslagen hiervoor zijn: toestemming, overeenkomst, wettelijke verplichting. In geval (4): contact met niet aangesloten partij. De grondslag hiervoor is: toestemming. Hoe verkrijgt Stichting ECH uw gegevens? In geval (1): uw gegevens worden door u verstrekt op het moment dat u zich aanmeldt voor de ECH Nieuwsbrief. Indien u deze nieuwsbrief wenst te ontvangen, dan bent u verplicht deze gegevens te verstrekken. In geval (2): uw gegevens worden door u of uw werkgever verstrekt aan Stichting ECH. Indien u wenst deel te nemen aan een bijeenkomst, dan bent u verplicht deze gegevens te verstrekken. In geval (3): uw gegevens worden door u of uw werkgever verstrekt aan Stichting ECH. U bent niet verplicht deze gegevens te verstrekken, maar dat kan tot gevolg hebben dat u uw rol binnen uw organisatie niet (afdoende) kunt vervullen. In geval (4): uw gegevens worden door u verstrekt op het moment dat u contact zoekt met Stichting ECH. U bent niet verplicht uw gegevens te verstrekken, maar indien u uw gegevens niet (volledig) verstrekt, dan kan ECH uw contactverzoek wellicht niet (volledig) opvolgen. Automatische besluitvorming en profilering Bij Stichting ECH is geen sprake van automatische besluitvorming of profilering op basis van de persoonsgegevens die verkregen zijn. Hoe lang worden uw persoonsgegevens bewaard? Stichting ECH bewaart uw persoonsgegevens niet langer dan strikt nodig is om de doelen te realiseren waarvoor uw gegevens worden verzameld. De volgende bewaartermijnen worden gehanteerd: In geval (1): uw gegevens worden bewaard totdat u zich afmeldt voor de nieuwsbrief. In geval (2): uw gegevens worden bewaard tot een maand na de organisatie van een volgende bijeenkomst. In geval (3): uw gegevens worden bewaard zolang u werkzaam bent bij het bedrijf dat een overeenkomst heeft met Stichting ECH tot maximaal 7 jaar na beëindiging van deze overeenkomst. Als uw gegevens alleen zijn geregistreerd voor bijeenkomsten en evenementen, dan worden uw gegevens ook op verzoek verwijderd. In geval (4): uw gegevens worden bewaard totdat het contact met u naar tevredenheid is afgehandeld. Worden uw persoonsgegevens gedeeld met derden? Stichting ECH deelt uw persoonsgegevens met enkele partijen die worden ingeschakeld om haar dienstverlening te verzorgen, zoals onderaannemers en leveranciers. Met deze partijen heeft Stichting ECH contracten afgesloten die uw privacy waarborgen. Uw gegevens worden altijd opgeslagen binnen de EU. Stichting ECH geeft uw gegevens niet door aan organisaties buiten de EU, ook niet tegen betaling. Stichting ECH is niet voornemens dit beleid te wijzigen tenzij zij daartoe op basis van wet- en/of regelgeving verplicht is, Stichting ECH daartoe genoodzaakt is als gevolg van een rechtszaak en/of in het geval zij dat noodzakelijk acht ter bescherming van haar eigen rechten. Cookies, of vergelijkbare technieken, die worden gebruikt Stichting ECH gebruikt functionele en analytische cookies. Een cookie is een klein tekstbestand dat bij het bezoek aan de internetapplicatie van ECH wordt opgeslagen in de browser van uw computer, tablet of smartphone. Deze cookies zorgen ervoor dat de internetapplicatie van ECH naar behoren werkt en dat bijvoorbeeld uw voorkeursinstellingen onthouden worden. U kunt zich afmelden voor cookies door uw internetbrowser zo in te stellen dat deze geen cookies meer opslaat. Ook kunt u alle informatie die eerder is opgeslagen via de instellingen van uw browser verwijderen. Tevens zet Stichting ECH logging in op haar reguliere dienstverlening. Dit houdt in dat voor ieder bericht dat wordt verzonden, persoonsgegevens van de verzender aangevuld met datum en tijdstip wordt opgeslagen. Deze logging wordt gebruikt om mogelijke procesverbeteringen te signaleren. Gegevens inzien, aanpassen of verwijderen U heeft het recht om uw persoonsgegevens in te zien, te laten corrigeren of te laten verwijderen. Daarnaast heeft u het recht om uw eventuele toestemming voor de gegevensverwerking in te trekken of bezwaar te maken tegen de verwerking van uw persoonsgegevens door Stichting ECH en heeft u het recht op gegevensoverdraagbaarheid. Dat betekent dat u bij Stichting ECH een verzoek kunt indienen om uw persoonsgegevens in een computerbestand naar u of een ander, door u genoemde organisatie, te sturen. In geval (1) kunt u uw gegevens inzien, wijzigen of verwijderen middels de betreffende opties onderaan de nieuwsbrief. Vanzelfsprekend kunt u een verzoek tot inzage, correctie, verwijdering of gegevensoverdracht van uw persoonsgegevens ook sturen naar bovengenoemd (e-mail)adres. In geval (2) kunt u uw gegevens inzien, wijzigen of verwijderen middels de betreffende opties onderaan de bevestigingsmail. Vanzelfsprekend kunt u een verzoek tot inzage, correctie, verwijdering of gegevensoverdracht van uw persoonsgegevens ook sturen naar bovengenoemd (e-mail)adres. In geval (3) kunt u hiervoor zowel telefonisch als per e-mail contact opnemen. Hierop ontvangt u een formulier waarin u exact kunt aangeven wat uw verzoek is. Dit formulier zorgt ervoor dat uw verzoek sneller verwerkt kan worden. In geval (4) kunt u hiervoor zowel telefonisch als per e-mail contact opnemen. Hierop ontvangt u een formulier waarin u exact kunt aangeven wat uw verzoek is. Dit formulier helpt zorgt ervoor dqt uw verzoek sneller verwerkt kan worden. We reageren zo snel mogelijk, maar zeker binnen vier weken, op uw verzoek. Hoe worden uw persoonsgegevens beveiligd? Stichting ECH neemt de bescherming van uw gegevens uiterst serieus en heeft daarom passende maatregelen getroffen om onbevoegde toegang, ongewenste openbaarmaking, ongeoorloofde wijziging, misbruik en/of verlies, tegen te gaan. Voorbeelden hiervan zijn encryptie, toegangscontroles en screening van medewerkers. Heeft u vragen of een klacht? Heeft u een vraag of een klacht dan kunt u contact opnemen met Stichting ECH via bovenstaande contactgegevens. Mocht u na behandeling van uw vraag of klacht niet tevreden zijn, dan kunt u contact opnemen met de privacytoezichthouder. In Nederland is dat de Autoriteit Persoonsgegevens. Versie 2.2; bijgewerkt op 28-11-2024 Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:30:09Z",
  "source": "ech.nl"
}