{
  "id": "51a1adbe99615b4e66be52c60d60c1ac271621b0",
  "url": "https://www.ech.nl/jolanda-de-heer-rabobank-vertelt-over-samenwerking-met-ech/",
  "title": "‘Als een vis in het water binnen het bestuur van ECH’, Jolanda de Heer, leidinggevende binnen Rabobank - ECH",
  "text": "‘Als een vis in het water binnen het bestuur van ECH’, Jolanda de Heer, leidinggevende binnen Rabobank - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Als een vis in het water binnen het bestuur van ECH’, Jolanda de Heer, leidinggevende binnen Rabobank / Bestuur , Nieuws , Referenties banken / Door echadmin ‘Vanuit mijn vak kijk ik vooral naar hoe we kunnen digitaliseren, een groot marktaandeel behouden en daarbij de afdelingen zoveel mogelijk ondersteunen. Het uiteindelijke doel? Onze klanten zo gemakkelijk als kan én uiterst veilig door het aanvraagproces van een financiering leiden. Uiteraard hoort daar zo min mogelijk administratie bij en de digitale brievenbusfunctie van ECH past daarmee helemaal binnen de scope van mijn vak.’ Dat zegt Jolanda de Heer als Area Lead Aanvraag en Afsluiten Hypotheken actief binnen Rabobank én bestuurslid binnen stichting ECH. ‘Digitalisering levert niet alleen snellere doorlooptijden voor de klant op maar vermindert ook het aantal handmatig gemaakte menselijke fouten.’ Jolanda de Heer, Leidinggevende binnen Rabobank. ECH als positieve partner ‘Mijn ervaring met stichting ECH is ronduit positief. Ik ervaar de lijnen als zeer kort, wat blijkt uit het contact dat een van de procesmanagers uit m’n team heeft met bijvoorbeeld een Lisa (directeur) of een Floris (manager operations). We kunnen gewoon even bellen, en daarmee snel schakelen. Daarnaast hebben we ook het gevoel met hen aan de tekentafel te zitten, zoals onlangs nog met een nieuwe release. Daarin zagen we wat gebruikersissues voorbijkomen en binnen een mum van tijd hadden we met ECH een taskforce ingericht en gekeken naar hoe we konden verbeteren met elkaar. Dat heeft snel tot hele goede resultaten geleid. Die proactieve manier van samenwerken vind ik erg fijn, openstaan voor elkaars ideeën en gezamenlijke zaken oplossen, dat past bij mij’, aldus Jolanda. ‘Uiteraard wordt door inzet van ECH ook de notaris zoveel mogelijk ontzorgd en is er binnen de gehele keten een grote honger om het zo goed mogelijk te doen, juist ook voor de klant. Woorden die voor mij bij ECH passen zijn gedegen en betrouwbaar. Daarnaast zijn we ons heel erg bewust van het belang van digitale veiligheid en is afspraak gewoon afspraak.’ ‘Stichting ECH staat voor mij voor betrouwbaar, korte lijnen en afspraak is afspraak’, Jolanda de Heer als Area Lead Aanvraag en Afsluiten Hypotheken actief binnen Rabobank én bestuurslid binnen stichting ECH.’ Succesvol als… ‘Ook voel ik me in mijn bestuursrol als penningmeester als een vis in het water. Ik ben door mijn voorganger in het bestuur gevraagd om toe te treden, omdat hij dit goed bij mij vond passen als persoon en ook bij mijn aandachtsgebied. En inderdaad, vanuit mijn Area vanuit de Rabobank bezien, is ECH een belangrijk onderdeel in de klantreis rondom afhandelen van de hypotheekaanvraag’, zegt Jolanda. ‘Ik hoefde dus niet lang na te denken en was meteen enthousiast. Dat komt ook omdat ik het leuk vind om op een andere wijze een bijdrage te kunnen leveren aan een belangrijke stap binnen de journey van de klant bij het kopen van zijn huis. Daarnaast geldt voor mij persoonlijk dat ik op deze manier mooi ervaring op kan doen als bestuurder in een andere omgeving dan die van de bank. Om zo een bijdrage te leveren. Dit is juist kenmerkend voor Rabobank: meedenken en meewerken aan organisaties en vraagstukken vanuit het zijn van een coöperatie. Vanuit de gedachte dat er vraagstukken zijn die je niet in je eentje kunt oplossen, maar dit een gezamenlijke inspanning en samenwerking eisen. Ik hoop samen met de overige bestuursleden van ECH en de directie een belangrijke bijdrage te leveren aan de invulling van de strategie van de stichting. Doel is daarbij om alle klantzaken waarbij het notariaat en geldverstrekkers betrokken zijn, zo goed mogelijk te faciliteren op een veilige en betrouwbare manier en dat tegen een kostendekkend tarief. Daarnaast hoop ik dat we onze dienstverlening continu kunnen verbeteren op basis van klantenfeedback en de ontwikkelingen in de markt. Het vertrekpunt daarbij is altijd de klantreis en de gebruikerservaring.’ Digitalisering tussen geldverstrekker en notariaat ‘Wanneer jij als financiële dienstverlener bezig bent met de digitale klantreis en je kijkt vervolgens aan het eind van de dag nog richting een hele stapel papierwerk, dan ben je naar mijn idee nog onvoldoende bezig met de behoeften van de klant. Het is goed om je te realiseren dat die geldstroom om een woning aan te kunnen kopen voor de klant feitelijk niet meer dan een noodzakelijk kwaad is, waar de klant zo min mogelijk gedoe van wil hebben. Die klant is immers bezig met het inrichten van zijn woonkamer, het verbouwen van zijn badkamer of het bedenken welke kleur zijn nieuwe keuken gaat krijgen. Daarnaast is een hypotheek afsluiten voor veel mensen niet een dagelijkse bezigheid, het is een spannend moment en daarom is het soepel verlopen van het hele proces heel erg belangrijk. Een samenwerking met ECH kan hierbij een overweging zijn om de klantreis tussen geldverstrekker en notariaat verder te digitaliseren.’ Samenwerking met ECH overwegen? ‘Aan anderen die een samenwerking met ECH overwegen raad ik aan om in te zetten op end-to-end dienstverlening waarbij je de klant zoveel mogelijk helpt tijdens het proces. Kijk daarom niet vanuit gevaar of vanuit angst naar digitalisering, maar vooral vanuit kansen en mogelijkheden en dan bij voorkeur gericht op de lange termijn. Digitalisering brengt ook met zich mee dat de rol van de adviseur verandert, dat is onomkeerbaar. Een positieve insteek daarbij is bedenken hoe gaaf het is als je alleen maar met die klant bezig hoeft te zijn en niet meer met administratief papierwerk. Vanuit die rol voeg je waarde toe aan de keten en word je werk alleen maar leuker. Dat positieve gevoel dat ik dagelijks ervaar rondom de razendsnelle digitalisering gun ik écht iedereen, van notaris tot consument en van financieel adviseur tot makelaar. Het is niet de vraag óf je digitalisering omarmt, maar wanneer je dat gaat doen. En als je dat eenmaal beseft heb je wat mij betreft goud in handen’, besluit Jolanda. Meer informatie Wil je meer weten over samenwerking en het bestuur van Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:08:55Z",
  "source": "ech.nl"
}