{
  "id": "5340b1912a396bb1a4cb3b8b69cc2066330ed81e",
  "url": "https://www.ech.nl/meet-the-team-leo-draaisma/",
  "title": "Meet the team - Leo Draaisma - ECH",
  "text": "Meet the team - Leo Draaisma - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Leo Draaisma / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘ Ik houd me vooral bezig met informatiebeveiliging’, Leo Draaisma, Security Officer voor ECH, vanuit de KNB ‘Binnen de KNB houd ik me, ook voor stichting ECH, bezig met informatiebeveiliging en dan in de breedste zin van het woord.’ Dat zegt Leo Draaisma, adviseur procesoptimalisatie bij Koninklijke Notariële Beroepsorganisatie. ‘Wanneer mensen uit mijn omgeving aan me vragen wát ik dan precies doe, dan geef ik aan dat ik als adviseur met name adviseer over hoe notarissen hun omgeving zo veilig mogelijk kunnen houden. En gaat er onverhoopt iets helemaal mis, dan begeleiden we op die momenten de notarissen ook. Tevens leg ik uit hoe belangrijk termen als vertrouwelijkheid en de integriteit van gegevens zijn. Die woorden zijn onlosmakelijk met het notariaat verbonden. Verdere digitalisering is dan weer een relatief ingewikkelde uitdaging waar men voor staat. En daar help ik bij, samen met mijn collega’s’, aldus Leo. Leo Draaisma, Security Officer ECH ECH op platform KNB ‘Mijn klanten, als je dat zo kunt zeggen, zijn zowel het KNB-bureau en de notariskantoren zelf. Zo hebben we, als één van onze diensten, een platform waarop notarissen zijn aangesloten. Ze vinden er allerlei toepassingen. Ook ECH draait op dat platform. Voor hen is het belangrijk dat dit platform uiterst veilig is. Ik vind het mooi dat ik, vanuit mijn rol als aanspreekpunt, voor een stichting als ECH mijn bijdrage mag leveren.’ Van leerling programmeur tot consultant ‘Van origine kom ik niet direct uit de juridische hoek, maar meer uit de kant van consultancy’, vervolgt Leo. ‘Ik ben ooit begonnen, dat was begin jaren tachtig, als leerling programmeur. Zo ben ik langzaamaan de automatisering ingerold, werd ik projectleider en uiteindelijk consultant op het gebied van het doorvoeren van professionalisering. Ik maak me, eigenlijk al mijn hele werkend leven, vooral druk over het helpen van bedrijven en organisaties. En dat gaat dan over hoe men op een andere manier kan werken dan voorheen. Mijn werk gaat in de basis vaak over het vormgeven en begeleiden van veranderprocessen. Dat vind ik interessant en leuk. Ik heb jarenlang op detacheringsbasis gewerkt en ben bij de KNB terechtgekomen toen ik merkte dat ik op een punt in mijn carrière was beland waarbij ik behoefte kreeg aan werken in een vaste omgeving. Het is een besluit waar ik geen moment spijt van heb gehad. Mijn keuze om richting notariaat te gaan was overigens niet willekeuring, want ik had het idee dat er juist in de wereld van het notariaat nog veel veranderingen op komst waren. En dat is precies waar ik warm voor loop.’ Informatiebeveiliging? Ook dat gaat uiteindelijk over communicatie ‘Die invulling van mijn werkend leven past bij mijn karakter. Ik houd ervan om structuur aan te brengen en ervoor te zorgen dat zaken helder zijn en duidelijker worden. Het vak van informatiebeveiliging kan behoorlijk lastig zijn, maar als je dit op de goede manier aanpakt is het juist práchtig. Wat bijvoorbeeld helpt is als je probeert om op een rustige manier aan medewerkers uit te leggen waarom bepaalde maatregelen genomen worden. En dat je de veranderingen die dit met zich meebrengt, zoveel mogelijk aan laat sluiten op de mensen binnen de organisatie. Uiteindelijk gaat ook dit proces over communicatie. Het zal je niet verbazen dat ik nogal analytisch ben ingesteld en graag probeer om onduidelijkheden weg te halen. Dat past goed bij één van mijn passies: ik ben erg van de taal en vind het heel mooi om te schrijven en te construeren. Je kunt je voorstellen dat het een verademing is om te mogen werken in een omgeving zoals het notariaat waarbij taal belangrijk is en mensen bovendien behoorlijk taalvaardig zijn. Dat vind ik prettig.’ Werken voor ECH? Dat voelt als een feestje ‘Wat het werken, en dan specifiek voor ECH, voor mij heel leuk maakt is dat ik in een hele leuke groep mensen mag werken. En uiteraard maakt ook de interessante inhoud van het werk het heel plezierig. ECH is geen grote organisatie waar je elke keer met anderen te maken hebt, maar juist een kleine, hechte groep met veel jonge mensen die op een niet formele manier met elkaar samenwerken. Kortom, het zijn hele fijne collega’s, waar ik veel energie van krijg. Trots op gezamenlijk resultaat ‘Waar ik verder trots op ben? Dat is écht een gezamenlijke prestatie, namelijk dat we het voor elkaar hebben gekregen om in een vrij korte tijd de ECH SOC2-verklaring te ontvangen. Daarmee tonen we aan dat we als ECH de risico’s waar we mee te maken hebben goed beheersen. We hebben er met elkaar heel hard aan gewerkt en ik vind dat heel knap vanuit het relatief kleine team dat hier verantwoordelijk voor was. En dat past dan weer precies bij de enthousiaste manier waarop ECH zich bezighoudt met informatiebeveiliging. Het wordt gezien als belangrijk en als een taak waar men met plezier aan werkt.’ Leo Draaisma in privé ‘Verder ben ik sinds 1,5 jaar grootvader en daar geniet ik erg van. En sinds kort ben ik met golfen begonnen. Daarnaast vind ik het leuk om op het podium te staan en dan met name om met andere mensen samen iets te creëren. Zo zing ik in een koor’, vervolgt Leo. ‘Daar word ik heel blij van. Logisch, want het sluit naadloos aan op wie ik ben, wat ik leuk en belangrijk vind. Binnen een zanggroep is er ook een precair samenspel gaande, waarbij iedereen zaken helder maakt door uit te zoeken wat er van hem of haar verwacht wordt. En als dat eenmaal samenvalt, dan vind ik dat een machtig mooi proces.’ Meer informatie Heb je vragen voor Leo, heb je ideeën of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor ieder klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:09:34Z",
  "source": "ech.nl"
}