{
  "id": "5373903ffd87204a8332e7a47027e872b4216e2c",
  "url": "https://www.ech.nl/author/ruby/",
  "title": "Ruby, auteur op ECH",
  "text": "Ruby, auteur op ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Ruby Nieuwe hypotheekakte voor Nationale-Nederlanden Nieuws / Ruby Nationale-Nederlanden heeft haar hypotheekakte vernieuwd. In de nieuwe akte (Versie HYNNB00) is alleen nog informatie opgenomen die noodzakelijk is voor de zekerheidsstelling van de hypotheek. Ook voldoet de nieuwe akte aan het model voor een KIK-akte en kan hierdoor automatisch worden ingelezen bij de inschrijving in het Kadaster. Dit was een grote wens vanuit het […] Nieuwe hypotheekakte voor Nationale-Nederlanden Meer lezen » ECH wijzigt deadlines Royementenproces en layout aflosnota Nieuws / Ruby Met ingang van vrijdag 3 april 2020 gelden er nieuwe deadlines in het royementenproces en zal de weergave van aflosnota’s veranderen. Vanaf dat moment vragen we het notariaat om royementsverzoeken niet eerder dan 2 maanden voor de aflosdatum in te dienen. De maatschappijen sturen aflosnota’s vanaf dan uiterlijk 5 werkdagen voor de aflosdatum aan de ECH wijzigt deadlines Royementenproces en layout aflosnota Meer lezen » ECH heeft RNHB succesvol gecertificeerd Nieuws / Ruby RNHB heeft een mijlpaal behaald in het bouwtraject. Sinds 3 december 2019 is RNHB succesvol gecertificeerd door ECH. In q1 2020 verwacht RNHB live te gaan met ECH. Meer informatie hierover volgt later. Met de certificering van ECH heeft RNHB weer een stap gezet naar een meer efficiënte en meer veilige manier van verwerking van ECH heeft RNHB succesvol gecertificeerd Meer lezen » ECH integratie bij quion in 2020 Nieuws / Ruby Met veel enthousiasme en gepaste trots brengen wij goed nieuws: quion heeft de contracten ondertekend! In 2020 zullen zij de ECH integratie gereed hebben en gefaseerd live gaan met alle hypotheeklabels. In eerste instantie vwb het vestigen van hypotheken en later ook met het royementenproces. Communicatie met het notariaat middels de berichtenstandaard van ECH is ECH integratie bij quion in 2020 Meer lezen » Klantreis bankgaranties brengt mogelijkheden voor betere klantbeleving in kaart Nieuws / Ruby Afgelopen najaar heeft stichting ECH een verkenningstraject voor het bankgarantieproces gefaciliteerd. Hiertoe is een viertal sessies georganiseerd om de klantreis in kaart te brengen, waarbij nagenoeg alle bij ECH aangesloten partijen betrokken zijn geweest. ECH heeft dit traject gebruikt om te kijken hoe een berichtenstandaard en platform de deelnemers kan ondersteunen in een soepeler bankgarantieproces. Klantreis bankgaranties brengt mogelijkheden voor betere klantbeleving in kaart Meer lezen » Stichting ECH feliciteert BLG wonen met 65-jarig jubileum Nieuws / Ruby In 1954 werd het bouwfonds limburgse gemeenten opgericht door de gemeentes geleen, stein, limbricht en munstergeleen. Vanuit één centrale gedachte: iedereen de kans geven om een huis te kopen. Zo helpen zij mensen al ruim 65 jaar bij het vinden van een passende hypotheek. Voor de communicatie met het notariaat werken BLG wonen en ECH Stichting ECH feliciteert BLG wonen met 65-jarig jubileum Meer lezen » Rabobank vanaf 1 november beter bereikbaar voor notariaat Nieuws / Ruby Vanaf 1 november is de Rabobank telefonisch beter bereikbaar voor het notariaat. De afgelopen periode hebben we gemerkt dat de huidige openingstijden niet voldoen aan de wensen van onze ketenpartners en dat daarmee dus ook de klantbediening in het geding is. Daarom heeft Rabobank, in overleg met u als notariskantoor, besloten om vanaf vrijdag 1 Rabobank vanaf 1 november beter bereikbaar voor notariaat Meer lezen » ECH gebruikersdag 2019 groot succes! Nieuws / Ruby Donderdag 26 september heeft er op landgoed groots kievitsdal te baarn de ECH gebruikersdag plaatsgevonden met dit jaar als thema ‘dialoog in de hypotheekketen’. Het bestuur, het management en de betrokken consultants vanuit het ECH-team kijken terug op een interactieve, constructieve en vooral leuke dag! Klik hier voor de presentatie. ErvaringenDirecteur lisa huisman stond tijdens ECH gebruikersdag 2019 groot succes! Meer lezen » Aankondiging ECH gebruikersdag 2019 Gebruikersdag , Nieuws / Ruby Ieder jaar organiseert stichting ECH voor al haar deelnemers en geïnteresseerde partijen de gebruikersdag. Het betreft daarbij zowel deelnemers uit het notariaat als medewerkers van de aangesloten hypothecair financiers. Ook de notariële softwareleveranciers zijn op deze dag van harte welkom.via deze weg willen wij u informeren over de gebruikersdag die dit jaar zal plaatsvinden op Aankondiging ECH gebruikersdag 2019 Meer lezen » Syntrus Achmea hypotheken en Attens hypotheken moderniseren hypotheekproces en sluiten aan op ECH Nieuws / Ruby Syntrus Achmea en Attens sluiten op korte termijn aan op het passeerproces van elektronische communicatie hypotheken (ECH). Vanaf 1 juli kunt u de eerste passeerinstructie via ECH verwachten. Met het afhandelen van passeerzaken via ECH zetten Syntrus Achmea hypotheken en Attens hypotheken de volgende stap in het moderniseren van het hypotheekproces. Hugo ouwehand, director hypotheken Syntrus Achmea hypotheken en Attens hypotheken moderniseren hypotheekproces en sluiten aan op ECH Meer lezen » Bericht paginering 1 2 … 6 Volgende → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:19:32Z",
  "source": "ech.nl"
}