{
  "id": "543b3ab91096cc79b0d63cf47bb9dea55b98e8e4",
  "url": "https://www.ech.nl/klantreis-bankgaranties-brengt-mogelijkheden-voor-betere-klantbeleving-in-kaart/",
  "title": "Klantreis bankgaranties brengt mogelijkheden voor betere klantbeleving in kaart - ECH",
  "text": "Klantreis bankgaranties brengt mogelijkheden voor betere klantbeleving in kaart - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Klantreis bankgaranties brengt mogelijkheden voor betere klantbeleving in kaart / Nieuws / Door Ruby Afgelopen najaar heeft stichting ECH een verkenningstraject voor het bankgarantieproces gefaciliteerd. Hiertoe is een viertal sessies georganiseerd om de klantreis in kaart te brengen, waarbij nagenoeg alle bij ECH aangesloten partijen betrokken zijn geweest. ECH heeft dit traject gebruikt om te kijken hoe een berichtenstandaard en platform de deelnemers kan ondersteunen in een soepeler bankgarantieproces. Graag vertel ik je in dit artikel zowel de insteek van dit traject als de uitkomsten en toekomstige plannen en deel ik de ervaringen opgedaan in mijn eerste twee maanden bij ECH. Even voorstellen: casper van ginneken, junior consultant bij ECH. Als onlangs afgestuurde ‘financial engineer’ aan de universiteit twente ben ik bij ECH begonnen om mijn steentje bij te dragen binnen een aantal innovatieprojecten in het hypothecaire en notariële domein. In samenwerking met collega’s leon roseleur, johan agterberg en lisa huisman hebben we vier workshops georganiseerd met de insteek om het huidige bankgarantieproces in kaart te brengen en gezamenlijke uitgangspunten te formuleren. Zowel de wens vanuit het notariaat en de geldverstrekkers om te standaardiseren als de invoering van de AVG en klantverwachtingen waren aanleidingen om deze verkenning op te starten. Samengevat waren de wensen: een gestroomlijnd proces, kennis- en informatie-uitwisseling met ketenpartners op een gestandaardiseerde en geautomatiseerde manier en een klantbeleving van een 9+. Uit het inzicht in de huidige staat bleek dat iedere geldverstrekker een ander proces heeft ingericht, dat bovendien handmatig, foutgevoelig en kostbaar is. Zo start één geldverstrekker al het bankgarantieproces bij de hypotheekaanvraag, terwijl de ander deze pas start vlak voor finaal akkoord. Ook het afmelden van de bankgarantie gebeurt op verschillende wijzen. Daarnaast krijgt de klant op verschillende momenten in het traject te horen van het begrip bankgarantie. De informatie richting consument is meestal schaars en na afronding ontbreekt vaak de terugkoppeling naar de consument. De gemene deler van de sessies was een gewenste situatie waarin de belangrijkste uitgangspunten gericht zijn op het ontzorgen van de consument door een transparant, volledig digitaal proces dat eenduidig is voor zowel het aanleveren als afmelden van garanties. Uiteraard moet het daarnaast voldoen aan wet- en regelgeving zoals de AVG. De deelnemers gaven unaniem aan positief gestemd te zijn over de resultaten van de klantreis en zien veel voordelen in het standaardiseren van het bankgarantieproces. Het bestuur van ECH zal zich binnenkort buigen over de resultaten van de verkenning en een beslissing nemen voor wat betreft de vervolgstappen van het traject. Op persoonlijk vlak heb ik veel kunnen leren van de sessies met de geldverstrekkers. Door de klantreis in kaart te brengen vanuit het perspectief van een starter op de vastgoedmarkt was ik goed in staat mijn eigen ervaringen samen met de deelnemers om te zetten naar concrete analyses. Ik kijk er naar uit om de toekomstige situatie verder uit te werken met de ECH-deelnemers, zodat we samen met de sector een verbeterslag kunnen maken ten aanzien van dit proces. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:35:07Z",
  "source": "ech.nl"
}