{
  "id": "559f830d041b8dfd5aad08fbb7fa46daedcbf9c2",
  "url": "https://www.ech.nl/samenwerking-davinci-conclusion-en-ech-verlengd/",
  "title": "Samenwerking Davinci Conclusion en ECH verlengd - ECH",
  "text": "Samenwerking Davinci Conclusion en ECH verlengd - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Samenwerking Davinci Conclusion en ECH verlengd / Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Fantastisch nieuws! Vol trots laten we weten dat de succesvolle samenwerking tussen Davinci Conclusion en Stichting ECH opnieuw is bekrachtigd voor de komende jaren! Al ruim 20 jaar werken we samen. Een samenwerking die we heel bewust, meerdere keren per jaar, evalueren. Want zo lang samen werken gaat natuurlijk niet vanzelf. Dat vergt eerlijke en open communicatie, waarin we expliciet stilstaan bij wat goed gaat en wat beter kan. Zodat de toegevoegde waarde, over en weer, altijd duidelijk is. Deze contractverlenging is een belangrijke mijlpaal in onze samenwerking en dat hebben we vlak voor de feestdagen gevierd met een bubbeltje en heerlijke zoeternij op het kantoor van ECH-bestuurslid Gerben Jonkman in Maarssen. V.l.n.r. Bira Thanabalasingam (Davinci Conclusion), Gerben Jonkman (ECH bestuurslid), Floris Beerens (ECH directie) en Lisa Huisman (ECH directie) Onze speciale dank gaat uit naar de medewerkers van het kernteam van ECH; elke dag laten zij weer zien wat onze toegevoegde waarde als business partner van ECH is. Van de deelnemers en stakeholders van ECH krijgen wij steevast complimenten over onze communicatiestijl, professionaliteit en servicegerichtheid. De verlenging van ons partnerschap is niet alleen een bevestiging van het harde werk en de kwaliteit die wij leveren, maar ook een teken van vertrouwen in onze toekomst samen. Dank aan iedereen die heeft bijgedragen aan dit succes. Laten we samen blijven groeien en innoveren. Want zo leveren wij een belangrijke bijdrage aan het creëren van een nieuw thuis voor velen! Meer informatie Wil je meer weten over de dienstverlening van ECH? Laat het ons weten via info@ech.nl . Samen bouwen we aan de toekomst van ECH! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:30:58Z",
  "source": "ech.nl"
}