{
  "id": "55dd89aaba025e5865ef9a8922e6f1a0e661b691",
  "url": "https://www.ech.nl/digitalisering-kansen-notariaat-ed-engelen-vertelt/",
  "title": "Digitalisering als kans voor het notariaat - ECH",
  "text": "Digitalisering als kans voor het notariaat - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Digitalisering als kans voor het notariaat / Bestuur , KNB , Nieuws , Notaris , Referenties notariaat / Door echadmin ‘Digitalisering is een fenomeen waar we allemaal mee te maken hebben. En of je het nu wilt of niet, we moeten er in mee. Go with the flow zou je kunnen zeggen. Maar dat vergt wel van ons dat wij, als notarissen, anders naar ons vak gaan kijken. En het vraagt ook concreet om er anders mee om te gaan. Er is niets voor niets de bekende uitspraak: als je doet wat je deed, dan krijg je immers wat je kreeg.’ Aan het woord is Ed Engelen, notaris bij notariaat Engelen, penningmeester bij de KNB én voorzitter van stichting ECH. Ed Engelen, notaris bij notariaat Engelen, penningmeester bij de KNB én voorzitter van stichting ECH Over botjes en berenvellen ‘Zelf word ik nogal gedreven door de vraag: waarom doe je iets op een bepaalde manier? Wanneer het antwoord dan is ‘omdat we het altijd al zo deden’, dan gaan mijn nekharen overeind staan. Want, als we ons als mensen niet ontwikkeld hadden, dan liepen we nog altijd in berenvellen rond met een botje door de neus’, lacht Ed. ‘Je moet je daarom realiseren dat het áltijd beter kan. Je doet je best, maar het kan altijd beter. Tegelijkertijd is het de uitdaging, en zeker in de wereld van het notariaat, om niet te verkrampen in het nastreven van perfectionisme. Ik las eens een artikel met de titel ‘Van perfectionisme naar optimalisatie’ en dat spreekt me aan. Want we willen met elkaar het best haalbare resultaat bereiken, perfect wordt het toch nooit. Wanneer je dat streven eenmaal los durft te laten dan is het oké om soms te vallen. Sterker nog, als je nooit valt dan leer je ook niet om op te staan.’ De uitdaging voor het notariaat ‘Wanneer ik focus op de wereld van het notariaat, dan denk ik dat je grofweg op twee manieren naar ons vak kunt kijken. Ten eerste op de sombere manier, waarbij je zou kunnen denken dat onze rol steeds kleiner wordt door digitalisering. Juist dankzij digitalisering ga ik liever voor de tweede manier, waarbij je ook zou kunnen denken dat er veel kansen zijn. Zo geloof ik bijvoorbeeld dat een ontwikkeling als de blockchain, de notaris juist gaat helpen en zeker niet als vervanging van onze beroepsgroep gaat dienen. Het is mijns inziens juist een tool die ons ondersteunt.’ ‘En natuurlijk is het soms eng, alleen al omdat het allemaal zo razendsnel gaat. Maar echte angst is niet nodig wat mij betreft. Wat ik wél zie is dat er een uitdaging ligt voor de notaris. Die zal zichzelf de vraag moeten stellen waarin hij straks nog onderscheidend is. In mijn visie gaat dat vooral over de schakel tussen wat je doet en het contact leggen met die klant. Neem een hypotheekakte als voorbeeld. Voor de meeste mensen is dat ingewikkelde materie en ook niet direct een leuke activiteit om mee bezig te zijn. Dus als mensen bij me op kantoor komen dan vertel ik ze in gewoon begrijpelijk Nederlands wat een hypotheekakte doet. Ik ga ze niet vervelen met tot in detail uitleggen hoe die akte juridisch en op welke gronden dan technisch gezien werkt.’ ‘Ik vergelijk het maar met het kopen van een auto. Wanneer ik een exemplaar aanschaf dan wil ik dat deze aan bepaalde eigenschappen voldoet. Misschien moet er voldoende ruimte zijn voor boodschappen, wil ik dat de wagen zuinig rijdt en bovendien betrouwbaar is. Dan hoeft de garage mij vervolgens niet tot in detail uit te leggen waaróm dat die auto dan zo zuinig of betrouwbaar is. Dat is precies zoals ik naar mijn vak kijk. Ik maak met mijn klanten vaak de vertaalslag naar wat er in het leven op juridisch vlak kan gebeuren en waarom het dus belangrijk is om zaken goed te regelen en hoe je dat dan doet. En of dat dan in artikel 7a, lid 1, onderdeel c staat is niet zo belangrijk. Het gaat om vertrouwen en kunde binnen je vak. En de klant daarin in begrijpelijke taal mee kunnen nemen. Die klant moet erop kunnen vertrouwen dat het goed is. Zo sturen we zelf al 15 jaar een enquêteformulier aan onze klanten toe, na het passeren van een hypotheekakte. Laatst nog noemde iemand specifiek dat hij het zo leuk vond dat we tijdens het gesprek letterlijk zeiden dat de aankoop ook gewoon een feestje mag zijn. Wat mij betreft ís dat ook zo: natuurlijk is het een zakelijke transactie, maar zeer regelmatig wel met een leuke achtergrond.’ Moraal van het verhaal ‘Wat voor mij de moraal van het verhaal is? Omarm digitalisering, houdt aandacht voor de mens. Ontwikkel je op het gebied van dat wat de klant wil, ga meer met die klant in gesprek en luister naar wat er gevraagd en verteld wordt. Want zo langzamerhand wordt die akte steeds minder een onderscheidende bezigheid. Wat veel belangrijker gaat worden is de persoonlijke relatie met die klant. En daar heb je zelf gelukkig nog altijd vólop invloed op’, besluit Ed. Meer informatie Wil je meer weten over digitalisering in het notariaat of het bestuur van Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:06:53Z",
  "source": "ech.nl"
}