{
  "id": "5c352bdd2ea0cb3c7cf590af3173949c980029fd",
  "url": "https://www.ech.nl/professionaliseren-moderniseren-en-samenbrengen/",
  "title": "Professionaliseren, moderniseren en samenbrengen - ECH",
  "text": "Professionaliseren, moderniseren en samenbrengen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Professionaliseren, moderniseren en samenbrengen / Nieuws / Door echadmin Stichting ech levert een branchestandaard voor elektronische berichtenuitwisseling in de hypotheekketen. Deze berichtenstandaard wordt geleverd voor 2 processen: het aflossen (royeren) en het passeren/verstrekken (vestigen) van een hypotheek. Het is te gebruiken door alle notariskantoren, hypothecair financiers en ‘serviceorganisaties’. Ech heeft tot doel om een efficiënte en kwalitatief hoogwaardige bijdrage te leveren. Hierbij staat voorop dat de dienstverlening van ech op een veilige en betrouwbare wijze wordt geëxploiteerd. Stichting ECH levert een branchestandaard voor elektronische berichtenuitwisseling in de hypotheekketen. Deze berichtenstandaard wordt geleverd voor 2 processen: het aflossen (royeren) en het passeren/verstrekken (vestigen) van een hypotheek. Het is te gebruiken door alle notariskantoren, hypothecair financiers en ‘serviceorganisaties’. ECH heeft tot doel om een efficiënte en kwalitatief hoogwaardige bijdrage te leveren. Hierbij staat voorop dat de dienstverlening van ECH op een veilige en betrouwbare wijze wordt geëxploiteerd. Professionaliseren en moderniseren Momenteel sluiten steeds meer maatschappijen en hypothecaire serviceorganisaties aan op ech. Ook is 99% van het notariaat in nederland aangesloten. “met een groeiende marktpositie is het voor ons van belang om verder te denken over professionaliseren en moderniseren” , aldus Annemarie Verver, ECH-consultant. “ ECH is momenteel bezig met meerdere initiatieven om de professionalisering en modernisering in goede banen te begeleiden. Zo hebben we onlangs een SOC2 type 1 audit laten uitvoeren. Ook zijn we aan het onderzoeken of we de dienstenportefeuille uit te breiden met bijvoorbeeld het proces bankgaranties. Verder steken we veel tijd en energie in het samenbrengen van het notariaat en de maatschappijen in de vorm van bijvoorbeeld (gecombineerde) werkgroepen en de jaarlijkse ECH gebruikersdag waar ervaringen en verbetersuggesties worden uitgewisseld.” Samenbrengen Als betrouwbaar en onafhankelijk branche-initiatief (zonder winstoogmerk) neemt ECH de rol aan van partner voor het notariaat en maatschappijen/serviceorganisaties. In die rol probeert ECH de maatschappijen en notariskantoren bij elkaar te brengen om verbetermogelijkheden (onder meer op het gebied van uniformering, standaardisering en efficiency) omtrent de samenwerking te bewerkstelligen. Tijdens deze bijeenkomsten worden actuele (keten)thema’s met elkaar besproken en procesafspraken gemaakt. ECH stelt als ambitie om een brugfunctie te vervullen tussen notariaat en maatschappijen. Het eerstvolgende evenement is de ECH gebruikersdag 2020 welke staat gepland op woensdag 4 november 2020 . Meer informatie hierover volgt. Wil je meer weten over de professionalisering en modernisering van stichting ECH? Neem dan contact met ons op via info@ech.nl Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T04:03:49Z",
  "source": "ech.nl"
}