{
  "id": "5d249cf153bd9e0b484bf60ff4df608a5d0fcd0c",
  "url": "https://www.ech.nl/conclusie-hypsotech-uit-marktanalyse-over-ech-dienstverlening-ech-betrouwbaar-en-stabiel/",
  "title": "Conclusie Hypsotech uit marktanalyse over ECH: dienstverlening ECH betrouwbaar en stabiel - ECH",
  "text": "Conclusie Hypsotech uit marktanalyse over ECH: dienstverlening ECH betrouwbaar en stabiel - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Conclusie Hypsotech uit marktanalyse over ECH: dienstverlening ECH betrouwbaar en stabiel / Hypotheekmarkt , Nieuws , Notaris / Door Raymond Bloot ‘Hypsotech heeft in opdracht van ECH een marktanalyse uitgevoerd. We delen graag een aantal resultaten daarvan, samen met de prognose’.  Aan het woord zijn Paul van Haaren en Hessel Jan Knapen, beiden partner bij Hypsotech. Het bedrijf is actief op diverse terreinen binnen de hypotheekketen. ‘Grofweg bestaan onze drie werkgebieden uit benchmarks, onderzoek en consultancy, project- en interim-management en opleidingen voor en over de hypotheekindustrie. Voor ECH was het doel van het onderzoek concreet: we hebben onderzocht hoe de markt op dit moment in elkaar steekt. Met de markt bedoelen we de verstrekkingen van nieuwe hypotheken en de aflossingen- en oversluitmarkt. Hiervoor hebben we een marktscan uitgevoerd. Daarnaast wilde ECH zeker weten dat de focus op de juiste zaken ligt op dit moment. En dat tipje van de sluier kan ik alvast oplichten: het is key voor ECH om zich te blijven richten op hun primaire dienstverlening, daar liggen volop kansen! Juist omdat ECH de dienstverlening zo gedegen aanpakt.’ Paul van Haaren, Hypsotech Hypotheekmarkt groeit door Hessel Jan vult aan: ‘Belangrijk onderdeel van het onderzoek was de wens vanuit ECH om aansluiting bij de markt te houden. Dit omdat we met elkaar zien dat de hypotheekmarkt volop in beweging is, zowel met betrekking tot huizenprijzen als in aantallen nieuwe verstrekkingen en aflossingen. Deze inzichten in de marktontwikkelingen dienen ter ondersteuning van de strategische keuzes die stichting ECH wil maken ten aanzien van de doorontwikkeling van de dienstverlening de komende jaren.’ Paul: ‘Hoofdvragen binnen het onderzoek waren wat de (markt)verwachting voor de komende jaren is en wat de kansen zijn waar ECH op in kan springen. Daarbij komt ook kijken met welke risico’s en bedreigingen ECH rekening moet houden. Tot slot is er gekeken naar welke kansen er zijn voor nieuwe diensten, waarbij we rekening hebben gehouden met vergaande digitalisering in de markt over 5 jaar. De meest relevante zaken delen we graag in dit artikel.’ De cijfers op een rij Hessel Jan: ‘De hypotheekmarkt brak in 2020, ondanks de bijzondere omstandigheden door corona, ieder record. De hypotheekproductie bedroeg, op basis van de kadastercijfers, 135 miljard euro. Dit bedrag werd vooral aangejaagd door de oversluitmarkt. Ook de huizenprijzen stegen verder door, naar een gemiddelde van € 342.000, gebaseerd op de Q4 cijfers van 2020. En de rente was dan weer heel laag, namelijk 0,89%. Dit percentage is gebaseerd op een 10-jaars NHG-tarief, en laat het gemiddelde uit de top 3 zien.’ D e hypotheekmarkt in 2021 – 2025 Paul: ‘Verder zien we dat een aantal trends in deze markt de ontwikkelingen in de hypotheekmarkt de komende jaren nog verder zullen beïnvloeden. Ten eerste blijft de krapte op de woningmarkt aanhouden, waarbij de huizenprijzen beperkt zullen stijgen als gevolg van de verdere opdroging van de transactiemarkt. De hypotheekrente zal laag blijven, al is een lichte stijging mogelijk. Er zal namelijk meer aanbod van funding dan vraag naar hypotheekgeld zijn. Verder zal er een sterke afname van het aantal oversluitingen ontstaan, omdat het gros van de huizenbezitters op gegeven moment een lage rente heeft. Daardoor zal het aantal aflossingen afnemen. We verwachten meer gebruik en uitwisseling van digitale gegevens in het hypotheekproces via bronontsluiting en dan vooral in het advies- en acceptatieproces. Daarnaast zal er nog meer druk op de operationele kosten en efficiency in de hele keten komen en gaat er bij een licht stijgende rente gebruikgemaakt worden van verhuisopties binnen de aangeboden financieringsvorm. Tot slot wordt ontsluiting van rekeninggegevens dankzij PSD2 verder ontwikkeld en gaan meer geldverstrekkers doorontwikkelen naar volledige automatische acceptatie voor een deel van de productie. ’ Hessel Jan Knapen, Hypsotech “ECH heeft kans tot groei in een krimpende markt de komende periode” volgens Hessel Jan Knapen, Hypsotech. Hessel vult aan: ‘Op basis van analyse is onze visie op de hypotheekproductie als volgt: vanaf 2021 zal de oversluitmarkt significant dalen, mede als gevolg van de blijvend lage rente. Daarbij geldt dat het aantal starters en doorstromers op peil blijft. Door funding van institutionele beleggers zullen traditionele banken naar verwachting wat terrein terugwinnen op het gebied van de lange rente. Als ECH in de komende periode de voorziene implementaties afrondt, dan betekent bovenstaande dat het marktbereik van ECH in passeringen zal groeien in een krimpende markt. De afloszaken zullen naar verwachting stabiliseren. Dat is geen slechte positie in een teruglopende markt.’ Paul: ‘Overall kunnen we concluderen dat de dienstverlening van ECH infrastructureel is. Daarmee bedoelen we dat hun aanbod in de markt net zo noodzakelijk is als bijvoorbeeld gas, water en licht dat is voor het comfort van de consument. De meerwaarde van de dienstverlening van ECH zit primair in de verhoging van de operationele efficiency. Dit betekent dat de focus voor ECH vooral zou moeten liggen op het vergroten van hun primaire dienstverlening. Denk dan aan maximaliseren van het marktbereik, zoals het aansluiten van partijen op passeren of royementen waar dat mogelijk is. En aan het maximaliseren van het volume binnen berichtenuitwisselingen met aandacht voor het reduceren van uitval van complexe aanvragen, bankgaranties en dergelijke.’ Advies aan ECH: schoenmaker blijf bij je leest Zoals Paul al aangaf was het voor ECH bij aanvang van het onderzoek belangrijk om te weten of ze op dit moment de goede dingen doen en of ze die ook goed doen. Het antwoord is in beide gevallen overtuigend ja. Er is sprake van een heel duidelijke, consistente propositie die uitblinkt in stabiliteit en betrouwbaarheid. Tegelijkertijd is er ook nog laaghangend fruit te plukken, met name in het aansluiten van partijen. Er zit nog veel potentie in de markt op dat vlak’, zegt Hessel. ‘ECH zit zeker op het goede spoor en kan, naast het maximaliseren van haar huidige dienstverlening, ook nog vooruit met aanpalende dienstverlening zoals bijvoorbeeld bankgaranties. Maar overall is het devies: schoenmaker blijf bij je leest, want die is práchtig solide en kansrijk in dit geval.’ Meer informatie Wil je meer weten over de marktanalyse van Hypsotech voor Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:22:04Z",
  "source": "ech.nl"
}