{
  "id": "5f3fa1dfac91f2390f4f9e79ee73c6c42ef8c3f7",
  "url": "https://www.ech.nl/ech-webapplicatie-geintegreerd-werken/",
  "title": "ECH webapplicatie - geïntegreerd werken - ECH",
  "text": "ECH webapplicatie - geïntegreerd werken - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH webapplicatie – geïntegreerd werken / Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Referenties notariaat , Wijzigingen / Door Raymond Bloot In de ECH webclient is enige tijd geleden de functionaliteit “Geïntegreerd werken” opgeleverd. Met deze functionaliteit geeft een notariskantoor aan of zij voor bepaalde ECH processen (zaaktypes) werken via de geïntegreerde oplossing van het gebruikte softwarepakket of via de ECH webapplicatie. De keuzemogelijkheid bij de kantoorinstellingen in de webapplicatie ziet er als volgt uit: Vanuit ECH stimuleren we het geïntegreerde gebruik van onze functionaliteiten in een softwarepakket. Om te voorkomen dat partijen binnen ECH processen duaal gaan werken, is er voor gekozen om processen niet meer zichtbaar te maken in het zakenoverzicht in de webapplicatie indien bij de instelling ‘Geïntegreerd werken’ gekozen is voor “Werkt via softwarepakket”. Deze instelling is een defaultwaarde en geldt daarmee voor alle zaken van desbetreffend proces en alle medewerkers van het kantoor.Indien een medewerker incidenteel gebruik wil maken van de ECH webapplicatie voor een proces, dan is dat mogelijk door bij het veld ‘Zaaktype’ het betreffende proces aan te vinken. In de ECH webapplicatie release van 15 december jl. zijn hierbij nog de volgende aanpassingen doorgevoerd: Alle kantoormedewerkers met toegang tot de ECH webclient hebben de rechten onder de kantoorinstellingen de defaultwaarde bij een proces aan te passen. Let op : Gedane wijzigingen zijn op kantoorniveau en niet op individueel niveau. Bij het zakenoverzicht is de volgende tekst toegevoegd: “Bij kantoorinstellingen kunt u voor het kantoor instellen welke zaaktypes standaard op dit scherm getoond worden.” Meer informatie Als er vragen zijn over deze aanpassingen of de ECH webapplicatie, neem dan gerust contact opnemen met de ECH Servicedesk via info@ech.nl of bel 070-3307135. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:06:10Z",
  "source": "ech.nl"
}