{
  "id": "602a4efa9e320a5707b2802b717c1e1c3be99978",
  "url": "https://www.ech.nl/lisa-huisman-over-10-jaar-ech-groei-uitdagingen-en-afscheid/",
  "title": "Lisa Huisman over 10 jaar ECH: groei, uitdagingen en afscheid - ECH",
  "text": "Lisa Huisman over 10 jaar ECH: groei, uitdagingen en afscheid - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Lisa Huisman over 10 jaar ECH: groei, uitdagingen en afscheid / Bestuur , Directie ECH , Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Raad van Advies , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Tien jaar aan het roer van een organisatie is een mijlpaal die niet onopgemerkt voorbij mag gaan. Lisa Huisman viert deze maand haar tienjarig jubileum als algemeen directeur van ECH. Een decennium waarin ze het bedrijf zag groeien van een ‘puber’ naar een volwassen en financieel gezonde organisatie. In dit interview blikt ze terug op haar reis, de uitdagingen, de successen én haar aanstaande afscheid. Van interim naar algemeen directeur Toen Lisa in 2015 werd voorgedragen als directeur van ECH, was er enige aarzeling bij het toenmalige bestuur. “Ik was 33, had notarieel recht gestudeerd en ervaring bij Rabobank Nederland, maar geen directierol vervuld en geen ervaring met het vermarkten van een IT-platform.” Ze begon als interim-directeur met een aanstelling van een half jaar, die later werd verlengd. “Na een jaar kreeg ik definitief de rol van algemeen directeur. Dat voelde als een enorme beloning, want ik had dat jaar keihard gewerkt.” Van puber naar volwassen organisatie Als ze terugkijkt op de afgelopen tien jaar, springt één moment er voor Lisa direct uit. “Het moment waarop ECH alle openstaande schulden had afgelost en financieel gezond werd. Dat is gelukt door het aansluiten van nieuwe partijen en het vergroten van onze inkomsten. We hadden een enorme rentelast, en het werd duidelijk dat we financieel gezonder moesten worden.” Lisa begon een intensieve campagne om nieuwe notariskantoren en hypothecair financiers aan te sluiten. “Ik ben heel Nederland doorgegaan, heb veel gesprekken gevoerd en pitches gegeven. En met succes, steeds meer grote spelers sloten zich aan. Hierdoor kon ECH haar schulden versneld aflossen en binnen drie jaar volledig financieel gezond worden. “Vanaf dat moment konden we investeren in de toekomst, zonder afhankelijk te zijn van hypothecair financiers die moesten bijspringen.” Mede dankzij deze inspanningen groeide het marktaandeel van 10% naar zo’n 40%, een belangrijke mijlpaal voor ECH. Lisa: “ECH was een puber en we hebben alle groeipijnen meegemaakt. Inmiddels durven we te zeggen dat we een volwassen organisatie zijn.” “Daarnaast ben ik trots op het behalen van onze SOC2-assurance. We hadden destijds al veel geïnvesteerd in security en compliance en dachten wel dat we de processen goed op de rit hadden. Maar als dat dan door een externe partij met een dikke pluim wordt bevestigd, dan is dat de kroon op al het harde werk. SOC2 betekende bovendien niet alleen een kwaliteitsstempel, maar ook een enorme efficiëntieslag. Voorheen moesten we jaarlijks talloze audits en vragenlijsten van individuele hypothecair financiers invullen, wat tijdrovend en gefragmenteerd was. Met SOC2 konden we in één keer aantonen dat we voldeden aan alle wet- regelgeving en veiligheidsnormen. Dat bespaarde ons niet alleen tijd, maar gaf onze stakeholders ook extra vertrouwen en zekerheid in de betrouwbaarheid en professionaliteit van ECH.” Uitdagingen als leider ECH opereert als stichting zonder winstoogmerk, wat zowel voordelen als nadelen met zich meebrengt. De afgevaardigden die als leden vanuit het bestuur en de Raad van Advies participeren, verrichten de ECH-werkzaamheden allemaal naast hun eigenlijke baan. “Het bestuur had bijvoorbeeld minder frequent een vergadering, waardoor sommige beslissingen maanden in beslag namen . Dit beperkte de slagkracht van de organisatie. “We hebben uiteindelijk een nieuw organisatiemodel geïmplementeerd, waardoor de bestuurders eigen portefeuilles kregen en de rol van de Raad van Advies anders vormgegeven werd. Daardoor konden we sneller schakelen en groeide onze professionaliteit.” Daarnaast werd de directie uitgebreid met Robert Jan van Pelt (Directeur Change) en Floris Beerens (Directeur IT & Operations), ieder met hun eigen verantwoordelijkheden. “Dat gaf focus en zorgde ervoor dat we als organisatie slagvaardiger en daadkrachtiger werden.” Ook de diversiteit in haar team was een leerproces. “In het begin wilde ik alleen maar ‘Lisaatjes’ om me heen verzamelen, want dat klikte zo lekker, haha. Maar ik leerde al snel dat diversiteit in een team veel productiever is.” De impact van digitalisering ECH speelt een cruciale rol in het standaardiseren en beveiligen van digitale communicatie tussen notarissen en hypothecair financiers. Lisa: “Wij staan voor elektronische communicatie in de hypotheekwereld, en juist die digitalisering heeft de sector veranderd. IT moet een middel zijn, geen doel op zich. Het moet repeterende en foutgevoelige werkzaamheden overnemen, zodat notarissen en hypothecair financiers meer tijd overhouden voor hun adviesrol. Toen ik begon, was de sector een stuk conservatiever en vonden sommige deelnemers IT nog spannend. We hebben ze laten zien dat automatisering juist kan helpen om fouten te voorkomen en efficiënter te werken.” Daarnaast is de dienstverlening van ECH de afgelopen jaren verder uitgebreid. “We hebben de digitale snelweg die we al hadden – met rijstroken voor de processen Vestigen en Royeren – aangevuld met nieuwe functionaliteiten zoals bankgaranties en verzoeken. Dit versterkt niet alleen onze dienstverlening, maar vergroot ook onze footprint in de vastgoedketen.” Samenwerking als sleutel tot succes Lisa benadrukt dat de groei van ECH zeker niet alleen haar verdienste is. “Onze samenwerking met KNB, Avisi en Davinci Conclusion is cruciaal geweest. We werken al meer dan 20 jaar samen en evalueren die samenwerking elke twee jaar kritisch. Elke keer komen we tot dezelfde conclusie: we gaan door in deze samenstelling.” Ook de samenwerking met softwareleveranciers in de notariële en bancaire sector noemt ze essentieel. “Zij integreren immers de ECH-applicatie in hun pakketten, waardoor notarissen en hypothecair financiers efficiënter kunnen werken.” Het belang van een veilige en informele cultuur Een van de belangrijkste factoren achter het succes van ECH is volgens Lisa de bedrijfscultuur. “We hebben, vanuit allerlei invalshoeken, veel energie gestoken in een veilige en informele cultuur. Ons team bestaat uit medewerkers van drie verschillende businesspartners, maar we hebben er altijd een hecht, open en transparant team van gemaakt. We werken hard, er is aandacht voor het vieren van successen, maar ook voor het leren van ‘fouten’ en persoonlijke ontwikkeling. Dat wordt overigens ook erkend door onze stakeholders. Structureel ontvangen we complimenten over onze medewerkers, dat maakt mij oprecht trots!” Vooruitblik op de toekomst: Lisa draagt het stokje over Per 1 juli draagt Lisa het stokje met veel vertrouwen over aan Robert Jan en Floris. “ECH is stabiel en gezond, en ik wil me meer focussen op mijn rol als directeur bij Davinci Conclusion. Dat voelt in alle eerlijkheid een beetje dubbel, want ECH is mijn ‘kindje’. Maar, ik laat het absoluut met een gerust hart achter bij Floris, Robert Jan en de rest van het team.” Lisa vervolgt: “En natuurlijk vind ik dat ECH dé marktstandaard moet worden voor communicatie tussen hypothecair financiers en notarissen. We beschikken nu over circa 40% marktaandeel, maar ik hoop natuurlijk dat de resterende 60% ook aanhaakt. Dat gaat niet van vandaag op morgen, maar de richting die we op willen is duidelijk.” Afscheid op het ECH jaarevent Op 7 mei zal Lisa tijdens het jaarevent van ECH officieel afscheid nemen. Ook Ed Engelen, voorzitter van het bestuur, neemt dan afscheid. “Het is een mooi moment om terug te blikken op de afgelopen tien jaar en samen met collega’s, ECH-deelnemers en -stakeholders het glas te heffen.” Met haar vertrek laat Lisa een financieel gezonde en volwassen organisatie achter. Haar wens voor ECH? “Dat ECH dé marktstandaard wordt voor communicatie tussen hypothecair financiers en notarissen. Dat was en ís mijn droom, en ik heb er alle vertrouwen in dat het team die droom verder waarmaakt!” Meer informatie Wil je meer weten over ECH of haar dienstverlening? Laat het ons weten via info@ech.nl . Samen bouwen we aan de toekomst van ECH! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T04:00:29Z",
  "source": "ech.nl"
}