{
  "id": "605e6dabc24ca446d880ac6922b967af090cbbda",
  "url": "https://www.ech.nl/geslaagde-ech-gebruikersdag-platform-voor-hypothecair-financiers-en-notariaat-om-de-communicatie-in-de-vastgoedketen-te-optimaliseren/",
  "title": "Geslaagde ECH gebruikersdag: platform voor hypothecair financiers en notariaat om de communicatie in de vastgoedketen te optimaliseren - ECH",
  "text": "Geslaagde ECH gebruikersdag: platform voor hypothecair financiers en notariaat om de communicatie in de vastgoedketen te optimaliseren - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Geslaagde ECH gebruikersdag: platform voor hypothecair financiers en notariaat om de communicatie in de vastgoedketen te optimaliseren / Gebruikersdag , Nieuws / Door Ruby Op 13 september 2018 was landgoed groot kievitsdal in baarn het toneel van de gebruikersdag 2018 waarbij het 15-jarig jubileum van stichting ECH werd gevierd door een groot aantal bezoekers uit het notariaat, geldverstrekkers en softwareleveranciers. Jaarlijks organiseert stichting ECH een gebruikersdag voor medewerkers uit het notariaat en de aangesloten maatschappijen. Uiteraard zijn daarbij ook softwareleveranciers aanwezig die ECH hebben geïntegreerd in hun softwarepakketten. De dag stond dit jaar in het teken van het thema ‘naar een efficiënte keten’ en het 15-jarig jubileum van de stichting. Lisa huisman, directeur van stichting ECH, kijkt terug op een succesvolle middag. “de opkomst was hoog. De sfeer was positief en we hebben de aanwezigen een goed beeld kunnen geven van onze visie. Maar nog veel belangrijker; het enthousiaste en gemotiveerde ECH team heeft meer dan genoeg input op kunnen halen om ECH het komende jaar verder te professionaliseren!” Bernadette verberne, manager ict & innovatie bij de koninklijke notariële beroepsorganisatie (KNB), heeft een presentatie gegeven over de laatste ontwikkelingen omtrent ketenintegraties in de vastgoedketen. Zo werden verschillende innovatieve pilots besproken waarin onder andere banken en het notariaat vertegenwoordigd zijn. Ook werd stilgestaan bij de digitale ambities van de KNB. Daarna werden de aanwezigen door floris beerens, operationeel manager van stichting ECH, in vogelvlucht meegenomen door de cijfers en een aantal projecten dat ECH in voorbereiding heeft voor 2019. Productowner johan agterberg vertelde over de nieuwste features voor ECH nu versie 4.0 live is en de maatschappijen en notarieel softwareleveranciers volop bezig zijn met inbouwen. Voorts heeft privacy officer leon roseleur een toelichting gegeven op alle security- en privacymaatregelen die het afgelopen jaar zijn genomen door ECH. Tenslotte nam notaris en bestuurslid van de stichting, remco kuijpers, de aanwezigen mee door de uitkomsten van het klanttevredenheidsonderzoek. Met een lach en een kritische noot wist hij de nodige discussies in de zaal aan te wakkeren. En mét resultaat: tijdens de gezellige borrel na afloop werden al direct visitekaartjes en concrete tips uitgewisseld tussen notarissen en hypothecair financiers omtrent hoe ze elkaar beter kunnen helpen.Vindt u het leuk om mee te denken over de ontwikkeling van ECH? Bent u positief kritisch? Meld u dan aan voor een van de diverse werkgroepen via info@ECH.nl. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:22:58Z",
  "source": "ech.nl"
}