{
  "id": "60aa700ad726647ba29fe5cfcbfd20216fde00d9",
  "url": "https://www.ech.nl/ech-gebruikersdag/",
  "title": "ECH Gebruikersdag - ECH",
  "text": "ECH Gebruikersdag - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH Gebruikersdag / Nieuws / Door Ruby Net als voorgaande jaren organiseert Stichting ECH ook dit jaar weer een Gebruikersdag. De Gebruikersdag is een platform waar notarissen, hypothecair financiers en softwareleveranciers elkaar kunnen ontmoeten en ideeën en ervaringen kunnen uitwisselen. Bovendien is dit een moment voor Stichting ECH om inzicht te geven in het gebruik van ECH en de plannen voor de toekomst. Datum: woensdag 8 november 2017 Tijdstip: 13.30 – 17.00 uur (inloop vanaf 13.00 uur) Locatie: De Volksbank, Croeselaan 1, Utrecht (goed bereikbaar via Utrecht Centraal Station of op het parkeerterrein bij de Jaarbeurs). Klik hier om de presentatie te bekijken. Programma » Inloop vanaf 13:00u » Opening | 13:30u|  Lisa Huisman » Communicatie | Leonard Wattimury » Financiën, Facts & Figures | Floris Beerens » Maatschappijen & contracten | Lisa Huisman » Pauze | 14:45u » Kennis Quiz | Jelmer Griepink » Het project ECH 4.0 | Johan Agterberg » Certificeringen | Maykel van Londen » Bankgaranties | Lisa Huisman » Marktontwikkelingen vanuit HDN perspectief | Raymond Bloot (HDN) » Sluiting vergadering en rondvraag | Lisa Huisman » Borrel | 16:30u Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:04:19Z",
  "source": "ech.nl"
}