{
  "id": "630bbff10f7c62d99b3ffac2bfffeb6720fcf7fa",
  "url": "https://www.ech.nl/bestandstypen-per-hypothecair-financier/",
  "title": "Bestandstypen per hypothecair financier - ECH",
  "text": "Bestandstypen per hypothecair financier - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestandstypen per hypothecair financier / Nieuws / Door Ruby Binnen ECH is het mogelijk een bijlage te versturen (van en naar hypothecair financiers). In de praktijk is gebleken dat hypothecair financiers niet altijd alle bestandstypen kunnen ondersteunen in hun software en verdere automatisering. Stichting ECH houdt vanaf nu bij, welke bestandstypen per hypothecair financier kunnen worden ontvangen. Na de succesvolle pilotperiode met Aegon wordt deze functionaliteit ook toegepast bij andere hypothecair financiers. Per hypothecair financier kan dan worden ingesteld welke van die 4 mogelijke bestandstypen worden ondersteund, respectievelijk *.pdf, *.doc, *.docx en/of *.rtf. Het functioneel beheer van Stichting ECH houdt per hypothecair financier bij welke bestandstypen kunnen worden ontvangen. Dit houdt in dat de notaris alleen type bijlagen kan versturen die zijn toegestaan per hypothecair financier. Mocht de notaris hiervan afwijken, dan zal dit worden tegengehouden middels een foutmelding. Op de website van ECH kunt u in de sectie “ Veel gestelde vragen ” een overzicht zien van toegestane bestandstypen per hypothecair financier. Klik hier om dit overzicht te raadplegen. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:21:19Z",
  "source": "ech.nl"
}