{
  "id": "6381c50e19869c0ec36f9b576153f2aa6187337b",
  "url": "https://www.ech.nl/paul-kok-met-ech-forse-afname-foutenmarge-en-tijd-per-dossier/",
  "title": "Paul Kok: “Met ECH forse afname foutenmarge en tijd per dossier” - ECH",
  "text": "Paul Kok: “Met ECH forse afname foutenmarge en tijd per dossier” - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Paul Kok: “Met ECH forse afname foutenmarge en tijd per dossier” / Nieuws , Referenties notariaat / Door Ruby “In een vastgoedmarkt waarin cliënten op steeds kortere termijn willen overdragen en de marges onder druk staan, is het voor de notaris van belang om snel en efficiënt de benodigde stukken van de banken te ontvangen. Ons kantoor maakt hiervoor gebruik van de dienstverlening van ECH. ECH biedt ons de juiste tools om snel, adequaat en efficiënt de benodigde stukken van banken te vergaren. Ten aanzien van nieuwe hypotheken hanteert ECH een duidelijke digitale communicatie en is er gelukkig geen sprake meer van papieren post. Doordat ECH is in ons softwaresysteem is ingebouwd, wordt alle correspondentie direct in het digitale kantoordossier opgeslagen. Als het gaat om aflosnota’s met bijbehorende royementsvolmachten biedt ECH met name snelheid bij het aanleveren van de benodigde informatie. Ook deze informatie wordt direct in het digitale kantoordossier opgeslagen. Bij banken die niet aangesloten zijn bij ECH, is de opzegtermijn soms wel een maand. Dit is nog wel eens reden om een overdracht te moeten uitstellen, tot teleurstelling van cliënten. Reden te meer voor de betreffende banken om zich bij ECH aan te sluiten. Sinds wij met ECH werken, is de foutenmarge en de hoeveelheid tijd die besteed wordt aan royementen en hypotheken fors afgenomen. Mijn advies aan de banken is dus om snel toe treden tot ECH!” Paul Kok, notaris Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:28:22Z",
  "source": "ech.nl"
}