{
  "id": "6553a00e8ad68d5cb171c9f52d20a555abfac5f3",
  "url": "https://www.ech.nl/notarissen/build/",
  "title": "Build - ECH",
  "text": "Build - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Build Proces: Passeren E-mail: beheer@build-finance.com Telefoon: 088-4229 143 01 Nieuwsberichten 02 Passeren 03 Royeren Deelnemersinfo Build Algemene informatie/nieuwsberichten (kort) Build Rental Housing Mortgages Build financiert huurwoningen van professionele vastgoedinvesteerders. Zo leveren wij een bijdrage aan het oplossen van het woningtekort. Bij Build vinden we dat iedereen recht heeft op een betaalbaar en prettig thuis! Bij Build kunt u zelfstandig of via een financieel tussenpersoon een financiering aanvragen. Ons team van specialisten geeft snel duidelijkheid welke financiering mogelijk is. Build haalt haar funding op bij institutionele beleggers. Notarisinstructie passeer proces Passeerproces Build Rental Housing Mortgages Build financiert huurwoningen van professionele vastgoedinvesteerders. Build staat bij de KvK ingeschreven onder Build Finance BV. Build Finance B.V. gebruikt de rekeningen van Stichting Derdengelden Build Finance B.V. voor het verstrekken en innen van gelden. Passeren nieuwe hypotheken Build gebruikt ECH voor het passeren van nieuwe hypotheekleningen. Uitgangspunten: Kenmerk maatschappij is dossiernummer. Wij kunnen de volgende documenttypen ontvangen: pdf. De maximale documentgrootte is 20MB. Passeeropdracht Kort na finaal akkoord van de lening sturen wij via ECH een bericht naar u als notaris. Hierin voegen wij reeds de bijlagen definitieve lening overeenkomst en de algemene voorwaarden toe. We verzoeken u vriendelijk om de definitieve getekende lening overeenkomst en de algemene voorwaarden te hechten aan de minuut van de akte. Passeerdatum De op te geven passeerdatum dient minimaal 6 werkdagen in de toekomst te liggen. Het bericht ‘melden gelden’ hoeft niet gebruikt te worden. Wij maken altijd het volledige hypotheekbedrag naar u over. Sluitnota De sluitnota wordt uiterlijk 2 werkdagen voor passeren aan u verstrekt en zoveel eerder als mogelijk. Passeerbevestiging Wij verzoeken u binnen drie dagen na passeren een afschrift van de hypotheekakte met notarisverklaring inclusief inschrijvingsrelaas te verstrekken. De leningovereenkomst hoeft niet aan ons teruggestuurd te worden. Vragen en opmerkingen Heeft u tips, vragen, opmerkingen of verbeteringen, laat ze ons weten! U kunt ons bereiken via onderstaande gegevens. Contact Voor vragen zijn we bereikbaar op telefoonnummer 088-4229 143 . U kunt ons bellen van maandag tot en met vrijdag van 8.30 uur tot 17.00 uur. U kunt ook een e-mail sturen naar beheer@build-finance.com . Notarisinstructie r oyementenproces Royementenproces Opvragen aflosnota Aflosnota’s kunnen opgevraagd worden via: beheer@build-finance.com . Royementen Royementsverzoeken kunnen opgevraagd worden via: beheer@build-finance.com . Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:07:43Z",
  "source": "ech.nl"
}