{
  "id": "679b88f59877a5d9a2431093d9f0ee74a110b2d6",
  "url": "https://www.ech.nl/notarissen/nestr/",
  "title": "NESTR - ECH",
  "text": "NESTR - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Nestr Proces: Passeren E-mail: hypotheek@beheer.nestr.nl Telefoon: 088-422 9140 01 Nieuwsberichten 02 Passeren 03 Royeren Deelnemersinfo Nestr Algemene informatie/nieuwsberichten (kort) Nestr Smart Finance Nestr is een aanbieder van vastgoedfinancieringen voor woningen bestemd voor de verhuur. Nestr Smart Finance staat bij de KvK ingeschreven onder Dutch Mortgage Services BV. Notarisinstructie passeer proces Passeren nieuwe hypotheken Nestr gebruikt ECH voor passeren van nieuwe hypotheken. Uitgangspunten: Kenmerk maatschappij is dossiernummer. Wij kunnen de volgende documenttypen ontvangen: pdf. De maximale documentgrootte is 20MB. Passeeropdracht Kort na finaal akkoord van de lening sturen wij via ECH een bericht naar u als notaris. Hierin voegen wij reeds de bijlagen definitieve lening overeenkomst en de algemene voorwaarden toe. We verzoeken u vriendelijk om de definitieve getekende lening overeenkomst en de algemene voorwaarden te hechten aan de minuut van de akte. Passeerdatum De op te geven passeerdatum dient minimaal 3 werkdagen in de toekomst te liggen. Het bericht ‘melden gelden’ hoeft niet gebruikt te worden. Wij maken altijd het volledige hypotheekbedrag naar u over. Sluitnota De sluitnota wordt uiterlijk 2 werkdagen voor passeren aan u verstrekt en zoveel eerder als mogelijk. Passeerbevestiging Wij verzoeken u binnen drie dagen na passeren een afschrift van de hypotheekakte met notarisverklaring inclusief inschrijvingsrelaas te verstrekken. De leningovereenkomst hoeft niet aan ons teruggestuurd te worden. Vragen en opmerkingen Uw mening is belangrijk. Als u tips, opmerkingen of verbeteringen heeft, laat ze ons weten! U kunt ons bereiken via onderstaande gegevens. Contact Voor vragen zijn we bereikbaar op telefoonnummer 088-422 9140. U kunt ons bellen van maandag tot en met vrijdag van 8.30 uur tot 17.00 uur. U kunt ook een e-mail sturen naar hypotheek@beheer.nestr.nl . Notarisinstructie r oyementenproces Royementen Royementsverzoeken kunnen opgevraagd worden via: hypotheek@beheer.nestr.nl . Opvragen aflosnota Aflosnota’s kunnen opgevraagd worden via: hypotheek@beheer.nestr.nl . Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:26:37Z",
  "source": "ech.nl"
}