{
  "id": "6acdefbfce9cf7f98c6a96c9d892b3a71b873069",
  "url": "https://www.ech.nl/ech-het-notariaat-en-andere-ketenpartners/",
  "title": "‘ECH, het notariaat en andere ketenpartners: een mooi verhaal dat stééds verder gaat' Ed Engelen, notaris, penningmeester KNB en voorzitter ECH - ECH",
  "text": "‘ECH, het notariaat en andere ketenpartners: een mooi verhaal dat stééds verder gaat' Ed Engelen, notaris, penningmeester KNB en voorzitter ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘ECH, het notariaat en andere ketenpartners: een mooi verhaal dat stééds verder gaat’ Ed Engelen, notaris, penningmeester KNB en voorzitter ECH / Bestuur , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Uiteindelijk is ECH een kindje van de KNB en de Rabobank: we wilden de communicatie tussen de notariskantoren en de Rabobanken destijds verder ontwikkelen. Dáár begon het hele verhaal. Ik was in die tijd nog kandidaat-notaris, en heb vanuit die hoedanigheid met ECH gewerkt.’ Dat zegt Ed Engelen, notaris bij notariaat Engelen, penningmeester bij de KNB én voorzitter van stichting ECH. ‘Ik weet dat er vanuit de markt in die tijd nog wel wat weerstand was. Het kost immers geld om deel te nemen, maar ik vond op die manier naar de ontwikkelingen kijken getuigen van een redelijk beperkte blik. Want de samenwerking met ECH bespaart juist tijd en vermindert fouten. Ik durf mezelf daarom best een van de early adopters te noemen.’ Ed Engelen, notaris, penningmeester KNB en voorzitter ECH ECH staat op een kruispunt ‘Ik vind dat we met de stichting op dit moment op een interessant punt staan. De centrale vraag is toch wel wat we nu gaan doen. Blijven we doen wat we doen? Of gaan we voor doorontwikkeling, zeker nu we een bepaalde positie in de markt verworven hebben. Dat laatste lijkt, en dat zal weinig verrassend zijn, waarschijnlijk. Ik geloof daarnaast ook dat er absoluut ruimte is voor meer samenwerking met de ketenpartners en indirect daarmee ook met de consumenten. Want de positie die ECH heeft in het complete communicatieverkeer, in combinatie met de uitstraling van het notariaat spreekt aan. Veiligheid en onafhankelijkheid zijn termen die onlosmakelijk verbonden zijn met de wereld van het notariaat. Voor de consument voelt het vertrouwd om zijn gegevens daar achter te laten. En los van dat imago in de markt, staan we als stichting ook stevig inmiddels. Technisch klopt het allemaal. Daarom is er wat mij betreft ruimte voor verbreding, door aan de slag te gaan met de bankgarantie of andere vormen die vragen om een uniforme communicatie rondom documenten die gedeeld worden tussen consumenten en ketenpartners onderling.’ Drie kernwoorden over samenwerking ‘Wanneer ik aan ECH denk dan komt er een aantal zaken in me op, natuurlijk de kleuren geel en oranje, omdat de website en het logo er lange tijd zo uit hebben gezien. Maar ook termen als vertrouwd en modern horen er helemaal bij. En natuurlijk gebruiksvriendelijk, want dat is essentieel voor een platform als het onze’, vertelt Ed. ‘Voor geldverstrekkers is het verder goed om te weten dat de software van ECH volledig geïntegreerd is in de notariele software. En wanneer we straks aanvullende zaken, zoals de bankgarantie verwerkt hebben in onze werkwijze, dan zetten we weer een belangrijke stap in verbeteren van het proces. En uiteindelijk willen we allemaal hetzelfde: dat onze klanten goed geholpen worden’, aldus Ed. Uniformiteit zonder eenheidsworst ‘Het is voor geldverstrekkers aan te raden om gebruik te maken van deze uniformiteit. Natuurlijk hoeft het geen eenheidsworst van allemaal dezelfde hypotheekaktes te worden, maar daar automatiseren waar het kan is altijd een goed idee. Want we herkennen allemaal hoeveel negatieve energie het kost om handmatig gemaakte fouten achteraf weer recht te breien. Daarnaast vind ik het belangrijk dat er altijd ruimte blijft voor een menselijk aspect. We willen immers niet alleen elektronisch met elkaar communiceren maar ook fysiek van mens tot mens. Dat doet stichting ECH overigens heel goed vind ik, ze besteden veel aandacht aan de communicatie en de verbinding met de betrokkenen. En ze luisteren goed naar dat wat er gebeurt in het werkveld. Dat laatste, het luisteren dus, is belangrijk binnen de wereld van ICT denk ik, want voordat je het weet heb je iets prachtigs gebouwd waar uiteindelijk niemand op zit te wachten.’ Met gepaste trots ‘Dat vind ik ook echt wel knap aan de samenwerking tussen KNB en ECH: men heeft een bepaalde visie gehad en er 15 jaar lang veel energie en geld in gestoken, om het te krijgen waar het nu staat. Dat vraagt om een overtuiging waar je met elkaar voor staat. En daar ben ik best trots op. De samenwerking binnen ECH is heel informeel en je voelt je direct onderdeel van het team. Dat ervaar ik als erg prettig. We kijken met elkaar zelfbewust naar de toekomst en zetten de stip op de horizon. En daar varen uiteindelijk alle betrokken partijen, inclusief de eindgebruiker, wel bij’, besluit Ed. Meer informatie Wil je meer weten over de de visie van Ed Engelen of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:23:32Z",
  "source": "ech.nl"
}