{
  "id": "71fae3bdb7d75552d22c34a15daf6fee71025002",
  "url": "https://www.ech.nl/meet-the-team-raymond-bloot/",
  "title": "Meet the team - Raymond Bloot - ECH",
  "text": "Meet the team - Raymond Bloot - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Raymond Bloot / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Zoveel mogelijk optimaliseren, met oog voor de mens, dát vind ik belangrijk,’ Raymond Bloot, Managing Consultant ECH ‘Binnen ECH ben ik verantwoordelijk voor marketing en communicatie. We hebben als stichting in de afgelopen jaren besloten om actiever en meer zichtbaar naar buiten te treden en dat brengt, naast veel plezier en mooie verhalen, behoorlijk wat geregel met zich mee.’ Aan het woord is Raymond Bloot, als Managing Consultant werkzaam voor ECH. ‘ Daarnaast ben ik betrokken bij nieuwe ontwikkelingen en aanvullende diensten die we willen leveren. Momenteel wordt het royeerproces verbeterd en zijn we druk bezig met het in kaart brengen van de customer journey voor het geven van toestemmingen. Dat laatste, waarbij de notaris vanuit de hypothecair financier toestemming moet krijgen voor het doorvoeren van bepaalde mutaties op een lopende hypotheek, gebeurt nu veelal nog op papier en dat kan stukken efficiënter door deze taken te digitaliseren. Het gaat dan bijvoorbeeld om een wijziging op een erfpacht, het geven van een akkoord op een tweede hypotheek achter een eerste elders, of een ruilverkaveling. Al deze ontwikkelingen worden gezamenlijk opgepakt waarbij de wensen binnen de keten, daar waar mogelijk, continu ons uitgangspunt zijn. Natuurlijk kijken we elke dag weer naar hoe we ECH nog beter in de markt kunnen zetten.’ Verder begeleid ik samen met mijn collega’s nieuwe partijen die op ECH aan willen sluiten. In verschillende meetings doorlopen we dan alle functionele en technische aspecten van een aansluiting en werken van A tot Z naar het gewenste eindresultaat toe. Dat begint met een impactanalyse, waarin voor de potentiële klant helder wordt wat het concreet betekent om met ECH in zee te gaan. We leggen uit wat er bij een aansluiting komt kijken, wat er van een partij verwacht wordt, waar men rekening mee moet houden et cetera. Door op deze manier een partij te begeleiden bouw je direct een relatie op. En dat is een mooie basis om na een livegang in gesprek te blijven met deze partijen over wederzijdse ontwikkelingen in de keten. Deze input neem ik dan weer mee naar de werkgroepen, waarin gebruikers opgenomen zijn om samen te kijken naar hoe de processen lopen en hoe deze verder te optimaliseren zijn. Tot slot ben én blijf ik actief binnen mijn netwerk in de hypotheekbranche. Ik loop immers al heel wat jaren mee en vind het belangrijk om de relaties en de contacten met de partijen die ik in de loop der jaren heb opgebouwd te onderhouden.’ Raymond Bloot, Managing Consultant ECH Raymonds werkzaamheden in een notendop ‘Eigenlijk gaan bijna alle werkzaamheden over procesoptimalisatie. Daar krijg ik energie van, om zaken net dat stukje beter te maken voor alle betrokken partijen. Dat kunnen hele kleine stapjes zijn maar ook een rigoureuze switch. Uiteraard wel altijd met oog voor de mens en de relatie daarmee. Kijkend naar ketenintegratie vind ik het logisch om taken die eerder in de keten en/of in het proces al gedaan zijn niet opnieuw uit te voeren. Wanneer je met elkaar slim gebruik kunt maken van bepaalde processen of aanwezige data, dan kan ik geen reden bedenken waarom je hierin niet optimaal zou willen samenwerken. Deze ketenoptimalisatie is altijd een van de speerpunten geweest waar ik me op richt. Mede daarom is het werken bij ECH zo leuk, omdat er volop ruimte is om deze manier van optimalisatie verder uit te rollen. En daarnaast ben ik iemand die heel graag samenwerkt met mensen en partijen’, aldus Raymond. ‘Toen ik destijds de kans kreeg om bij ECH aan de slag te gaan, wist ik dat ik in een team terechtkwam dat hecht was en relatief compact: daar kreeg ik bij voorbaat al energie van.’ Geen ivoren toren ‘Het meest trots ben ik misschien wel op de manier waarop we naar de markt luisteren als we nieuwe ontwikkelingen uitrollen. Dat is ook wat we terugkrijgen uit ons netwerk, waarin men aangeeft ons open te vinden. En er wordt waardering uitgesproken voor de manier waarop we het gesprek steeds opnieuw aangaan. Juist dat gezamenlijk optrekken en niet regeren vanuit een ivoren toren is iets waar ik trots op ben. Ik ben er van overtuigd dat dit de goede manier is om de dienstverlening van ECH steeds een stapje verder te brengen. Alleen ga je misschien sneller, maar samen kom je nog altijd verder. En, ter afsluiting, we krijgen als team geregeld te horen dat de samenwerking met ons goed is, zowel qua techniek als qua toegankelijkheid van mens tot mens.’ Vrije tijd: sporten, coachen én optimaliseren ‘In mijn vrije tijd ben ik, naast dat ik houd van reizen en lekker uit eten gaan, zeer geregeld met sport bezig. Zelf fiets ik graag, loop hard en ben ik ook te vinden op de golfbaan. Daar, binnen dat sportieve karakter, ligt wel weer de link met mijn werk, want ook binnen het sportieve zie ik die uitdagingen om te verbeteren net als ik dat voor ECH probeer te doen. Verder voetbal ik en train ik als jeugdcoach het voetbalelftal van mijn zoon en dat vind ik leuk om te doen. Met name de samenwerking die er is en de manier waarop deze jongens zaken toepassen die je ze meegeeft en leert, vind ik prachtig om te zien. Uiteindelijk vind ik het mooi om anderen te helpen met groeien, of iets bij te dragen waardoor ze op een andere manier beter worden. En of dat nu een professionele partner uit de keten is óf een gedreven tiener op het voetbalveld maakt mij niet uit. Van beiden krijg ik energie waardoor ik alleen maar méér aan de slag wil met bijdragen aan groei.’ Meer informatie Heb je vragen voor Raymond, heb je ideeën of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor ieder klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:06:42Z",
  "source": "ech.nl"
}