{
  "id": "73365a2c15f0da9e753e96a2005983d50de1510d",
  "url": "https://www.ech.nl/ech-bestaat-20-jaar/",
  "title": "‘We zijn gepast trots’, Lisa Huisman, algemeen directeur, over het 20-jarig bestaan van ECH‘ - ECH",
  "text": "‘We zijn gepast trots’, Lisa Huisman, algemeen directeur, over het 20-jarig bestaan van ECH‘ - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘We zijn gepast trots’, Lisa Huisman, algemeen directeur, over het 20-jarig bestaan van ECH‘ / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken , Referenties notariaat / Door masselbergs@ech.nl In dit artikel staan Ed Engelen, voorzitter van het bestuur van ECH, en Lisa Huisman, algemeen directeur van de stichting, stil bij het 20-jarig bestaan van ECH. Je leest over de huidige stand van zaken, krijgt een terugblik én we kijken vooruit naar de toekomst. ECH : de huidige stand van zaken ‘Het zijn roerige tijden. Dat moge duidelijk zijn’, opent Lisa. ‘Maar één ding is in al die jaren niet veranderd: ECH bestaat dóór en vóór de markt, waarbij de samenwerking met onze stakeholders continu voorop staat. We proberen de warmte die we binnen ons team ervaren, over te dragen via onze communicatie en de samenwerking naar buiten toe. Dubbele agenda’s en achterdeurtjespolitiek horen daar nadrukkelijk niet bij. Ik durf te beweren dat nut en noodzaak van ECH inmiddels breed gevoeld en gedragen wordt.’ Ed, naast ECH-bestuursvoorzitter, notaris en penningmeester van de Koninklijke Notariële Beroepsorganisatie (KNB) vult aan: ‘Onlangs verwoordde één van onze deelnemers het heel mooi door te zeggen: ‘ECH? Dat zijn wij met z’n allen!’ En dat vind ik een prachtig compliment. Zeker in deze relatief moeilijke marktsituatie. Een situatie waarin ook wij als stichting, dus bewust zonder winstoogmerk, er niet onderuit komen om iets aan onze tarieven te doen. En dat is nooit prettig. Dat onze scherpe tariefstelling, die we met alle mogelijke zorgvuldigheid zo minimaal mogelijk hebben bijgesteld, dan toch zo breed gesteund wordt is hartverwarmend.’ ‘Eens’, aldus Lisa. ‘Iedereen kijkt toch vanuit zijn of haar eigen invalshoek naar het verhaal: de één is notaris, de volgende hypothecair financier en weer een ander softwareleverancier of werkzaam bij een serviceorganisatie. Dat betekent dat we allemaal onze eigen doelstellingen en klantengroep hebben. En dat we dan met elkaar in staat zijn om het collectief belang boven het eigenbelang te plaatsen, is wat mij betreft typerend voor zowel ECH als voor alle stakeholders.’ ‘Niet voor niets zijn we heel transparant over de situatie waarin ECH zich bevindt: onze markt is inmiddels met bijna de helft in volume afgenomen. Je hoeft geen wiskundige te zijn om te begrijpen dat dit veel invloed op het resultaat heeft’, vervolgt Lisa. ‘Tegelijkertijd is er absoluut geen sprake van paniekvoetbal. Dat heeft onder meer te maken met de gezonde financiële huishouding die we in de afgelopen jaren gevoerd hebben. Mede door dit voorzichtige beleid hebben we tijd gekocht om te bekijken wat deze grillige markt doet. Een markt die zich tot op de dag van vandaag lastig laat voorspellen, al lijkt deze voorzichtig te stabiliseren op het huidige niveau. Vanuit de stichting zijn we al druk bezig met bouwen aan een nieuw solide, financieel model waar we voorlopig weer mee vooruit kunnen. Eén van de speerpunten daarin, is dat we het aandeel variabele inkomsten, dat ons als stichting kwetsbaar maakt, willen verlagen. Het gros van de kosten is immers wél vast, en deze lopen onverminderd door.’ Ed: ‘De ontwikkeling van ons aangepaste model, doen we in overleg met de Raad van Advies, met een representatieve afvaardiging van onze deelnemende partijen dus. We proberen uiteraard ook te bezuinigen en maken daar in samenspraak bewust keuzes in. Desalniettemin is reeds met elkaar besloten dat de doorontwikkeling van ECH hoog op de agenda blijft staan.’ ‘Een en ander past ook goed bij de fase waarin we ons als stichting inmiddels bevinden. We zijn de spreekwoordelijke kinder- en pubertijd ontgroeid en doorontwikkeld naar de volwassenheidsfase’, vertelt Lisa. ‘Die groei is op een veilige manier verlopen, waarbij er veel aandacht was (en is!) voor compliance en security. De volgende stap gaat vooral over dóórontwikkeling, waarbij we de footprint van ECH in de keten verder willen vergroten. Dit betekent ook dat we het traject waarmee we twee jaar geleden volop hebben ingezet op change, onverminderd door laten gaan. Ook onze stakeholders hebben duidelijk aangegeven niet verder te willen bezuinigen op dit vlak, juist omdat men de noodzaak hiervan zo inziet.’ Een terugblik: 20 jaar ECH ‘En dat zijn mooie ontwikkelingen’, vervolgt Lisa. ‘Zeker als je bedenkt hoezeer ECH in de beginjaren te kampen had met een kip-en-ei-verhaal. Notarissen wilden wel aansluiten, maar pas als banken dat deden. En banken wilden wel aansluiten, maar pas als het notariaat dat deed, omdat ze anders een alternatief proces in stand moesten houden en daarmee dús te weinig toegevoegde waarde konden ervaren van hun aansluiting bij ECH. Gelukkig heb ik sterke voorgangers gehad in de directie van ECH: elke directeur heeft op zijn of haar manier een waardevolle bijdrage geleverd in de ontwikkeling van ECH. Zo heeft één van mijn voorgangers bedacht om het royeren voor notarissen gratis te maken, waardoor deelnemende notarissen konden ervaren hoe prettig het ECH-proces werkt. Dat heeft gewerkt, bijna alle notarissen van Nederland zijn inmiddels aangesloten. Toen ik acht jaar geleden aan boord kwam, ben ik samen met mijn collega Floris (red. Floris Beerens, inmiddels directeur IT & operations), in gaan zetten op de gesprekken met financiers. Het doel? Hen overhalen om óók aan boord te komen. Al snel sloten er meerdere nieuwe partijen aan en ontstonden er schaalvoordelen.’ De viering van het 20-jarig bestaan ‘Ons 20-jarig bestaan vieren we het hele jaar door al is het, vanwege de focus op onze kosten, vrij sober. In maart hebben we afgetrapt met ons jaarevent, waarbij een grote, diverse opkomst was. Samen hebben we het glas geheven. Dat was een mooi moment’, vervolgt Lisa. ‘Andere mijlpalen zijn er natuurlijk ook. Zo is ECH inmiddels helemaal schuldenvrij en hebben we in de afgelopen jaren behoorlijk wat toevoegingen kunnen doen aan onze algemene reserves. Daaruit vangen we nu de tegenvallende inkomsten als gevolg van de krimpende markt op. Een andere mijlpaal gaat over de SOC 2 Type II assurance-rapportage die ECH, inmiddels voor het vierde jaar op rij, vanuit BDO in ontvangst heeft mogen nemen.’ IT als kans, zelfs 20 jaar geleden ‘Ook maak ik graag van deze gelegenheid gebruik om onze bestuursleden in het zonnetje te zetten. Ed zelf is een mooi voorbeeld: hij was één van de eersten die opteerde voor een aansluiting vanuit zijn notariskantoor op ECH. Ed heeft IT altijd als kans gezien. Bovendien representeert hij het notariaat met verve. En daar zijn we hem dankbaar voor’, zegt Lisa. ‘Maar ook voor de andere bestuursleden geldt dat de samenwerking bijzonder waardevol is te noemen. Elk lid brengt vanuit zijn of haar eigen invalshoek wat mee. De één focust zich op techniek en werkt actief aan de infrastructuur, de volgende is erg analytisch van aard en richt zich op het op orde krijgen van de financiën. Weer een ander is bezig met communicatie en marketing en met het op de kaart zetten van de stichting. En zo heeft ieder op zijn eigen manier een stempel gedrukt op de stichting. En mede dit gegeven maakt dat we nu staan waar we staan. Wanneer je dan bedenkt dat het allemaal op vrijwillige basis verloopt, dan zegt dat wel iets over de betrokkenheid.’ De toekomst: volle kracht vooruit Ed: ‘Voor mij was de keuze om aan te sluiten, ook destijds, al een hele logische. Want niet alleen bespaart IT, in dit geval in de vorm van ECH, tijd en levert het gemak, het elimineert ook nog eens fouten. En dat is iets waar we ook in de nabije toekomst volop mee aan de slag gaan. Denk bijvoorbeeld aan digitale aktecontrole; dat gaat een immens verschil maken voor zowel hypothecair financiers als het notariaat.’ Lisa: ‘Wanneer we straks geautomatiseerd aktes uit gaan lezen, dan vermindert dat inderdaad repetitief werk dat nu nog door mensen wordt uitgevoerd. Dit betekent dat doorlooptijden korter worden en werkplezier verhoogd wordt, omdat er interessanter werk beschikbaar komt en fouten worden verminderd. De kwaliteit door de gehele keten wordt hiermee verhoogd. Het is een prachtig voorbeeld van hoe je IT als middel in kunt zetten om je processen verder te optimaliseren.’ Ed: ‘En dat is pas het begin. De ontwikkelingen gaan razendsnel: denk aan de mogelijkheden van AI, maar ook aan de introductie van digitale wallets en IDs.’ Lisa: ‘IT is een enorme kans, ook voor de notaris. Er blijft immers alleen maar meer tijd over voor gedegen advies. Dáár ligt de toegevoegde waarde van de notaris en dit maakt dat de notaris altijd relevant zal blijven.’ Samenwerking met HDN succesvol Lisa: ‘Werken voor ECH voelt als een warm bad. Zo overleggen we bijvoorbeeld ook veel met Hypotheken Data Netwerk (HDN). Dat is een mooie samenwerking, want we sluiten naadloos op elkaar aan en zitten elkaar tegelijkertijd niet in de weg. Het management weet elkaar over en weer goed te vinden. Dat is niet alleen heel plezierig samenwerken, maar ook nuttig aangezien we veelal dezelfde stakeholders hebben. Kortom, we leren veel van elkaar en de lijntjes zijn kort.’ Ed: ‘Het is voor de keten inmiddels wel duidelijk dat we geen bedreiging vormen, maar juist een aanvulling. We hebben een duidelijk doel voor ogen, we laten zien waar we voor staan en varen onze eigen koers.’ ‘Precies’, vult Lisa aan. ‘We beheersen nu zo’n 50% van de markt en zijn klaar voor méér, als dé marktpartij voor communicatie richting het notariaat. Uiteindelijk is ECH de enige geautomatiseerde berichtenstandaard waarmee veilig gecommuniceerd kan worden tussen financiers en het notariaat. Een paar jaar geleden hebben we ECH ook geschikt gemaakt voor serviceorganisaties, zoals Quion , Ingage en BCM Global . En dat heeft ons én de betrokken serviceorganisaties, op allerlei vlakken, geen windeieren gelegd.’ Van geboorte naar volwassenheid ‘Maar wat vooral overheerst is een gepast gevoel van trots. In de afgelopen 20 jaar hebben we alle fasen wel doorlopen: van baby naar peuter en van kleuter naar puber en jongvolwassene. De volwassen fase waarin we ons nu bevinden is een resultaat van gezamenlijke inspanning van een warme, eerlijke, gezellige en tegelijkertijd zakelijke groep van betrokken professionals’, zegt Lisa. ‘Daar sluit ik me van harte bij aan, waarbij ik ook de woorden betrouwbaar en stabiel nog toe wil voegen. Want die komen in me op als ik aan ECH denk. En waarschijnlijk ben ik daarin niet de enige’, besluit Ed met een lach. Meer informatie Wil je meer weten over de visie van Lisa Huisman, Ed Engelen of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:32:44Z",
  "source": "ech.nl"
}