{
  "id": "7350360d8d34f579c7c5ab7f56e08c58a8ab8fc5",
  "url": "https://www.ech.nl/link-asset-services-maakt-passeerproces-efficienter-door-aansluiten-op-de-branchestandaard/",
  "title": "BCMGlobal maakt passeerproces efficiënter door aansluiten op de branchestandaard - ECH",
  "text": "BCMGlobal maakt passeerproces efficiënter door aansluiten op de branchestandaard - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X BCMGlobal maakt passeerproces efficiënter door aansluiten op de branchestandaard / Nieuws / Door echadmin BCMGlobal sluit binnenkort aan op het passeerproces van Stichting Elektronische Communicatie Hypotheken (ECH). De livegang gaat gefaseerd voor de klanten van BCMGlobal. Op deze manier kan BCMGlobal de klant nog beter en sneller bedienen. Begin tweede kwartaal van 2020 zal BCMGlobal aansluiten op ECH. Voor BCMGlobal en het notariaat is dit een mooie stap om het passeerproces verder te verbeteren. Vanaf april 2020 kan het notariaat de eerste passeeropdrachten via ECH verwachten. De aansluiting op het systeem van ECH maakt het voor BCMGlobal mogelijk om het notarisproces efficiënter uit te voeren. De kans op fouten neemt af en is daarmee van invloed op de ‘first time right’ aanlevering van gegevens. Een win-win situatie voor zowel BCMGlobal, de geldverstrekkers, het notariaat en de consument die de woning aankoopt. Met de samenwerking wordt ook voldaan aan de Europese wet- en regelgeving op het gebied van veiligheid en privacy (AVG). Gerben Jonkman, Managing Director bij BCMGlobal: “Met ECH zijn wij er klaar voor grote aantallen hypotheken snel en foutloos te passeren.” Lisa Huisman, directeur Stichting ECH, is blij met de aansluiting: “We zijn er trots op BCMGlobal te mogen verwelkomen bij ECH. Het efficiënt, foutloos en veilig kunnen bedienen van de klant staat bij beide organisaties hoog in het vaandel!” Meer informatie Voor het notariaat worden notarisinstructies opgesteld die nog worden gepubliceerd op de website van ECH. Bij vragen over dit nieuwsbericht kunnen notariskantoren zich wenden tot de Servicedesk van Stichting ECH . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:09:10Z",
  "source": "ech.nl"
}