{
  "id": "75abfff47af2969b00360ba896540e771828a39d",
  "url": "https://www.ech.nl/ing-live-met-bankgaranties/",
  "title": "ING live met bankgaranties - ECH",
  "text": "ING live met bankgaranties - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ING live met bankgaranties / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot ING is als eerste hypothecaire geldverstrekker live met het proces Bankgaranties! Wij zijn enorm enthousiast dat ING de ECH Bankgarantie binnen haar processen heeft opgenomen. Met livegang wordt weer een mooie stap in verdere procesoptimalisatie tussen hypothecair financiers en het notariaat gezet. Al enkele jaren geleden, na verzoeken van een aantal van onze deelnemers, is ECH gestart met de ontwikkeling van het bankgarantieproces. Na uitgebreid de klantbeleving in kaart te hebben gebracht is uiteindelijk het proces rondom het stellen van een bankgarantie met onze deelnemers opgesteld. Na de bouwfase heeft het nog even geduurd voordat de eerste partij live ging. Het bankgarantieproces levert zo aan de kant van het notariaat als aan de kant van de financier significante verbeteringen op. Na implementatie van het ECH-proces, kan de bankgarantie met één druk op de knop worden verstuurd via de beveiligde digitale snelweg van ECH. Omdat de bankgarantie rechtstreeks vanuit de systemen van de hypothecair financier wordt samengesteld, kunnen er geen tikfouten in sluipen. Bij ontvangst kan de bankgarantie automatisch worden gekoppeld aan het juiste klantdossier. Ook de controles op de inhoudelijke juistheid van de garantie kunnen geautomatiseerd plaatsvinden. ECH kan garanderen dat elke notaris bankgaranties via haar platform kan ontvangen. Meer informatie Wil je meer weten over bankgaranties of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:23:34Z",
  "source": "ech.nl"
}