{
  "id": "77bf8fe3332a01b06fe8b8a8def300c6aa5387c5",
  "url": "https://www.ech.nl/notarissen/",
  "title": "Voor notarissen en notariskantoren | ECH",
  "text": "Voor notarissen en notariskantoren | ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Voor notarissen Alle informatie voor notarissen Nagenoeg alle notarissen in Nederland maken gebruik van de diensten van ECH. Betrokken partijen schakelen ons in voor het slim begeleiden van processen rondom het passeren en royeren van hypotheken en het versturen van bankgaranties. ECH levert als digitale brievenbus een hoogwaardig platform dat de communicatie tussen hypothecair financiers en notariskantoren volgens een uniforme standaard regelt. Aegon Passeren & Royeren Allianz Passeren & Royeren Argenta Passeren & Royeren ASN Bank Bankgaranties & Passeren & Royeren Attens Hypotheken Passeren & Royeren BLG Wonen Bankgaranties & Passeren & Royeren Build Passeren & Royeren Casarion Passeren Centraal Beheer Passeren & Royeren Centraal Beheer (voorheen Woonfonds) Passeren & Royeren Clarian Wonen Passeren & Royeren Dutch Commercial Mortgage Finance Passeren HollandWoont Passeren & Royeren Hypotrust Passeren & Royeren Impact Hypotheken Passeren ING Bank Royeren & Bankgaranties IQWOON Passeren & Royeren Merius Hypotheken Passeren Nationale Nederlanden Passeren & Royeren De Nederlandse Passeren NESTR Passeren Quion BV Passeren & Royeren Rabobank Bankgaranties & Passeren & Royeren Regiobank Bankgaranties & Passeren & Royeren RNHB Passeren Robuust Hypotheken Passeren & Royeren ASN Bank (voorheen SNS Bank) Bankgaranties & Passeren & Royeren SolidBriQ Passeren Syntrus Achmea Passeren & Royeren Tellius Hypotheken Passeren & Royeren Vista Hypotheken Passeren & Royeren Vitru B.V. Passeren Woonnu Passeren & Royeren info@ech.nl 070 330 7135 Vragen? Neem contact met ons op. Zaakinhoudelijke vragen over een dossier? Neem contact op met de betrokken hypothecair financier. Technische vragen over de werking van het softwarepakket? Neem contact op met de servicedesk van je softwareleverancier. Aansluiten bij ECH of overige vragen? Neem contact op met de servicedesk ECH. Softwareleveranciers Wij werken samen met deze partijen Processen rondom het passeren of royeren van een hypotheek verlopen foutloos dankzij de geautomatiseerde insteek. Mede door de integratie met alle soorten (notariële) softwarepakketten van onderstaande partijen worden dossiers snel, vakkundig en gestroomlijnd verwerkt. Je werkt eenvoudig via een geïntegreerde oplossing vanuit het softwarepakket of kiest voor de webapplicatie. Ga  voor deze laatste keuze voor webbased werken naar de ECH Webcliënt, deze is ook te openen via de inlogfunctie rechtsboven in het scherm op NotarisNet voor meer informatie. De door ons gecertificeerde softwareleveranciers bieden een standaardoplossing voor communicatie met ECH. Daardoor is integratie eenvoudig. info@vanbrug.nl 085 – 2020307 Meer over Van Brug info@quantaris.nl 030 – 6005800 Meer over Quantaris servicedesk@nextlegal.nl 0182 – 399994 Meer over Next Legal info@notarisdossier.nl 030 – 8200993 Meer over Notarisdossier info@nobilex.nl 085 – 0208566 Meer over Nobilex Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:26:17Z",
  "source": "ech.nl"
}