{
  "id": "7a5cc212b651789edc130930fc04af05fc0f3069",
  "url": "https://www.ech.nl/oude-ech-zaken-vanaf-maart-niet-meer-beschikbaar/",
  "title": "Oude ECH-zaken vanaf maart niet meer beschikbaar - ECH",
  "text": "Oude ECH-zaken vanaf maart niet meer beschikbaar - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Oude ECH-zaken vanaf maart niet meer beschikbaar / Nieuws / Door Ruby Vanaf 18 maart zullen bepaalde oude ECH-zaken niet meer beschikbaar zijn in ECH. Het betreft zaken die in ieder geval voor 30 april 2014 zijn gestart. Al deze zaken zijn inmiddels afgerond of door de hypothecair financier gestopt. Voor lopende zaken heeft deze wijziging daarom geen gevolgen. ECH versie 3.0 is in gebruik sinds september 2013. Om de weg vrij te maken voor nieuwe functionaliteiten stopt ECH met het ondersteunen van zaken die gestart zijn met versie 2.0. Sinds april 2014 is het al niet meer mogelijk om deze versie te gebruiken. Overzicht zaaknummers Momenteel zijn er nog enkele honderden oude zaken beschikbaar. Meer dan de helft daarvan is gestart in 2012 of eerder. Een overzicht van de zaaknummers die het betreft kunt u hier raadplegen. Al deze zaken zijn inmiddels afgerond of op verzoek van ECH gestopt door de hypothecair financier. Bewijslast Stichting ECH adviseert – in het verband met bewijslast – om in ieder geval de berichten ‘passeeropdracht’ (en eventuele aanvullingen daarop) en ‘aflosnota’ in elk dossier te bewaren. Daarnaast adviseert ECH de door maatschappijen gegeven volmachten te bewaren. Gebruikers van de ECH-internetapplicatie kunnen de betreffende zaken tot maart nog in zijn geheel downloaden. Een handleiding daarvoor staat in hoofdstuk 8 van de handleiding voor internetapplicatie. Voor kantoren die ECH gebruiken via een softwarepakket is het raadzaam om bij de softwareleverancier na te vragen of en welke berichten automatisch worden opgeslagen. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:11:40Z",
  "source": "ech.nl"
}