{
  "id": "7acb1e3432f0b56a689943f4a82dee6f90deacec",
  "url": "https://www.ech.nl/bedrijven-bundelen-krachten-en-helpen-notariaat-met-digitaliseringsslag/",
  "title": "Bedrijven bundelen krachten en helpen notariaat met digitaliseringsslag  - ECH",
  "text": "Bedrijven bundelen krachten en helpen notariaat met digitaliseringsslag  - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bedrijven bundelen krachten en helpen notariaat met digitaliseringsslag / ECH medewerkers , Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Het geheel is meer dan de som der delen. Dat geldt zéker voor de samenwerking tussen MK-Optimize, De Notarispartner én Stichting ECH. Samen bieden ze veel voordelen aan het notariaat, élk vanuit hun eigen invalshoek. Deze expert-combinatie vermindert, door het bieden van een platform én de uitleg om hier alles uit te halen, het handmatig overnemen van gegevens en daarmee dus het aantal fouten. Maar we staan ook graag stil bij andere voordelen: denk aan de medewerker die zich niet hoeft af te vragen of zijn bericht wel is ontvangen en op de juiste plek is gekomen. Want dat is zeker door tussenkomst van ECH. Daarnaast is inzichtelijk wanneer er een reactie verwacht mag worden. Dit scheelt telefoonverkeer en tijd. Mariëlle Blom van De Notarispartner en Marian Kooreman van MK-Optimize. Verbetering efficiency notariskantoren ‘Vanuit onze eigen expertise en kennis van het notariaat helpen we notariskantoren om duurzamer te gaan werken door mee te gaan met digitalisering.’ Aan het woord is Marian Kooreman, eigenaar van MK-Optimize , een bedrijf dat notariskantoren helpt om hun processen te optimaliseren waardoor er tijdswinst wordt behaald, de foutmarge verkleind en klanten en medewerkers tevreden zijn én blijven. ‘De afgelopen jaren heb ik gezien dat er, ondanks de mooie software die beschikbaar is, op veel notariskantoren nog niet helemaal optimaal wordt gewerkt. Men werkt hard, maar loopt toch regelmatig achter de feiten aan. Vanuit mijn achtergrond kijk ik vooral naar de efficiency binnen het notariaat. En dan met name naar de verbetering daarvan.’ Veel kansen voor notariskantoren om optimaal te werken Mariëlle Blom, eigenaar van De Notarispartner vult aan: ‘Ik run een backoffice voor notariskantoren in heel Nederland. Vanuit mijn eigen locatie log ik in en verricht het werk dat nodig is in de toegewezen dossiers. Wij behandelen registergoedtransacties en familierechtdossiers vanaf binnenkomst opdracht tot het dossier gereed is om te passeren. Je kunt ons zien als de extra handen voor een notariskantoor dat extra arbeidskracht nodig heeft door ziekte, een gebrek aan personeel of anderszins. Ik sluit me aan bij het verhaal van Marian, want ik zie dat veel notariskantoren nog niet digitaal werken en bovendien de systemen nog verre van optimaal gebruiken. Dat betekent dat er nog niet uitgehaald wordt wat er met een notarieel softwarepakket allemaal kan. Dat is zonde! Toen Marian en ik elkaar ontmoetten binnen ons netwerk concludeerden we al snel dat we elkaar goed aan kunnen vullen.’ Platform ECH biedt zoveel meer ‘ECH is als digitaal platform beschikbaar voor de communicatie tussen enerzijds het notariaat en anderzijds de hypothecair financiers. En inmiddels hebben bijna alle notariële softwarepakketten een integratie met ons platform. Daar zijn we uiteraard content mee. Net als met de samenwerking tussen deze twee dames’, aldus Johan Agterberg, Customer Journey Expert en Product Owner binnen ECH. ‘Ook wij zien dat de voordelen van het platform in de praktijk nog weleens onderschat worden door de eindgebruikers. Natuurlijk wordt er al volop tijd bespaard en minder fouten gemaakt doordat er een stuk minder zaken handmatig overgetikt hoeven te worden. Maar dat het platform van ECH ingezet kan worden om een bepaalde procesgang te waarborgen is nog minder bekend. En ook die functionaliteit biedt veel tijdbesparing. Denk bijvoorbeeld aan de notaris die kan zien dat zijn verzoek tot een royement is ontvangen bij een maatschappij. Daar hoeft hij dus niet meer achteraan te bellen, wat aan beide kanten behoorlijk wat tijd scheelt. Daarnaast kan hij zien wanneer een maatschappij een reactie gaat versturen, wat duidelijkheid geeft. Wanneer je kiest voor digitale integratie op deze manier dan voorkom je dat er ongemerkt veel tijd en energie verloren gaan aan telefoontjes, in wachtrijen staan enzovoort.’ Johan vervolgt: ‘We zijn blij met stakeholders zoals Mariëlle en Marian, omdat zij als professionals input kunnen geven over hoe wij ons platform nog verder kunnen optimaliseren. En tegelijkertijd brengen zij bij de notariskantoren, onze klanten dus, onder de aandacht welke voordelen ons platform heeft.’ Johan Agterberg – Product Owner ECH Onderzoek onder het notariaat Marian: ‘In een onderzoek dat Mariëlle en ik onlangs hebben uitgezet onder het notariaat, komt een duidelijke rode draad naar voren wanneer we spreken over de achterblijvende digitalisering binnen het notariaat. Zo geeft men aan dat papier ‘nu eenmaal zo lekker leest’, ook omdat het nakijken op papier als prettiger wordt ervaren dan via een systeem. Daarnaast wordt de bekende ‘we doen het al jaren op papier en dat blijven we graag zo doen’ ook veelvuldig genoemd. Ik kom op notariskantoren waar de stapels dossiers die nog gescand moeten worden bij wijze van spreken tot aan het plafond reiken, terwijl deze stapels in basis al niet hoefden te ontstaan. Ik ben ervan overtuigd dat veel kantoren ervan schrikken als ze uit gaan rekenen hoeveel ze kunnen besparen door meer digitaal te werken en bijvoorbeeld het ECH-platform breder in te zetten. Digitalisering gaat immers over veel meer dan geen papier meer gebruiken: denk ook aan duurzaamheid, werkplezier, tevredenheid van klanten en het voorkomen van fouten en documentverlies.’ Meedoen aan het onderzoek kan overigens nog steeds via deze link . Geautomatiseerde check van concept hypotheekakte Johan: ‘Ook wij haken vanuit onze kant uiteraard in op de mogelijkheden die steeds verdere digitalisering biedt. Zo zijn we op dit moment al bezig met het ontwikkelen van software die in staat is om een concept hypotheekakte te controleren ten aanzien van de instructie van de bank. Zo wordt bijvoorbeeld geautomatiseerd gecheckt of de juiste personen, onderpandgegevens en bedragen in de akte staan. Ons doel is om de medewerker in één oogopslag te laten zien of dat er verschillen zijn ten opzichte van de instructies of de gebruikte bronnen. Dat soort zaken maakt het digitaal nakijken van een akte pas écht gemakkelijk.’ Notaris veel invloed op succes digitalisering binnen kantoor Mariëlle: ‘Ik sluit me volledig aan bij de verhalen van Johan en Marian. Daarnaast wil ik toevoegen dat het succes van digitalisering binnen een kantoor staat of valt bij het enthousiasme van de notaris zélf. Wanneer hij of zij niet openstaat voor digitalisering dan heeft dat zijn weerslag op de rest van het kantoor. Ik kom bijvoorbeeld nog altijd notarissen tegen die alle recherches geprint in het papieren dossier willen hebben bij passeren. Terwijl deze digitaal in een mum van tijd na te kijken zijn. Dát zijn de dingen die vanaf morgen al anders kunnen. Zónder kwaliteitsverlies. Het is echt een mindset verandering in het notariaat. En wij nemen zowel de notaris als de medewerkers graag aan de spreekwoordelijke hand mee, waarbij onze ervaring is dat cold turkey overstappen beter werkt dan gefaseerd digitaal gaan werken.’ Meer efficiency én werkplezier? Neem contact op. Wil je aan de slag met kostenbesparing door digitalisering? En een interessantere werkgever worden in deze huidige krappe arbeidsmarkt? Of ein-de-lijk de overstap maken die je al tijden als een hoge drempel ervaart? Neem dan contact op met MK-Optimize of de Notarispartner en ervaar dat je dit, wanneer je straks terugkijkt, al veel eerder had willen doen. We kijken uit naar je bericht!’ Meer informatie Wil je meer weten over de visie van beide partijen of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:19:40Z",
  "source": "ech.nl"
}