{
  "id": "7b3ee385283f940b3fa60d82f95ea148c4d96ffb",
  "url": "https://www.ech.nl/over-ons/",
  "title": "Alle informatie over Stichting ECH | ECH",
  "text": "Alle informatie over Stichting ECH | ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Over ons Leer ECH kennen ECH is een platform dat als onafhankelijk branche-initiatief zonder winstoogmerk de communicatie tussen hypothecair financiers en notariskantoren vergemakkelijkt. De dienstverlening van de stichting is SOC2 compliant en heeft primair betrekking op de processen rondom het verlenen, vestigen en royeren van het recht van hypotheek. Binnen de diensten van ECH is het ook mogelijk om een bankgarantie te versturen. 01 Over ons 02 De organisatie 03 Bestuur 04 Raad van Advies 05 Directie 06 Consultancy & Functioneel Beheer 07 Ontwikkelteam 08 Servicedesk Over ons Hoofddoel van stichting ECH, dat staat voor Elektronische Communicatie Hypotheken, is het leveren van een waardevolle bijdrage aan de dienstverlening van het notariaat en de deelnemende hypothecair financiers. En dat dan specifiek gericht op bovengenoemde processen. ECH is opgericht in 2003 en sinds 2010 zijn bijna alle notariskantoren in Nederland aangesloten. In 2020 worden er maandelijks meer dan 30.000 vastgoedtransacties begeleid door notarissen en hypothecair financiers. In ruim 50% van deze transacties werd het ECH-platform gebruikt met als doel de communicatie tussen de partijen conform een duidelijke, betrouwbare en veilige standaard te laten verlopen. De organisatie Stichting ECH werkt met een bestuur, een raad van advies, een directie, diverse werkgroepen, een servicedesk en een afdeling consultancy & functioneel beheer, technici en testers & acceptanten. Tevens heeft ECH een security officer, jurist, secretariaat en financiële afdeling ter ondersteuning van de dagelijkse operatie. Ieder levert vanuit zijn of haar eigen rol een belangrijke bijdrage aan de continue ontwikkeling, het uitrollen en naleven van de strategie en het doorvoeren van innovatie binnen ECH. Bekijk onze vacatures Werkgroepen ECH brengt de aangesloten hypothecair financiers en notariskantoren bij elkaar in de vorm van verschillende werkgroepen. Ook de diverse softwareleveranciers worden hierbij betrokken. Tijdens deze bijeenkomsten worden actuele (keten)thema’s met elkaar besproken en procesafspraken gemaakt. Werkgroepen vinden onder meer plaats op het gebied van uniformering, efficiency en security. ECH geeft hiermee invulling aan de ambitie om een brugfunctie te vervullen tussen notariaat en hypothecair financiers. De werkgroepen nemen geen besluiten maar vervullen wél een belangrijke adviesfunctie. Meer over de werkgroepen even voorstellen Bestuur Het bestuur heeft als belangrijkste taak het besturen van de stichting én het nemen van besluiten op strategisch niveau. De bestuursleden identificeren en acteren op ontwikkelingen die hun weerslag (kunnen) hebben op de infrastructuur, de processen en de berichtenstandaard van ECH. E.M.J.J. Engelen (Voorzitter) Koninklijke Notariële Beroepsorganisatie en Notaris J. Janssens Koninklijke Notariële Beroepsorganisatie en Notaris G. Jonkman BCM Global E. Valent Rabobank even voorstellen Raad van advies De raad van advies heeft tot taak om gevraagd en ongevraagd te adviseren richting het bestuur omtrent de operationele gang van zaken op beleidsniveau binnen de stichting. Bij de vervulling van haar taken richt de raad van advies zich naar het belang van de stichting. Concreet gaat het dan om de bevordering van het leveren van een nóg doelmatiger en kwalitatief hoogwaardiger dienstverlening in de keten tussen het notariaat en de hypothecair financiers. S.A. Bantema Aegon J.P. Bolhaar Westvaer J. Buhrs ASN Bank N. van Buitenen Van Grafhorst Notarissen L. Dekker Nationale Nederlanden A. Drost Ingage J. Kunst BCMGlobal B. Mulder Rabobank J. Schram ING F. Schrijver Quion J.J. Storm Koninklijke Notariële Beroepsorganisatie B. van der Torren RNHB even voorstellen Directie De directie van ECH bestaat uit de algemeen directeur, directeur IT & Operations en directeur Change. Zij zijn verantwoordelijk voor de vertegenwoordiging van ECH richting het bestuur, de raad van advies en andere deelnemende partijen. Ook voeren zij de volgende taken uit: acquisitie, contractmanagement, het ontwikkelen van strategie en visie, het voeren van strategische overleggen met business- & ketenpartners en stakeholders, het opstellen van het jaarplan en de begroting, monitoren en rapporteren van de financiën, teammanagement, verzorgen van interne communicatie en uitvoeren van operationeel management. Floris Beerens Directeur IT & Operations Lisa Huisman Algemeen Directeur Robert Jan van Pelt Directeur Change even voorstellen Consultancy & functioneel beheer De consultants en het functioneel beheer van ECH zijn verantwoordelijk voor de uitvoering van de dagelijkse bedrijfsvoering, projectmanagement en het borgen van het correct functioneren van de infrastructuur, processen en berichtenstandaard. Ook het beheer, het testen en het accepteren van nieuw opgeleverde software en het aansluiten en certificeren van nieuwe hypothecair financiers vallen binnen hun taakgebied. Johan Agterberg Product Owner Raymond Bloot Communicatie Jacqueline Burger Acceptant & Tester Casper van Ginneken Compliance Officer & Consultant Arnold Kremer Technical Application Consultant Tijmen Logge Consultant Faheem Malhi Functioneel beheerder & Consultant Ohanes Muradian Consultant Peter de Raadt Privacy Officer even voorstellen Ontwikkelteam Het ontwikkelteam van ECH is verantwoordelijk voor het onderhoud van de software en vormt daarmee een cruciaal onderdeel voor de berichtenstandaard van ECH. Daarnaast houdt dit team zich bezig met de technische doorontwikkeling van de dienstverlening , zodat ECH ook in de toekomst stabiel en betrouwbaar berichtenverkeer tussen notaris en hypothecair financier kan blijven bieden. Gert-Jan Bartelds Software Developer Martijn Boss Software Developer Oscar Katsma Software Developer Joost Konst Software Developer Jeroen Vis Requirements Engineer even voorstellen Servicedesk De servicedesk van ECH is verantwoordelijk voor het verlenen van eerstelijns-ondersteuning aan notariskantoren. De servicedesk krijgt dagelijks de meest uiteenlopende vragen binnen omtrent ECH-gerelateerde zaken. Voor zaak-inhoudelijke vragen verwijzen wij het notariaat graag door naar de desbetreffende hypothecair financiers waar de desbetreffende zaak in behandeling is. Samira Laarabi Servicedesk ECH Martin Snoek Servicedesk ECH Gilbert Twilt Servicedesk ECH Alice Boerrigter Servicedesk ECH Partners Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:11:42Z",
  "source": "ech.nl"
}