{
  "id": "7c099841c6efddf42b85eb79955de6eb3ccc8409",
  "url": "https://www.ech.nl/meet-the-team-maykel-van-londen/",
  "title": "Meet the team - Maykel van Londen - ECH",
  "text": "Meet the team - Maykel van Londen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Maykel van Londen / ECH medewerkers , Hypotheekmarkt , Nieuws , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘ECH is er voor de markt. En niet andersom’, Maykel van Londen, consultant bij Davinci en al 12 jaar werkzaam voor ECH ‘Ik werk al ruim 12 jaar voor ICT-adviesorganisatie Davinci Consulting, en daarmee ook 12 jaar voor stichting ECH. We bevinden ons met de stichting al geruime tijd in de 4.0-versie, maar ik heb ook de 2.0-versie nog meegemaakt’, aldus Maykel van Londen , medewerker van het eerste uur. ‘Ik ben gestart als functioneel beheerder en heb me doorontwikkeld tot consultant. Dit betekent dat ik partijen, softwareleveranciers en hypothecair financiers, ondersteun in hun aansluiting bij ECH en de bijbehorende software. Verder houd ik me bezig met de certificeringen die horen bij de overgang naar een nieuwe versie van onze software. Tot slot ben ik ook actief als product owner, zo ben ik betrokken geweest bij het vernieuwen van de ECH-webcliënt. Dat is een project dat vanaf de tekentafel is vormgegeven en, mede door een intense samenwerking met het ontwikkelteam, succesvol vorm heeft gekregen. We zijn eerst via een aantal pilotkantoren live gegaan en hebben dit aantal vervolgens uitgebreid.’ Maykel van Londen, consultant ECH Mooie ontwikkelingen ‘We hebben mooie ontwikkelingen doorgemaakt en daar ben ik best trots op. Er is veel veranderd door de tijd heen: in de beginjaren zijn we veel bezig geweest met het enthousiasmeren van de markt. Dan bezochten we fysiek hypothecair financiers om ze uit te nodigen ECH te gaan gebruiken. Dat was een beetje een verhaal van het kip en het ei, want men vond onze software wel interessant, maar vond ook dat er nog niet voldoende notariskantoren waren aangesloten. Maar doordat hypothecair financiers niet aansloten, vonden het notariaat hetzelfde. Nadat we hier en daar wat veranderingen in onze processen hadden doorgevoerd, zag je dat er, al snel meer kantoren uit het notariaat aangesloten raakten. En daarmee gelukkig ook het aantal hypothecair financiers. Op een gegeven moment ontstond er een kantelpunt en werden de rollen omgedraaid: partijen kwamen proactief naar ons toe met de vraag of we ze aan konden sluiten. Gelukkig hebben we nooit ‘nee’ hoeven verkopen, al vroeg de toenemende drukte wel om een gedegen planning. Dat had mede te maken met de thema’s privacy en veiligheid. De Wet bescherming persoonsgegevens was toen al een belangrijk thema, en dat vergde in de voorbereiding tot daadwerkelijke aansluiting soms even wat extra tijd. Het succes van ECH heeft overigens ook deels te maken met het PEC-platform, dat erg goed beveiligd is. Hypothecair financiers zien dat als een extra voordeel in de samenwerking’, vertelt Maykel. Collega’s als vriendengroep ‘Werken voor de stichting ervaar ik niet alleen als zinvol maar ook als erg fijn. Voor mij persoonlijk heeft dat vooral te maken met het team. Er is veel kennis binnen de club, zowel op notarieel vlak als vanuit de financierskant en bovendien kunnen we heel goed met elkaar sparren. De sfeer is voornamelijk informeel. Natuurlijk is er een bepaalde hiërarchie omdat er nu eenmaal verschillende functies zijn, maar het is niet zo dat de directieleden in een ivoren toren zitten van waaruit gecommuniceerd wordt. Integendeel, iedereen is op een laagdrempelige manier bereikbaar. En dat zowel binnen als buiten werktijd. We kunnen gewoon goed met elkaar opschieten, het voelt bijna als een soort vriendenclub.’ Van functioneel beheer tot consultant ‘Overigens heb ik zelf geen notariële of economische achtergrond, ik ben echt als functioneel beheerder geschoold. Vanuit die rol maak je eigenlijk de vertaalslag tussen de klant en de technische partijen. Een zinvolle functie, want het technisch jargon wordt niet altijd door de klant begrepen en andersom vindt de ontwikkelaar het soms lastig om de klant in begrijpelijke taal uit te leggen wat er technisch gezien aangepast moet worden. Als functioneel beheerder schrijf je zelf geen code, maar fungeer je dus vooral als de communicatieve tussenspil en bovendien test je ook functioneel.’ “ECH is er voor de markt. En niet andersom”, aldus Maykel van Londen Certificering als kers op de taart ‘Toen ik als functioneel beheerder startte bij ECH ging ik op een gegeven moment ook mee naar partijen toe. Dat fysieke bezoek trok mij wel. Het leukste vind ik nog altijd om zaken vanaf scratch af aan op te bouwen door het vanaf de tekentafel, samen met anderen, uit te denken en tot het eind toe uit te rollen. Datzelfde plezier haal ik ook uit mijn rol rondom certificeringen, waarbij je vanuit diezelfde tekentafel start, alleen dan met een impact-analyse. Je kijkt met elkaar naar hoe het nu werkt, hoe het moet worden en dan maak je een gap-analyse. Het gezamenlijke doel is om zo effectief mogelijk gebruik te kunnen maken van ECH. Na de genoemde analyses gaan we verder met de implementatie en nemen we een adviserende rol aan. Ik vind het erg leuk om samen met een dergelijke partij te bouwen en dan uiteindelijk de certificering toe te passen waarbij de livegang natuurlijk de kers op de taart is. De techniek in combinatie met een probleemstelling die je probeert op te lossen waarbij je veel en intens met mensen samenwerkt, spreekt mij enorm aan. Ook omdat je in een relatief korte tijd een concrete verbetering kunt bewerkstelligen’, aldus Maykel. Geen dag hetzelfde ‘Mijn baan brengt met zich dat elke werkdag anders is. Al is één ding elke dag hetzelfde: de stand-up met het ECH-team ‘s ochtends. Vervolgens is het maar net welke projecten er draaien, dat bepaalt grotendeels de invulling van mijn dag. Ook beheer ik, samen met mijn collega’s, de mailbox van functioneel beheer. Als er vragen zijn vanuit betrokken partijen, dan pakken we dit zo snel mogelijk op. Verder woon ik regelmatig demo’s bij van partijen die nieuw aansluiten op ECH. Mijn dagen gaan van sprints tot impactanalyses en van certificering tot het uitwerken van projecten op kantoor of vanuit huis.’ Maykel in privé ‘Naast mijn werk leid ik een vrij rustig leven: ik ben getrouwd, vader van twee kinderen en besteed vooral tijd aan mijn partner en gezin. Voor spannende hobby’s, uitdagende sportwedstrijden of verre reizen kun je niet direct bij mij terecht’, lacht Maykel. ‘Ik ben eigenlijk vooral een rustig en tevreden mens.’ De werkagenda in beeld ‘Zakelijk gezien staan er weer een diverse mooie projecten op de planning: zo komen er een aantal aansluitingen van nieuwe partijen aan, zoals bijvoorbeeld Aegon, die naast het passeren nu ook op het royeren proces gaat aansluiten. Daarnaast zijn we bezig om beide bestaande processen, passeren en royeren, nog verder aan te scherpen en te verbeteren. Zo worden er enkele functionele wijzigingen doorgevoerd. Deze aanpassingen komen rechtstreeks voort uit verzoeken van gebruikers. Dat is overigens precies de manier waarop we graag werken: door goed te luisteren naar de partijen uit de markt voeren we de beste innovaties of verbeterpunten door. ECH is er voor de markt. En niet andersom’, besluit Maykel. ‘Mensen die vragen hebben over het ECH-proces of ideeën willen delen over aanpassingen of verbeteringen, kunnen contact nemen met Maykel door een e-mail te sturen naar mvlonden@ech.nl .’ Meer informatie Voor vragen of andere informatie over ECH kan contact worden opgenomen via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:04:12Z",
  "source": "ech.nl"
}