{
  "id": "7ccef667e5fb39c79a0d27365b5738e251acb1bc",
  "url": "https://www.ech.nl/aegon-start-31-oktober-met-ech-4-0/",
  "title": "Aegon start 31 oktober met ECH 4.0 - ECH",
  "text": "Aegon start 31 oktober met ECH 4.0 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Aegon start 31 oktober met ECH 4.0 / Nieuws / Door Ruby Met ingang van 31 oktober 2018 is Aegon overgestapt op ECH 4.0. Dit is de opvolger van ECH 3.1. Voor u als notaris betekent dit dat er een aantal dingen veranderen. Gebruikt u nog ECH 3.1? Tot  januari 2019 geldt er een overgangsfase. Tijdens de overgangsfase worden uw berichten naar ons automatisch omgezet. De overgang naar ECH 4.0. Brengt een aantal belangrijke verbeteringen met zich mee. 1. U krijgt van ons een gestructureerde invulinstructie bij de passeeropdracht Het invulvoorschrift dat u tot nog toe van ons ontving, wordt vervangen door een nieuwe gestructureerde invulinstructie. Deze instructie verkleint het handwerk voor notariskantoren die gebruik maken van een notarieel softwarepakket. Voorwaarde is dat dit in het pakket is ingebouwd. Hiermee automatiseren we zoveel mogelijk het opmaken van de akte en voorkomen we het foutief overnemen van gegevens. We definiëren voortaan verschillende hypotheekrECHten en onderpanden. We geven daarbij ook de rangorde aan. Bijvoorbeeld: de overbrugging wordt expliciet meegegeven in de passeeropdracht. 2. U kunt een al doorgegeven passeerafspraak annuleren In ECH 3.1. Was het niet mogelijk om een al doorgegeven passeerafspraak te annuleren. In ECH 4.0. Is dit wel mogelijk. U hoeft niet langer een fictieve datum in te vullen, zoals in ECH 3.1. Wel het geval was. 3. U stuurt ons de digitale hypotheekakte en notarisverklaring toe In de passeerbevestiging geeft u ons de werkelijke passeerdatum door. Aan de passeerbevestiging voegt u een hypotheekakte en een notarisverklaring digitaal toe. Met deze stap verdwijnt ook het laatste stuk papier uit het passeerproces via ECH.Dit zijn slechts de belangrijkste veranderingen. Wilt u meer weten? Bekijk dan de uitgebreide Aegon procesbeschrijving op ECH.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:05:34Z",
  "source": "ech.nl"
}