{
  "id": "7dec4a5d4909d89aa0b4cba2f96ce281fc82482c",
  "url": "https://www.ech.nl/geldigheid-aflosnota-ing/",
  "title": "Geldigheid aflosnota hypotheek bij ING is gewijzigd - ECH",
  "text": "Geldigheid aflosnota hypotheek bij ING is gewijzigd - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Geldigheid aflosnota hypotheek bij ING is gewijzigd / Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Vanaf 29 februari jl. heeft ING de geldigheid van de aflosnota voor haar hypotheken gewijzigd van 30 dagen naar 7 dagen , na de door notaris opgegeven aflosdatum. Deze wijziging is eerder aangekondigd in de ECH nieuwsbrief van november 2023, maar geldt vanaf 29 februari jl. voor alle hypotheken. De notaris heeft met de nieuwe aflosnota een week om de gelden over te maken na de afspraak met de klant. Als notaris kun je de opgegeven aflosdatum op elk moment wijzigen via ECH, als de afspraak met de klant wordt verzet. In de meeste situaties stuurt ING binnen 2 dagen een gewijzigde nota. De reden voor het verkorten van de geldigheid is dat ING de consument graag duidelijkheid geeft over eventuele kosten bij vervroegde aflossing. De afgesproken aflosdatum is daarin bepalend. Meer informatie Wil je meer weten over de aflosnota van ING of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:02:27Z",
  "source": "ech.nl"
}