{
  "id": "7ec129c86afe2ee52e8f83c7bea907afc79f39fc",
  "url": "https://www.ech.nl/stephanie-scheiberlich-notaris-bij-kern-notarissen-over-ech/",
  "title": "‘Positief naar zaken kijken en het proactief beter maken. Daar houden wij van’, Stephanie Scheiberlich, notaris bij Kern notarissen - ECH",
  "text": "‘Positief naar zaken kijken en het proactief beter maken. Daar houden wij van’, Stephanie Scheiberlich, notaris bij Kern notarissen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Positief naar zaken kijken en het proactief beter maken. Daar houden wij van’, Stephanie Scheiberlich, notaris bij Kern notarissen / KNB , Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door Raymond Bloot ‘We zijn vanaf het begin direct ingestapt bij ECH. Waarom we al zo vroeg deelnamen? Wij als kantoor houden van nieuwe dingen en proberen dus ook vaak nieuwe zaken uit. Wanneer een stichting een dergelijk uniek platform aanbiedt en het spreekt ons aan, dan gaan we gewoon van start.’ Dat zegt Stephanie Scheiberlich, notaris bij Kern notarissen, een kantoor dat is gevestigd in Harderwijk. Dienstverlening van hoge kwaliteit en dat op een toegankelijke en maatschappelijk betrokken wijze aanbieden, staat centraal bij dit kantoor. ‘Natuurlijk kwamen we in het begin van de samenwerking zaken tegen die niet helemaal goed verliepen. Maar dat hoort er gewoon bij. Wanneer je dan de mogelijkheid pakt om terugkoppeling te geven, dan zie je direct of er wat met je feedback gedaan wordt. En dat was zeker het geval’, vervolgt Stephanie. ‘Dat zit overigens ook in onze aard; positief naar zaken kijken en het met elkaar op een proactieve manier beter maken.’ Stephanie Scheiberlich, notaris bij Kern Notarissen Overzichtelijk, praktisch en betrouwbaar ‘Wanneer ik aan de samenwerking met ECH denk dan komen er direct woorden als overzichtelijk, praktisch uitvoerbaar en betrouwbaar bij me op’, aldus Stephanie. ‘De software is heel stabiel én veilig. En de medewerkers? Die zijn stuk voor stuk vriendelijk en staan open voor een persoonlijke benadering. De lijnen zijn kort en dat maakt het ook gemakkelijk om aan de bel te trekken wanneer dat nodig is.’ ‘ Persoonlijk zie ik het als een prettig communicatieportaal dat me op een praktische manier van werk voorziet’, Stephanie Scheiberlich, notaris bij Kern Notarissen. Persoonlijk contact spreekt aan ‘Juist dat persoonlijke staat me ook wel aan. Vooral ook omdat we in een maatschappij leven die meer en meer digitaal wordt. Het menselijke contact zou daardoor in het gedrang kunnen komen en dat vind ik geen gezonde ontwikkeling. Wat wij, ook hier binnen kantoor, steeds proberen is de juiste mix vinden tussen persoonlijk en digitaal. Wanneer ik een probleem heb of even wil overleggen is het soms gemakkelijker om de telefoon te pakken, zodat een empathisch persoon me verder kan helpen. Maar op een ander moment werk ik juist graag snel met een chatbericht omdat dit een stuk praktischer is. Daar moet je met elkaar het goede gevoel en de balans in weten te vinden.’ Platform ECH blijft groeien ‘Het platform van ECH groeit overigens nog steeds. En ook wij gebruiken de software op dagelijkse basis. Bovendien sluiten er, naast het bijna volledig aangesloten notariaat, ook steeds meer hypothecair financiers aan. Persoonlijk zie ik het als een prettig communicatieportaal dat me op een praktische manier van werk voorziet. De voordelen zijn groot: er is een stuk minder papier gemoeid met allerlei zakelijke transacties. Zo gaat er bijvoorbeeld geen notarisverklaring op papier meer naar de bank toe. En vorig jaar zijn we helemaal overgegaan op digitaal werken, we hebben nu geen fysieke dossiers meer. Dus wat dat betreft past ECH ook perfect in ons proces. Maar ook klanten stellen zich steeds meer digitaal op en men verwacht dat ook van jou als notariskantoor.’ De gouden tip: sluit je aan ‘Of ik tips heb voor andere notariskantoren en financiële instellingen? Zeker, een hele eenvoudige: sluit je aan, want het werkt gewoon goed. Het helpt je als kantoor om verder dóór te ontwikkelen, ook in digitalisering en papierloos werken’, besluit Stephanie. Meer informatie Wil je meer weten over de de visie van Stephanie Scheiberlich of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:10:55Z",
  "source": "ech.nl"
}