{
  "id": "7f0c08d6f13222a906a0c48903e60e870f0e3096",
  "url": "https://www.ech.nl/devoon-gecertificeerd-voor-ech-4-0/",
  "title": "Devoon gecertificeerd voor ECH 4.0 - ECH",
  "text": "Devoon gecertificeerd voor ECH 4.0 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Devoon gecertificeerd voor ECH 4.0 / Nieuws / Door Ruby Stichting ECH informeert u met veel plezier over de certificering van notariële softwareleverancier Devoon op ECH 4.0. Maykel van londen heeft reeds vele certificeringen namens ECH verricht en spreekt over een succesvol verlopen traject. Het pakket next-assyst geeft daarmee haar notariële klanten de mogelijkheid om van de nieuwe functionaliteiten binnen ECH 4.0 gebruik te maken. “Devoon blijft innoveren en nextassyst tijdig zullen aanpassen aan bijvoorbeeld aanpassingen op het pec-platform zoals de vernieuwingen bij ECH. Want stilstand is achteruitgang en Devoon streeft om samen met hun kantoren vooruit te blijven lopen.” Aldus martin duijs van Devoon. Doordat Devoon gecertificeerd is voor ECH 4.0 kunnen de notariskantoren die gebruik maken van nextassyst profiteren van de nieuwe mogelijkheden die ECH 4.0 biedt. Denk hierbij aan het ontvangen van de gestructureerde invulinstructie vanuit de hypothecair financier. Dit gaat het nog makkelijker maken voor notariskantoren om de hypotheekakte op te stellen. Daarnaast kan het afschrift van de akte voortaan digitaal aangeleverd worden aan maatschappijen. Hetzelfde geldt voor de notarisverklaring. Hierdoor vervalt het laatste stukje papieren proces. Ook ‘gedelegeerd’ werken behoort nu tot de mogelijkheden. Bent u benieuwd naar de nieuwe functionaliteiten en of uw softwareleverancier ook gecertificeerd gaat worden? Neem contact met het ECH-team op via functioneelbeheer@ECH.nl. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:22:38Z",
  "source": "ech.nl"
}