{
  "id": "8196cd10385e5ba1a56ca3e936cf1c1b96553790",
  "url": "https://www.ech.nl/stichting-ech-stelt-directeur-change-aan/",
  "title": "Stichting ECH stelt Directeur Change aan￼ - ECH",
  "text": "Stichting ECH stelt Directeur Change aan￼ - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Stichting ECH stelt Directeur Change aan￼ / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , Notaris , Wijzigingen / Door Raymond Bloot Sinds 1 juni jl. is Robert Jan van Pelt toegetreden tot de directie van Stichting ECH. Hij is door het bestuur benoemd tot directeur Change. In deze rol gaat hij de ambities ten aanzien van groei en uitbreiding van ECH kracht bijzetten. Tot voor kort heeft Johan Agterberg deze rol vervuld naast zijn werk als Product Owner. Gezien de groei die ECH doormaakt is het van belang om meer focus te creëren op beide rollen. Vandaar dat ECH deze rollen nadrukkelijker naast elkaar neer gaat zetten. Robert Jan gaat zich bezighouden met het benutten van de kansen van ECH, waarbij een sterke focus ligt op het uitbreiden van de bestaande dienstverlening en (nieuwe) samenwerkingen in de markt. Robert Jan van Pelt, Directeur Change Robert Jan heeft diverse managementrollen bekleed bij banken en verzekeraars in Nederland, Ierland, Maleisië en Vietnam. Daardoor brengt hij veel ervaring met zich mee in business development, marketing, sales en digitale innovaties. ‘Wij kijken er naar uit om samen met Robert Jan verder te bouwen aan ECH en de groei in onze ambities te realiseren. Met hem aan boord kunnen we nieuwe kansen gaan benutten en ECH next level brengen. Zijn kennis en ervaring gaan daar absoluut aan bijdragen’, aldus Lisa Huisman, Algemeen directeur ECH. Meer informatie Voor vragen of andere informatie aangaande dit artikel kan contact met ECH worden opgenomen met Raymond Bloot via rbloot@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:31:37Z",
  "source": "ech.nl"
}