{
  "id": "836f42979028e37a5726fbac7d2f9853f7567222",
  "url": "https://www.ech.nl/syntrus-achmea-attens-tellius-gaan-over-systeem-van-quion/",
  "title": "Syntrus Achmea, Attens & Tellius gaan over systeem van Quion - ECH",
  "text": "Syntrus Achmea, Attens & Tellius gaan over systeem van Quion - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Syntrus Achmea, Attens & Tellius gaan over systeem van Quion / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Vanaf 31 mei tot en met 11 juni 2023 kunnen er geen wijzigingen worden gedaan in het oude systeem (Force). Dat heeft invloed op zowel het proces van passeren (via ECH) als voor aflossen/royeren (niet via ECH). Als uw klant in deze periode wil passeren of aflossen, neem dan tijdig telefonisch contact op met één van de partijen: 020 – 606 58 58 (kies 5). Vanaf 12 juni 2023 maken de labels Syntrus Achmea Hypotheken , Attens Hypotheken en Tellius Hypotheken gebruik van het royeren proces van Stichting ECH . Vanaf deze datum werken deze Achmea-labels alleen nog via het Quion systeem. Op de instructiepagina’s van de deelnemers zijn de processen passeren en royeren verder toegelicht. Meer informatie Wil je meer weten over de overgang van Achmea-labels naar Quion of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:39:59Z",
  "source": "ech.nl"
}