{
  "id": "851ee8f7e537605ae2a9853b9928c9bb8261f777",
  "url": "https://www.ech.nl/bestuurswissel-stichting-ech/",
  "title": "Bestuurswissel Stichting ECH - ECH",
  "text": "Bestuurswissel Stichting ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestuurswissel Stichting ECH / Nieuws / Door echadmin Stichting ECH verwelkomt Ed Engelen als nieuw bestuurslid namens de Koninklijke Notariële Beroepsorganisatie (KNB). Ed draait al sinds de zomer mee in het ECH bestuur en heeft formeel op 2 december jl. de bestuurszetel van Remco van der Kuijp overgenomen. Het bestuur van ECH vergadert elke 6 weken en wordt gevraagd en ongevraagd van advies voorzien door de Raad van Advies. Remco van der Kuijp (notaris en bestuurslid bij de KNB) is 5 jaar lang bestuurslid bij ECH geweest. Samen met de andere bestuurders heeft hij zich onder meer ingezet om de onafhankelijke positie van ECH in de keten te versterken. Remco geeft aan: “Het is voor mij een natuurlijk moment om te vertrekken. Ik kijk terug op een mooie vijf jaar waarin ECH een enorme professionaliseringsslag heeft ondergaan. Dankzij het management en met support van het professionele bestuur was het voor mij een plezier om mijn steentje te kunnen bijdragen aan deze transformatie. ECH kan vol vertrouwen kijken naar de toekomst. Ik wens het bestuur van ECH dan ook alle goeds toe. ” Stichting ECH wil Remco van der Kuijp danken voor zijn enthousiasme en alle tijd & aandacht die hij aan Stichting ECH beschikbaar heeft gesteld. Zijn positief kritische blik en verbindende kracht zal gemist worden. Mede dankzij zijn inspanningen is ECH inmiddels financieel gezond en zijn er enorme stappen voorwaarts gezet. Het stokje van Remco wordt doorgegeven aan Ed Engelen. Ed is sinds 2019 bestuurder bij de KNB waar hij de rol vervult van penningmeester. ‘Vanaf begin deze eeuw heeft ECH mijn warme belangstelling en als kandidaat notaris op een (zeer) klein kantoor was ik al een “early adapter”. Ik was destijds vrij snel overtuigd van het belang van het toen baanbrekende initiatief, maar heb nooit kunnen vermoeden dat ik er bestuurlijk betrokken bij zou raken’. Voorop staat het verstevigen van de positie van het notariaat in de digitale vastgoedketen. ECH is daarom van strategisch belang voor de KNB. Stichting ECH wenst Ed veel succes en vooral ook plezier toe. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:31:49Z",
  "source": "ech.nl"
}