{
  "id": "8ae98aa40909bfb3372c19a61a0863fbd23ad19c",
  "url": "https://www.ech.nl/quion-zet-nieuwe-stap-met-aflossen-via-ech/",
  "title": "Quion zet nieuwe stap met aflossen via ECH - ECH",
  "text": "Quion zet nieuwe stap met aflossen via ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Quion zet nieuwe stap met aflossen via ECH / Nieuws , Notaris , Referenties banken / Door echadmin Op 9 maart 2021 sluit Quion aan op het aflosproces van ECH. Hiermee breidt Quion haar digitale communicatie via ECH uit, nadat zij vorig voorjaar ook succesvol werd gecertificeerd voor het passeerproces. Na een pilot met circa twintig notariskantoren is Quion nu klaar om aflossen via ECH aan te bieden aan alle notariskantoren. En dat is goed nieuws voor de hele keten, inclusief de consument. In het passeerproces bleek al hoe veilig en efficiënt de communicatie via ECH met notarissen is. Dit wordt vanuit Quion extra bekrachtigd met deze uitbreiding. Het aflosproces van Quion wordt bovendien klantvriendelijker. Kortom een mooie stap voor alle partijen. De samenwerking tussen Quion en ECH begon vorig jaar maart met  de livegang van het passeerproces. Quion zet al enige tijd vol in op customer experience, verdere digitalisatie en STP. De dienstverlening  van ECH sluit hier perfect op aan. Beide organisaties zijn blij met deze stap. John Smulders, Chief Operating Officer bij Quion: “Ik vind het mooi om het succes van deze samenwerking te zien. In een jaar tijd bieden we onze klanten een volledig geautomatiseerd proces, van  geldverstrekker via het notariaat naar het Kadaster, voor zowel passeren als aflossen. En voor een inschrijving met een KIK akte in het Kadaster. Dit is een nieuwe mijlpaal voor een optimale klantbeleving.” Lisa Huisman, directeur Stichting ECH: “ De aansluiting van Quion op het royementenproces voelt voor mij persoonlijk als de kers op de taart! Sinds enkele jaren werken we plezierig en constructief samen. Dit heeft niet alleen geleid tot een betere klantbeleving, maar ook tot nieuwe werkafspraken en een verbeterde berichtenstructuur én tot een significante toename van het marktaandeel van ECH. We blijven ons gezamenlijk inzetten om de branchestandaard ECH verder te ontwikkelen en te optimaliseren voor de hele keten.” Meer informatie De instructies voor het notariaat vind je vanaf 9 maart op de website van ECH. Bij vragen over dit nieuwsbericht kunnen notariskantoren zich wenden tot de Servicedesk van Stichting ECH . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:09:04Z",
  "source": "ech.nl"
}