{
  "id": "8b5cbe52493cff0a4b56d304c8cd88e837cd69a5",
  "url": "https://www.ech.nl/marktontwikkelingen-ech-knb/",
  "title": "Verandering angstig? Welnee, zolang je maar de kansen ziet! - ECH",
  "text": "Verandering angstig? Welnee, zolang je maar de kansen ziet! - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Verandering angstig? Welnee, zolang je maar de kansen ziet! / Bestuur , KNB , Nieuws , Notaris , Referenties notariaat / Door echadmin ‘Digitaliseren doe je wat mij betreft vooral van buiten naar binnen. Je ziet in de markt al langere tijd allerlei fenomenen ontstaan die lopen van AI tot blockchain en alles daartussen. Wat ik in elk geval als dé tendens naar de toekomst zie, is dat er steeds meer reken- en communicatiekracht in de geautomatiseerde wereld terechtkomt. Daardoor gaat in de menselijke wereld extra ruimte ontstaan voor meer interactie.’ Aan het woord is Hans Kuijpers, directeur van de Koninklijke Nederlandse Beroepsorganisatie, kortweg de KNB. ‘Om het wat oneerbiedig te formuleren, daar waar mensen nu Excel-sheets vullen, wordt dat straks overgenomen door het systeem. En dat betekent dat je meer intermenselijke ruimte krijgt voor de echte noden binnen de samenleving. Denk dan bijvoorbeeld aan meer handen in zorg of onderwijs. Wat mij betreft is digitalisering daarmee dus een goede ontwikkeling. Zeker als je kijkt naar de hoge mate van vergrijzing in onze samenleving. Ik denk dat er als gevolg van de ontzorging die digitalisering met zich meebrengt, meer ruimte komt voor de echt belangrijke levensvragen, zoals in de trant van ‘Hoe willen we eigenlijk met elkaar omgaan in deze maatschappij?’ Deze transitie naar digitaal zal zich bovendien ook vertalen in allerlei hulpmiddelen, waardoor we steeds gemakkelijker informatie elkaar kunnen uitwisselen. En eigenlijk, wanneer je het heel plat slaat, zijn data niets anders dan de voedingsbronnen om machines aan het werk te zetten. En dat inzicht geeft bijna onbegrensde mogelijkheden.’ Hans Kuijpers, directeur van de Koninklijke Notariële Beroepsorganisatie Angst voor digitalisering onnodig ‘De angst die er soms is rondom digitalisering is wat mij betreft echt niet nodig. En ook de angst voor de gevolgen van kunstmatige intelligentie kunnen we wat mij betreft achterwege laten’, vervolgt Hans. ‘Wel denk ik dat het belangrijk is dat we voldoende onderscheid maken tussen de vorm en de inhoud van bepaalde veranderingen. Kijkend naar de markt waarin ik vanuit de KNB opereer, denk ik dat de inhoud van de financiële dienstverleners en notarissen gewoon blijft bestaan. Maar de vorm waarin je dit doet zal wel veranderen. Waar we nu met elkaar nog bezig zijn met Excel-sheets, ga je straks aan de slag met een algoritme en ontstaat er als gevolg daarvan juist meer ruimte voor zoiets menselijks als je onderbuikgevoel. Want op basis van cijfers kun je een klant die een woning wil kopen, één en ander duidelijk maken. Maar als het aan de andere kant cijfermatig niet goed voelt voor die klant dan kun je nog altijd adviseren om de aankoop niet te doen. En dus het afsluiten van een bepaalde woningfinanciering achterwege laten. Kijk, verandering is van alle tijden. Vroeger werkten we met een telraam, daarna kwam bij wijze van spreken Excel en straks werken we met een algoritme. Dat is niet iets om bang voor te zijn, waarom zou je?’ Het grote geheel ‘En zo hangt alles met alles samen. Zo zie je nu bijvoorbeeld een discussie over het thuiswerken dat als een bedreiging wordt ervaren omdat er zoveel kantoren leegstaan. Maar als je wat verder denkt, zou je ook kunnen zeggen dat dit fantastisch is om het tekort in woningaanbod op te vangen. Want in de leegstaande kantoren kunnen met wat aanpassingen hier en daar prima mensen wonen. De coronacrisis is natuurlijk verdrietig door alle gevolgen die dit heeft, maar tegelijkertijd zie je dat er ineens van alles kan wat tot voor kort voor onmogelijk werd gehouden’, zegt Hans. ‘De belemmeringen om zaken niet te veranderen blijken weg te vallen nu we noodgedwongen op afstand met elkaar samenwerken.’ De notaris als betrouwbare partner ‘En ik ben er ook best trots op dat we in maart met het notariaat in staat waren om ons snel aan te passen aan de nieuwe situatie. En daar blijft het niet bij, we hebben zelf vanuit de KNB ook accenten neergezet, die we proactief en zo goed mogelijk gaan invullen. Uiteindelijk staan wij voor een goede beroepsuitoefening door de notarissen, en dat binnen de maatschappelijke context van Nederland. De burger gaat ervan uit dat in Nederland op het gebied van notariële dienstverlening alles goed geregeld en goed georganiseerd is. En dat mag ook. In feite geeft de notaris de burger en rechtspersonen een goede nachtrust. Omdat je zeker weet dat je huis van jou is. En omdat je zeker weet dat, wanneer je er niet meer bent, je geld op de goede plek terecht komt. En omdat je er op kunt vertrouwen dat als je een bedrijf opricht, je zéker weet dat het van jou is. Bij al dat soort grote levensvragen is de notaris betrokken. En ik vind het een eer om daar een kleine bijdrage aan te mogen leveren. En de toekomst? Eigenlijk is de toekomst gewoon heel mooi. Het is van alle tijden dat mensen soms wat angstig zijn over hetgeen er op ze afkomt. Maar uiteindelijk komt het gros van alle veranderingen écht wel op zijn pootjes terecht’, besluit Hans. Meer informatie Wil je meer weten over de marktontwikkelingen en samenwerking tussen de KNB en ECH of over de visie van Hans Kuijpers? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:24:12Z",
  "source": "ech.nl"
}