{
  "id": "8d64f28755b5c1f2a51e75e3869760cbdfe3ac20",
  "url": "https://www.ech.nl/demerger-rnhb/",
  "title": "Demerger RNHB - ECH",
  "text": "Demerger RNHB - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Demerger RNHB / Nieuws / Door Ruby Eind 2016 is de RNHB leningenportefeuille inclusief de bijbehorende organisatie (RNHB business) van fgh/Rabobank overgenomen door een consortium van investeerders bestaande uit carval investors en arrow global. De RNHB business is ingevolge deze overname (tijdelijk) ingebracht in vesting finance servicing b.v., aangezien RNHB b.v. destijds nog niet beschikte over een vergunning voor het aanbieden van hypothecair krediet van de autoriteit financiële markten (afm). De RNHB business wordt zodoende momenteel gevoerd binnen en onder de vergunning van vesting finance servicing b.v. handelend onder de naam RNHB. RNHB b.v. heeft op 30 november 2017 de vergunning ontvangen voor het aanbieden van hypothecair krediet van de autoriteit financiële markten (afm) en kan daarom haar activiteiten zelfstandig voortzetten. Nu RNHB b.v. de vergunning heeft ontvangen, wordt de RNHB business afgesplitst van vesting finance servicing b.v. en vervolgens een dag later gefuseerd met RNHB b.v. Het is beoogd om de akte van afsplitsing waarbij de RNHB business wordt afgesplitst van vesting finance servicing b.v. op donderdag 11 januari 2018 te passeren. Deze wordt effectief op 12 januari 2018 om 00:00 uur. Op vrijdag 12 januari zullen de aandelen in het kapitaal van yellow demerger entity b.v. door vesting finance servicing b.v worden overgedragen aan RNHB b.v. en vervolgens zal de akte van fusie tussen yellow demerger entity b.v. (als verdwijnende vennootschap) en RNHB b.v. (als verkrijgende vennootschap) worden gepasseerd. Deze fusie wordt effectief op zaterdag 13 januari 2018. Vanaf maandag 15 januari 2018 zal RNHB b.v. als zelfstandige vennootschap optreden en leningen verstrekken aan haar bestaande en nieuwe klanten. Wij verzoeken u derhalve vriendelijk om met ingang van maandag 15 januari 2018 de nieuwe standaard hypotheekakte te gebruiken. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:05:08Z",
  "source": "ech.nl"
}