{
  "id": "8e279661b576f8b6c993016a386012708e8046ca",
  "url": "https://www.ech.nl/werkgroepen-ech/",
  "title": "Werkgroepen - ECH",
  "text": "Werkgroepen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Terug naar 'Over ons' Werkgroepen ECH brengt de aangesloten hypothecair financiers en notariskantoren bij elkaar in de vorm van verschillende werkgroepen. Ook de diverse softwareleveranciers worden hierbij betrokken. Tijdens deze bijeenkomsten worden actuele (keten)thema’s met elkaar besproken en procesafspraken gemaakt. Over de werkgroepen ECH brengt hypothecair financiers en notariskantoren bij elkaar om verbetermogelijkheden (onder meer op het gebied van uniformering, standaardisering en efficiency) te bespreken en over de samenwerking tussen hypothecair financiers en notariskantoren afspraken te maken. ECH probeert per kwartaal een werkgroep te plannen waarbij de samenstelling van de werkgroep afhangt van de te behandelen onderwerpen en kan bestaan uit alleen vertegenwoordigers van hypothecair financiers of van notariskantoren of van toeleveranciers of een combinatie daarvan. De doelstelling van de werkgroep is het fungeren als klankbordgroep ten aanzien van een specifiek onderwerp. Dit kan het toetsen van de bestaande inrichting, werking of afspraken ten aanzien van de berichtenstandaard betreffen of het destilleren en uitwerken van wensen en behoeftes tot uitbreiding of aanpassing daarvan. Adviesfunctie De werkgroep neemt geen besluiten maar heeft een adviesfunctie; elke deelnemer aan de werkgroep neemt deel aan de werkgroep op persoonlijke titel. De werkgroep adviseert aan de ECH consultants waarbij desgewenst een meerderheids- en/of minderheidsstandspunt kan worden verwoord. De agenda met eventuele stukken en de verslagen van bijeenkomsten worden aan elke deelnemer verstrekt. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:11:42Z",
  "source": "ech.nl"
}