{
  "id": "8eb7ab92b82d033169110120ded388de0c887f60",
  "url": "https://www.ech.nl/juridische-fusies-lokale-rabobanken-en-rabobank-nederland/",
  "title": "Juridische fusies lokale Rabobanken en Rabobank Nederland - ECH",
  "text": "Juridische fusies lokale Rabobanken en Rabobank Nederland - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Juridische fusies lokale Rabobanken en Rabobank Nederland / Nieuws / Door Ruby De Rabobank moderniseert haar coöperatieve structuur. Een aantal weken geleden bent u door Rabobank op de hoogte gesteld van de gevolgen voor het notariaat middels een nieuwsbericht: Nieuwe gegevens Rabobank bij passeren hypotheekakte . Als aanvulling daarop heeft de Rabobank vandaag het volgende bericht met Stichting ECH gedeeld. Een paar weken geleden heeft Rabobank u laten weten dat per 1 januari aanstaande de lokale Rabobanken juridisch fuseren met Rabobank Nederland. En Rabobank Nederland vervolgens de statutaire naam wijzigt in Coöperatieve Rabobank U.A. Passeert u een akte? Passeert u voor Rabobank een hypotheekakte? Of een andere zekerheidsakte? Bijvoorbeeld een verpanding van een lidmaatschapsrecht in een coöperatieve flatexploitatievereniging. Of een verpanding van aandelen in een b.v. Houd dan rekening met deze juridische fusie en naamswijziging. Wat vraagt Rabobank u ook nog? Het kan tijdelijk zo zijn dat Rabobank in het verzoek tot het opmaken van een hypotheekakte nog niet het juiste adres en/of het juiste postadres vermelden. Rabobank past dit zo snel mogelijk aan. Na het ingaan van de fusie en de naamswijziging vraagt Rabobank om bij het opmaken van de akte het volgende adres en het volgende postadres te vermelden: Coöperatieve Rabobank U.A. statutair gevestigd te Amsterdam Croeselaan 18 3521 CB  Utrecht KvK-nummer 30046259 Postadres: Postbus 221, 5600 MA  Eindhoven Ook als in het verzoek tot het opmaken van de hypotheekakte tijdelijk nog een ander adres en/of een ander postadres word(t)(en) genoemd. Wat gebeurt er met de Rabohypotheekbank N.V.? Zoals Rabobank u eerder lieten weten blijft de Rabohypotheekbank N.V. gewoon bestaan. Wordt de fusie van de lokale Rabobanken ingeschreven in de Openbare Registers? De inschrijving van de fusie in de Openbare Registers staat gepland voor op of omstreeks 1 februari 2016. Een exacte datum waarop de inschrijving van de fusie in de Openbare Registers zal zijn verwerkt, is op dit moment nog niet bekend. Zodra de fusie is ingeschreven en verwerkt, zult u dit zien op het hypothecair bericht object Heeft u nog vragen? Heeft u vragen met betrekking tot een financieringsdossier, neem dan contact met de servicedesk van Rabobank op, op telefoonnummer 088 728 87 28.Heeft u algemene vragen over de nieuwe structuur van de Rabobank, neem dan contact op via mailadres relatiebeheer.scf@rabobank.nl Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:25:48Z",
  "source": "ech.nl"
}