{
  "id": "8fa78a1f13955944ffcaf246cee5cc856d67eb7a",
  "url": "https://www.ech.nl/even-voorstellen-jan-janssens-nieuw-bestuurslid-bij-ech/",
  "title": "Even voorstellen: Jan Janssens - nieuw bestuurslid bij ECH - ECH",
  "text": "Even voorstellen: Jan Janssens - nieuw bestuurslid bij ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Even voorstellen: Jan Janssens – nieuw bestuurslid bij ECH / Bestuur , Directie ECH , ECH medewerkers , Hypotheekmarkt , Nieuws , notarieel software leverancier , Notaris , Raad van Advies , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Jan Janssens, notaris bij het Groningse kantoor Bosscher Janssens notarissen, en bestuurslid van de Koninklijke Notariële Beroepsorganisatie (KNB), heeft een nieuwe rol aangenomen binnen de stichting ECH. Vanuit zijn ervaring bij de KNB en zijn uitgebreide loopbaan in het notariaat brengt Jan een schat aan kennis en visie mee. In dit artikel gaan we dieper in op zijn achtergrond, ambities en persoonlijke drijfveren. Van kandidaat-notaris tot bestuurslid van de KNB Jans’ carrière begon na zijn studie in Groningen. Via functies in Arnhem, Wassenaar en diverse andere plaatsen in Nederland, bouwde hij aan een indrukwekkend portfolio in het notariaat. Sinds 2014 is hij werkzaam bij zijn huidige kantoor, waar hij in 2017 werd benoemd tot notaris. Zijn werk voor de KNB vormt een rode draad in zijn loopbaan, met diverse bestuursrollen en volop betrokkenheid bij de organisatie. De verbinding met ECH De betrokkenheid van Jan bij ECH is een logisch vervolg op zijn werk voor de KNB. “De KNB heeft mij voorgedragen vanwege mijn portefeuille, die mooi aansluit op het werkveld van ECH,” vertelt Jan. Zijn expertise in digitalisering en ondersteuning van de beroepsgroep maakt hem een prima kandidaat om ECH verder te versterken. “ECH speelt een cruciale rol in het stroomlijnen van communicatie tussen notarissen en hypothecair financiers, en ik zie het als een mooie uitdaging om daaraan bij te dragen. Het PEC-platform, waar ECH gebruik van maakt, zag ik destijds in mijn periode bij de KNB in de beginfase ontstaan. Dat ik daar nu weer bij betrokken ben, voelt als een mooie cirkel die rond is.” Een persoonlijke droom Waar Jan van droomt? Van een efficiëntere samenwerking binnen de vastgoedketen. Hij visualiseert een digitaal platform waarin alle partijen – van banken tot notarissen en makelaars – naadloos samenwerken. “Hoe mooi zou het zijn als we de dubbele handelingen in processen kunnen elimineren en informatie eenvoudig kunnen delen via één gezamenlijk portaal?” Deze visie sluit naadloos aan bij de doelen van ECH en vormt een belangrijke drijfveer voor Jan in zijn nieuwe rol. “Ik zie het als een kast met verschillende lades: iedereen voegt informatie toe, en die kan vervolgens eenvoudig gedeeld worden, met respect voor privacy en regelgeving,” licht hij toe. Die droom is overigens niet nieuw. In zijn begintijd bij de KNB schreef hij op het whiteboard van de ICT-afdeling al een duidelijke boodschap: “De droom van Jan.” Het idee van een centrale plek waar alle vastgoedpartijen hun informatie kunnen delen en gebruiken, leeft al sinds de vroege jaren 2000. “Het geeft me energie om te zien dat die visie steeds meer vorm krijgt,” zegt Jan. “Ik hoop daar bij ECH verder aan te kunnen bouwen.” Persoonlijk leven en motivatie Naast zijn professionele activiteiten heeft Jan een rijk persoonlijk leven. Hij is 29 jaar getrouwd en heeft twee volwassen dochters die elk hun eigen weg (en toevalligerwijs dezelfde weg als hun ouders) inslaan: de een als fysiotherapeut, de ander als toekomstig notaris. In zijn vrije tijd geniet Jan van het hockeyveld en brengt hij graag tijd door in Noordwijk waar hij, samen met zijn vrouw, regelmatig te vinden is in hun stacaravan. “Het bestuurswerk is een hobby die veel tijd vraagt, maar het geeft me ook ontzettend veel energie. Noordwijk ligt dicht bij Den Haag en laat daar nu net ECH gevestigd zijn. Dat sluit mooi op elkaar aan,” aldus Jan. Blik op de toekomst Met zijn ervaring, visie en gedrevenheid is Jan klaar om een waardevolle bijdrage te leveren aan ECH. “Ik hoop mijn kennis en ervaring in te zetten om ECH verder te helpen groeien en de digitalisering binnen de sector naar een hoger niveau te tillen.” Met zijn ervaring en toekomstvisie is Jan een frisse wind binnen het bestuur van ECH. “Ik hoop dat mijn droom, een volledig geïntegreerde vastgoedketen, tijdens mijn bestuursperiode een stap dichterbij komt. Dat zou echt fantastisch zijn,” besluit Jan. Meer informatie Wil je meer weten over ECH of haar dienstverlening? Laat het ons weten via info@ech.nl . Samen bouwen we aan de toekomst van ECH! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:06:29Z",
  "source": "ech.nl"
}