{
  "id": "912f36fa5ce21ae4877711285f54e41ecc8b3347",
  "url": "https://www.ech.nl/knb-digitale-hypotheekakte-samenwerking-notariaat/",
  "title": "‘Programma Digitaal Passeren behelst digitale uitrol van álle notariële akten voor álle rechtsgebieden’, Robin Perik, informatiemanager & projectleider bij de KNB  - ECH",
  "text": "‘Programma Digitaal Passeren behelst digitale uitrol van álle notariële akten voor álle rechtsgebieden’, Robin Perik, informatiemanager & projectleider bij de KNB  - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Programma Digitaal Passeren behelst digitale uitrol van álle notariële akten voor álle rechtsgebieden’, Robin Perik, informatiemanager & projectleider bij de KNB / Bestuur , Directie ECH , ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door masselbergs@ech.nl ECH en KNB werken samen aan het project Digitale Hypotheek- en Leveringsakte. In dit artikel lees je vanuit beide invalshoeken meer over dit belangrijke onderwerp dat, voor zowel consument als de andere betrokkenen uit de keten, een groot verschil gaat maken voor, tijdens en ná het passeerproces. Project Digitale Hypotheek- en Leveringsakte onderdeel van KNB-programma Digitaal Passeren ‘Als KNB hebben we het programma Digitaal Passeren lopen en daarbinnen loopt het project Digitale Hypotheek- en Leveringsakte. Het complete programma behelst een uitrol van de digitale notariële akte over alle rechtsgebieden heen.’ Aan het woord is Robin Perik , informatiemanager & projectleider bij de Koninklijke Notariële Beroepsorganisatie, kortweg KNB . ‘De aanleiding voor de start van dit programma komt voort vanuit een Europese richtlijn voor grensoverschrijdende oprichtingen van BV’s. Die richtlijn beschrijft dat BV’s met inzet van digitale middelen, zonder fysieke verschijning, opgericht moeten kunnen worden. Wanneer je dit vertaalt naar Nederlandse wetgeving dan betekent dit dat de akte voor de oprichting van een BV digitaal gepasseerd moet kunnen worden zónder dat men daar fysiek bij aanwezig hoeft te zijn. Hierbij wordt digitaal identificeren op hoog niveau en digitaal gekwalificeerd ondertekenen als betrouwbare optie gezien. De eerste toepassing hiervoor vindt dus plaats met de mogelijkheid om een BV volledig digitaal op te richten’, aldus Robin. ‘In de Europese richtlijn worden uiteraard allerlei aanvullende voorwaarden gesteld, zoals de wijze van identificatie door het gebruik van een elektronisch rechtsgeldig identificatiemiddel. Ook geldt dat het ondertekenen van de akte met een digitaal middel mogelijk moet zijn. Denk dan bijvoorbeeld aan een rechtsgeldige, gekwalificeerde elektronische handtekening. Als KNB zien we de mogelijkheid om, naast fysiek, aktes voortaan ook digitaal te passeren, als een aanvulling op de huidige dienstverlening van de notaris. Het maakt de afstand tussen de cliënt en de notaris kleiner wat ons betreft én het beweegt mee met de steeds verder digitaliserende maatschappij. Digitaal gegevens verstrekken kan hiermee makkelijker vanuit de bron en als je als klant bijvoorbeeld niet in staat bent om fysiek bij de notaris te verschijnen dan kun je straks heel eenvoudig vanaf elke willekeurige locatie een akte laten passeren.’ Robert Jan van Pelt (l) en Robin Perik (r) Groot belang voor ECH Robert Jan van Pelt is, samen met collega’s Floris Beerens en Johan Agterberg , vanuit ECH bij het project betrokken. Hij is sinds juni vorig jaar actief als directeur Change binnen de stichting. Hij vult aan: ‘Het belang van dit project voor ECH is groot. Vanaf zomer vorig jaar hebben wij een changestrategie uitgewerkt, die eerder dit jaar door het bestuur van ECH is goedgekeurd. Daarin zijn een aantal zaken opgenomen die we op de korte en middellange termijn willen realiseren. Hierbij staat verdere digitalisering steeds centraal. Ontwikkelingen zoals elektronische wallets en bijvoorbeeld AI zullen het speelveld van ECH in toenemende mate anders maken. Daar houden we al volop rekening mee bij het zetten van de stip op de horizon. Want we gaan met elkaar naar een andere wereld toe die bol staat van gestructureerde data. Het spreekt dus voor zich dat we enthousiast zijn over het programma dat vanuit de KNB is gestart: we nemen er graag aan deel. Het is een onderdeel van de langetermijnvisie van ECH.’ Samenwerking met ECH erg relevant voor KNB Robin: ‘De samenwerking met ECH is voor ons erg relevant, mede omdat het onderdeel dat gaat over de hypotheek- en leveringsakte, een brede doelgroep kent. We willen, omdat we zien dat er vanuit Europa veel op ons af komt, zeker weten dat we er als notariaat klaar voor zijn om de burger goed te helpen zodat deze optimaal bediend blijft. Of dat nu fysiek op kantoor is of op afstand.’ ‘Om het project goed vorm te geven zetten we allerlei theoretische en praktische stappen. Hierbij kijken we heel zorgvuldig naar voor wie deze marktontwikkeling relevant is en naar hoe deze er dan specifiek uit moet zien. We organiseren designs sessies en werken met proof of concepts en zijn veel in gesprek met relevante ketenpartijen’, aldus Robin. Robert Jan voegt toe: ‘Tussen ECH en KNB bestaat vanzelfsprekend al veel contact, maar we hebben recent besloten om de samenwerking op dit specifieke vlak te intensiveren, door samen een Proof of Concept te definiëren. Onlangs was de kick-off van dit project, waarin we gekeken hebben naar hoe één en ander er qua design concreet uit kan gaan zien. Kortom, we bevinden ons nog in een vroege fase van dit project waarbij we met elkaar vliegend van start zijn gegaan.’ Robin: ‘Klopt, bovendien zijn we eind juni gestart met een klankbordgroep vanuit het notariaat voor wat betreft de digitale notariële hypotheek- en leveringsakte. Samenvattend kunnen we zeggen dat we langzaam overstappen van de verkenning- naar de inventarisatiefase.’ Compliment aan de KNB ‘Ik vind het vanuit mijn rol overigens gepast om een welgemeend compliment aan de KNB te geven. Want zij lopen, ook op dit vlak, alweer ver vooruit op de ontwikkelingen’, zegt Robert Jan. ‘Ik ervaar KNB als een dynamische en energieke organisatie en dat maakt het tot een feestje om samen te werken.’ ‘Dat is een mooi compliment’, glimlacht Robin, ‘maar tegelijkertijd kunnen we het zéker niet alleen. We zoeken heel bewust de samenwerking met anderen in de keten op, waarbij ECH een hele prettige partner is. Uiteindelijk blijven de rechtsgeldigheid en kwaliteit, ook als er straks digitaal allerlei mogelijkheden zijn, gelijk aan hoe het nu is. En dat op een gemakkelijke, meer toegankelijke manier die past bij de wensen van de cliënt. Tegelijkertijd is deze slag voor de hypothecair financiers een verbetering omdat het doen van controles op de inhoud van de akte, vele malen sneller, beter en betrouwbaarder uitgevoerd kan worden.’ Robert Jan: ‘Binnen dit kader zijn we vanuit ECH actief bezig met het opstarten van het project Uniformeren Hypotheekakte. Hierbij proberen we onder andere de honderden model-akten die er nu bestaan terug te brengen tot een meer overzichtelijk aantal.’ Digitale akte is geen doel, maar een middel ‘Toegang tot het recht is een vanzelfsprekendheid en moet dat blijven’, vervolgt Robin. ‘De digitale akte is hiermee geen doel op zich, maar een middel zodat elke burger die recht zoekt, dat ook gemakkelijk kan krijgen. Of dat nu online is, via een videocall óf fysiek bij de notaris op kantoor: het recht moet begrijpelijk en toepasbaar zijn voor élke Nederlandse burger. Bovendien komt er een generatie aan die is opgegroeid in een digitale wereld. We vinden het belangrijk dat ook deze jonge mensen bediend worden op de manier die zij prettig en passend vinden. En daar maken we ons, samen met ECH, dag in, dag uit hard voor.’ Meer informatie Wil je meer weten over het programma Digitale Hypotheek- en Leveringsakte of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:35:12Z",
  "source": "ech.nl"
}