{
  "id": "94facf689a64e9e6c0e9278988fdb6007d68c787",
  "url": "https://www.ech.nl/notarissen/de-nederlandse/",
  "title": "De Nederlandse - ECH",
  "text": "De Nederlandse - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: De Nederlandse Proces: Passeren E-mail: beheer@de-nederlandse.nl Telefoon: 088-422 9141 01 Nieuwsberichten 02 Passeren 03 Royeren Deelnemersinfo De Nederlandse Algemene informatie/nieuwsberichten (kort) Welkom bij De Nederlandse, een nieuwe aanbieder van financieringen voor professionele beleggers in vastgoed. Wij zijn gespecialiseerd in het verstrekken van hypothecaire leningen voor te verhuren woningen en appartementen in Nederland. Wij zijn een Nederlands bedrijf. We kennen de markt goed en snappen wat voor een professional nodig is om te kunnen werken: snel duidelijkheid en overzichtelijke processen. Notarisinstructie passeer proces Passeerproces Passeren nieuwe hypotheken Voor het passeren van nieuwe hypotheken maken wij gebruik van ECH. Nadat de lening finaal akkoord gegeven is, zullen wij u een passeeropdracht sturen via ECH, met daarin de notarisinstructies. De door u opgegeven passeerdatum dient minimaal 4 werkdagen voor passeren doorgegeven te worden. De sluitnota sturen wij u uiterlijk 2 dagen voor passeren toe, en zoveel eerder als mogelijk is. Wij verzoeken u ná passeren van de hypotheek ons binnen drie dagen de passeerbevestiging een afschrift van de hypotheekakte met voetverklaring inclusief inschrijvingsbewijs te verstrekken. Toelichting De Nederlandse is een handelsnaam van DNL1 BV. Wij kunnen de volgende documenttypen ontvangen: pdf. De maximale documentgrootte is 20MB Vragen en opmerkingen Uw mening is belangrijk. Indien u tips, opmerkingen of verbeteringen heeft, kun u die ons laten weten via onderstaande contactgegevens. Contact Voor vragen zijn we bereikbaar op telefoonnummer 088-422 9141. U kunt ons bellen van maandag tot en met vrijdag van 8.30 uur tot 17.00 uur. U kunt ook een e-mail sturen naar beheer@de-nederlands Notarisinstructie r oyementenproces Royementenproces Opvragen aflosnota Aflosnota’s kunt u opvragen via: beheer@de-nederlandse.nl Royementen Royementsverzoeken kunt u opvragen via: beheer@de-nederlandse.nl . Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:10:50Z",
  "source": "ech.nl"
}