{
  "id": "961965b6976211ddc056f56fd3519e07332dc93f",
  "url": "https://www.ech.nl/gebruikersdag-ech-vindt-plaats-op-23-juni/",
  "title": "Gebruikersdag ECH vindt plaats op 23 juni - ECH",
  "text": "Gebruikersdag ECH vindt plaats op 23 juni - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Gebruikersdag ECH vindt plaats op 23 juni / Nieuws / Door Ruby Jaarlijks organiseert Stichting ECH een gebruikersdag voor alle gebruikers van ECH. Het betreft daarbij zowel de notarieel medewerkers als medewerkers van de hypothecair financiers. Ook de Koninklijke Notariële Beroepsorganisatie (KNB) en de notariële s oftwareleveranciers met ECH-integratie worden op deze dag uitgenodigd. Tijdens de gebruikersdag zal ECH informatie geven over de actuele ontwikkelingen (facts & figures, projecten en nieuw aan te sluiten partijen). Vaak worden er sprekers uitgenodigd die wat meer vertellen over de ontwikkelingen die gerelateerd zijn aan ECH dan wel de hypotheekmarkt. Uiteraard is er ook een interactief gedeelte waarbij gediscussieerd kan worden over de werking van ECH, mogelijke verbeteringen aan het systeem en de samenwerking met alle betrokken partijen.Dit jaar zal de gebruikersdag plaatsvinden op donderdag 23 juni 2016 van 13:30 uur tot 17:00 uur . Aanmelden voor deze bijeenkomst is mogelijk via het aanmeldformulier op de ECH-website. We zien uw aanmelding graag tegemoet! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T03:59:17Z",
  "source": "ech.nl"
}