{
  "id": "9698db19b0e3fe7e8029d0c2a5b3661402b48de8",
  "url": "https://www.ech.nl/nationale-nederlanden-voert-verbeteringen-door-in-passeerproces/",
  "title": "Nationale-Nederlanden voert verbeteringen door in passeerproces - ECH",
  "text": "Nationale-Nederlanden voert verbeteringen door in passeerproces - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Nationale-Nederlanden voert verbeteringen door in passeerproces / Nieuws / Door echadmin Nationale-Nederlanden voert een aantal verbeteringen door rondom het passeren van nieuwe hypotheken. We brengen u hier graag van op de hoogte. Meerwerk bij nieuwbouw in passeeropdracht opgenomen Vanaf vandaag vindt u in de passeeropdracht terug hoeveel het meerwerk bedraagt bij hypotheken voor nieuwbouw. Hierdoor wordt het voor u makkelijker om het juiste depotbedrag te berekenen en de juiste middelen bij ons op te vragen. Ook als het meerwerk €0,- bedraagt staat dit in de passeeropdracht. U vindt het meerwerk terug in de passeeropdracht onder ‘Aanvullende instructies’. Af te lossen kredieten opgenomen in apart blok in passeeropdracht Voortaan worden verplicht af te lossen kredieten in een apart blok in de passeeropdracht genoemd. De berichtgeving over af te lossen kredieten voor hypotheken van Nationale-Nederlanden sluit hierdoor beter aan bij de berichtgeving die u gewend bent te ontvangen via ECH. Voor u moet het hierdoor duidelijker zijn welke kredieten verplicht moeten worden afgelost bij het passeren van de hypotheek. Zoals u van ons gewend bent betaalt Nationale-Nederlanden het geld naar u uit, zodat u deze kredieten kunt aflossen bij de desbetreffende partijen. Let op: De bij de passeeropdracht meegestuurde bijlage ‘Passeeropdracht.pdf’ is niet aangepast. Het sluitnota-deel van de passeeropdracht is niet aangepast. De door u verplicht af te lossen kredieten worden daarin nog steeds genoemd onder punt ‘99 – Overige inhouding maatschappij – Af te lossen verplichting’. Meer informatie U vindt meer over het passeren van hypotheken van Nationale-Nederlanden op deze pagina . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:27:10Z",
  "source": "ech.nl"
}