{
  "id": "99ddfd0fab81c27e1c6d7a3ba6d525beb0aa52d6",
  "url": "https://www.ech.nl/notarissen/asn-bank/",
  "title": "ASN Bank - ECH",
  "text": "ASN Bank - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Volksbank N.V. Proces: Passeren & Royeren E-mail: nieuweaanvragen@asnbank.nl Telefoon: 030 – 291 4992 01 Nieuwsberichten 02 Passeren 03 Royeren Deelnemersinfo ASN Bank Algemene informatie/nieuwsberichten (kort) Gewijzigde modelaktes voor ASN Bank, BLG Wonen, RegioBank en SNS Op 1 juli 2025 wijzigt de juridische naam van de Volksbank N.V. naar ASN Bank N . V. . Er komen nieuwe modelaktes voor de merken ASN Bank, BLG Wonen, RegioBank en SNS met versiedatum 01-07-2025 beschikbaar. De modelaktes gelden voor alle aktepasseringen vanaf 1 juli 2025. Voor alle aktepasseringen tot en met 30 juni 2025 kunt u gebruik maken van de bestaande modelaktes met versiedatum 27-06-2023. Toestemming voor een vervolghypotheek Wilt u toestemming om een hypotheek in te schrijven achter een bestaande inschrijving van ons? Stuur ons uw verzoek om toestemming dan via e-mail. Geef daarin dit aan ons door: De naam van onze klanten. Het onderpand waarop onze klanten de vervolghypotheek willen vestigen. De passeerdatum. Gegevens over de nieuwe hypotheek. Soort hypotheek Rangorde Hoogte van de inschrijving Statutaire naam van de geldverstrekker. Is de geldverstrekker niet standaard? Dan vragen we via u misschien extra gegevens van de klant op. Als dat nodig is, dan geven we u meer informatie in onze reactie op uw verzoek. Heeft u vragen? Bel of mail met onze afdeling Beheer met Risico. U kunt ons bereiken op werkdagen van 8.30 uur tot 17.30 uur. Afdeling Regulier Beheer met Risico Telefoonnummer: +31 (0)30 291 49 93 E-mail: regulierbeheer@asnbank.nl Vragen? Heeft u een vraag die hieronder niet wordt beantwoord? Neem dan contact met ons op. We staan voor u klaar. Onze contactgegevens vindt u onderaan deze pagina. Heeft u een technische vraag over het ECH-platform? Neem dan contact op met de ECH servicedesk. E-mail: info@ech.nl of telefoonnummer: 070-3307111. Nieuws Voor het aflossen van een hypotheek bij Verkoop of Oversluiten naar een andere geldverstrekker worden kosten in rekening gebracht. De kosten zijn € 195 per hypotheek met een maximum van € 390. Deze kosten worden vermeld op de aflosnota. Veel gestelde vragen (Royeren) Tot wanneer kan ik uiterlijk een aflosverzoek insturen? Om de aflosnota op tijd aan te kunnen leveren, vragen we u een aflosverzoek uiterlijk 15 werkdagen voor de gewenste aflosdatum in te sturen. Een uitzondering kan bij spoed gemaakt worden, neem dan contact met ons op. Houd het ECH zaaknummer bij de hand. Wanneer ontvang ik de aflosnota? U ontvangt de aflosnota 5 werkdagen voor de passeerdatum van ons. Kan ik de aflosnota nog gebruiken als de passeerdatum opschuift? Als de passeerdatum opschuift met uiterlijk 5 dagen, kunt u de aflosnota nog gebruiken. Tel dan de dagrente voor elke extra dag bij het af te lossen bedrag op. Is de passeerdatum vervroegd? Trek dan de dagrente eraf voor het aantal dagen dat het is vervroegd. Zitten er meer dan 5 dagen tussen? Stuur dan een aflosverzoek met een aangepaste passeerdatum. De klant wenst (alsnog) de (bank)spaarpolis te verrekenen, is dit mogelijk? Een (bank)spaarpolis mag verrekend worden. In uw aflosverzoek kunt u aangeven dat u de (bank)spaarpolis wilt verrekenen. Geef in de velden aan dat het om een (bank)spaarpolis gaat. Heeft u geen polisnummer? Vul dan 0000 in. Vervolgens kunt u de taak verder afronden. Kan een externe polis verrekend worden op de aflosnota? Dit kan alleen als de klant de hypotheek anders niet kan aflossen. Is er sprake van een tekort om de hypotheek te kunnen aflossen, geef dit dan uitdrukkelijk aan in uw aflosverzoek. Laat de financieel adviseur voor meer informatie mailen naar regulierbeheer@asnbank.nl . Hoe dien ik een royementsverzoek voor een ASN Duurzame Financiering (zakelijke financiering) in? Het verzoek stuurt u rechtstreeks naar de verwerkende afdeling. Het is niet mogelijk het verzoek via ECH in te dienen. Gebruik voor het indienen van een royementsverzoek voor een ASN Duurzame Financiering het mailadres duurzame.financieringen@asnbank.nl . Notarisinstructie passeerproces Passeeropdracht In de passeeropdracht geven wij het offertenummer mee als kenmerk maatschappij. Melden passeergegevens Natuurlijk proberen we alle verstrekkingsnota’s op tijd te leveren. We vragen u daarom om de passeerverzoeken uiterlijk 5 werkdagen voor passeren in te dienen. Sluitnota/Passeeropdracht – Melden gelden Indien mogelijk ontvangen wij de specificatie via melden gelden direct met het doorgeven van de passeerdatum. Wanneer melden gelden niet verplicht is volstaat het om een nota van afrekening als bijlage te sturen. Passeerbevestiging Na het passeren stuurt u via ECH de hypotheekakte en het bewijs van inschrijving naar ons. U hoeft geen kopie per post of per mail aan ons te sturen. Aandachtspunten maatschappij Als ketenpartner werken wij graag met u samen. Uw mening is daarbij erg belangrijk. Heeft u opmerkingen of ziet u mogelijkheden om de samenwerking te verbeteren? Dan komen wij graag met u in gesprek via onderstaande contactgegevens. Contact: Afdeling Verstrekken & Activeren Telefoonnummer: 030-291 4992 E-mail: nieuweaanvragen@asnbank.nl Correspondentieadres: Postbus 924 3500AX Utrecht Notarisinstructie royementenproces Verzoek aflosnota Stuur een aflosverzoek uiterlijk 15 werkdagen voor de gewenste aflosdatum in. Dan kunnen we u de aflosnota 5 werkdagen voor aflossen toesturen. Dit kan iets langer duren bij gedeeltelijke aflossingen, afkoop van verpandingen en als we nog stukken moeten opvragen. Let op: Wilt u een aflosdatum later wijzigingen? Dan kan dit niet met een wijzigingsbericht. Stuur dan een nieuw verzoek in hetzelfde ECH dossier in. Aflosverzoek met spoed Heeft u onverwachts met spoed (voor vandaag of morgen) een aflosnota nodig? Bel ons dan en geef het aangemaakte ECH zaaknummer door. Als het kan, pakken we uw verzoek dan met voorrang op. Wij zijn bereikbaar op telefoonnummer 030-291 4993. Algeheel / gedeeltelijk royement U kunt voor dezelfde klant meerdere royementsverzoeken van hetzelfde merk in één aflosverzoek bij ons opvragen. Een gedeeltelijk royement vraagt u op voor een overbruggingskrediet. Of als een gedeelte van het onderpand uitgeschreven moet worden. Geef daarbij specifiek door wat er overgedragen wordt en hoeveel de opbrengst gaat zijn. Extra informatie kunt u meesturen als bijlagen of met een wijzigingsbericht. Verpandingen Moeten er verpande zekerheden verrekend worden op de aflosnota? Vermeld dit dan bij uw aflosverzoek. De regels voor verrekening verschillen voor interne en externe verpande zekerheden. Interne verpande zekerheden Spaarrekeninghypotheken (SEW), Beleggingsrekeninghypotheken (BEW) en Spaarhypotheken kunnen altijd verrekend worden met de aflosnota.  Vermeld dit meteen bij uw aflosverzoek om dubbel werk te voorkomen. Bent u dit vergeten? Dan kunt u nog wel een wijzigingsbericht nasturen om een interne verpanding alsnog te laten verrekenen. U krijgt dan een nieuwe aflosnota. Heeft u geen polisnummer? Vul dan bij het polisnummerveld 0000 in. Bij de overige velden vult u de naam van de interne verpande zekerheid in die u wenst te verrekenen. Externe verpande zekerheden Externe verpande zekerheden kunnen alleen verrekend worden op de aflosnota als de klant een tekort heeft en de hypotheek anders niet kan aflossen. Let op: de afkoop van externe verpande polissen kan tot 6 weken duren. Daarvoor moet de verpande polis afgekocht worden. Wilt u een externe verpande polis laten verrekenen of zijn er vragen over de afkoop van de verpande polis? Laat de Financieel adviseur dan contact opnemen met afdeling Polisbeheer. Zij zijn bereikbaar via e-mail: regulierbeheer@asnbank.nl , of bel: 030-291 4993. Hebben we de gelden van de polismaatschappij nog niet ontvangen? Dan ontvangt u eerst een aflosnota zonder verrekening. Zodra we de gelden ontvangen hebben, passen wij de aflosnota aan met verrekening. Wijzigingsbericht, bijlage of nieuw aflosverzoek Stuurt u aanvullende of gewijzigde informatie in een bestaand royementsverzoek? Dan sturen wij altijd een nieuwe aflosnota en getekende royementsvolmacht. Ook als er inhoudelijk geen wijzigingen zijn. Getekende volmacht voor royeren U ontvangt u de royementsvolmacht meestal gelijk met de aflosnota. Soms moet u hiervoor eerst de nota van afrekening naar ons toesturen. In dat geval krijgt u hierover een bericht van ons. Overmaken van het af te lossen bedrag Op de aflosnota vindt u de betaalrekening waarnaar u het af te lossen bedrag kunt overmaken. Ook staat het betalingskenmerk erop. Staan er meerdere betalingskenmerken op de aflosnota? Maak de bijbehorende bedragen dan los van elkaar over. Om vertraging te voorkomen. Als de passeerdatum verandert Op de aflosnota staat de dagrente. Als de passeerdatum opschuift of is vervroegd met uiterlijk 5 werkdagen, verreken dan de dagrente met het af te lossen bedrag. Scheelt de passeerdatum meer dan 5 werkdagen met de oorspronkelijke passeerdatum? Stuur dan een aflosverzoek met een aangepaste datum voor een nieuwe nota. Dit kan onder hetzelfde ECH zaaknummer in een nieuwe ECH zaak. Maakt u een nieuwe ECH zaak aan? Stop dan het oude verzoek. Let op: een wijzigingsbericht met een nieuwe aflosdatum is niet mogelijk Als de aflossing niet doorgaat Gaat de aflossing voor onbepaalde tijd niet door? Sluit het dossier dan en stuur te zijner tijd een nieuw verzoek in met een nieuw ECH zaaknummer. Akkoord royement +/- 10 Werkdagen nadat we het af te lossen bedrag hebben ontvangen krijgt u een akkoord voor het royement. Was de hypotheek al ingelost? Dan ontvangt u het akkoord royement gelijk met de aflosnota. Heeft u dit niet gekregen? Stuur dan een wijzigingsbericht op ECH. Heeft u vragen of opmerkingen? Of ziet u mogelijkheden om de samenwerking te verbeteren? Dan horen we dat graag. Uw mening vinden we belangrijk. U kunt ons bereiken op onderstaande contactgegevens. Contact: Volksbank N.V. Royeren, Verkoop of Extern Oversluiten (Afdeling Regulier Beheer ASN Bank) Telefoonnummer: 030-291 4993. E-mail: regulierbeheer@asnbank.nl Royeren Intern oversluiten (Afdeling Verstrekken en Activeren ASN Bank) Telefoonnummer 030-291 4992. E-mail: nieuweaanvragen@asnbank.nl Correspondentieadres: Postbus 924 3500 AX Utrecht Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:36:57Z",
  "source": "ech.nl"
}