{
  "id": "9ae5ece8240534674f062ea1df060e1126eadd76",
  "url": "https://www.ech.nl/nextlegal-over-optimale-klantbediening-met-ech/",
  "title": "‘Minder rompslomp en een óptimale klantbediening dankzij integratie met ECH’ - ECH",
  "text": "‘Minder rompslomp en een óptimale klantbediening dankzij integratie met ECH’ - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Minder rompslomp en een óptimale klantbediening dankzij integratie met ECH’ / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Het de gebruiker zo gemakkelijk mogelijk maken, dat is een belangrijk doel van onze software. En de samenwerking met ECH? Die sluit daar naadloos op aan. ‘We werken niet voor niets al jaren met ze samen.’ Aan het woord is Taco van Bennekom , consultant binnen NEXTlegal , een bedrijf dat zich richt op software voor de advocaat, notaris en bedrijfsjurist. En dat al meer dan 20 jaar. Taco van Bennekom, Consultant bij NEXTlegal Automatische koppeling ‘In de praktijk betekent de integratie met ECH in onze software dat, wanneer er een nieuwe ECH-zaak binnen komt, deze direct gekoppeld kan worden aan een bestaande zaak. Of er wordt een nieuwe geopend. Vervolgens worden de juiste partijen, die herleid worden vanuit ECH, alvast aan het dossier gekoppeld. Datzelfde doen we bijvoorbeeld met het onderpand en met de overige bank- en klantgegevens’, vervolgt Taco. ‘Door de verschillende taken met elkaar te integreren voorkom je een enorme papierwinkel: alles wordt zoveel mogelijk ineens, op digitale wijze, verstuurd naar de juiste partij.’, zegt Taco van Bennekom, Consultant bij NEXTlegal Soepele communicatie ‘Door deze werkwijze verloopt de communicatie tussen de verschillende partijen heel soepel. Wanneer de notaris bijvoorbeeld vanuit ECH een bericht krijgt dat er een bepaald dossier binnen is, dan start er voor alle betrokken partijen een reeks van werkzaamheden op. Denk onder meer aan het doorgeven wanneer de akte daadwerkelijk passeert (notaris), het verzorgen van de definitieve passeeropdracht (de bank), het opvragen van gelden (notaris), maar ook het oppakken van alle verplichte communicatie die met de bank moet plaatsvinden. Eigenlijk kun je ECH als de verbindende factor tussen de client, de banken en het notariskantoor zien. Uiteindelijk wordt de notariële akte getekend en worden er, wederom via dat slimme, geautomatiseerde berichtenverkeer, de bijbehorende processen bij de bank in gang gezet. Door de verschillende taken met elkaar te integreren voorkom je een enorme papierwinkel: alles wordt zoveel mogelijk ineens, op digitale wijze, verstuurd naar de juiste partij.’ Iedereen in de keten heeft iets nodig ‘Binnen de keten komt heel duidelijk het mooie van de samenwerking naar voren die ECH met ons, maar ook met andere leveranciers heeft. Iedereen in de keten heeft iets nodig, de bank, de notaris, de consument. En juist omdat zowel ECH als spreekwoordelijke digitale snelweg en wij vanuit onze rol als softwareleverancier tussen de verschillende partijen zitten, en goed met elkaar afgestemd hebben over hoe we zaken slimmer aan kunnen pakken, hebben we gezamenlijk minder werk met het voldoen aan alle verzoeken. Terwijl de klant tegelijkertijd wél optimaal geholpen wordt.’ Professioneel team ‘Verder is de samenwerking met de mensen van ECH gewoon heel fijn. Ze zijn professioneel, weten precies waar ze mee bezig zijn en ze staan náást ons vanuit een gelijkwaardige rol’, aldus Taco. ‘Daarnaast is het gros van de ECH-collega’s afkomstig uit het notariaat. En dat merk je aan alles. Het zijn niet per se allemaal IT’ers, maar ze hebben, vanuit hun achtergrond als kennisspecialist, een enorme passie voor hun vak, precies zoals dat binnen onze organisatie ook zo is.’ De notaris als vertaler ‘Uitdagingen zijn er natuurlijk ook. Zo hebben banken nog allemaal hun eigen hypotheekaktemodel. Daar zit een enorme kans om te uniformeren, waardoor de verwerking gemakkelijker wordt. Daardoor krijgt de notaris op zijn beurt dan weer meer tijd om het gesprek met de klant aan te gaan en nóg diepgaander advies te geven. En om vroegtijdig in een proces in te grijpen als het nodig is. Uiteindelijk kun je zeggen dat één van de belangrijkste taken van het notariaat is om te vertalen. De notaris vertaalt feitelijk de oplossing voor iemands menselijk probleem in een juridisch goed geformuleerde akte. Vervolgens wordt deze weer terugvertaald, zodat de klant begrijpt wat er staat én met een gerust hart weer het pand verlaat.’ Ontwikkelingen op de agenda ‘Uiteraard staan er volop ontwikkelingen op de agenda. Zo heeft ECH met de digitalisering en automatisering van de bankgarantie een nieuw proces opgeleverd. Het spreekt voor zich dat we daar graag op aansluiten. Samenvattend kan ik zeggen dat we blijven doorontwikkelen en continu onderzoeken naar hoe we de notaris en de consument nóg beter kunnen bedienen. En in dat onderzoek, daar spelen we samen met ECH graag een impactvolle rol in’, besluit Taco. Meer informatie Wil je meer weten over de de visie van Taco van Bennekom of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:08:14Z",
  "source": "ech.nl"
}