{
  "id": "9b05e963237c237da6ff3385fcaaa2e0407453d9",
  "url": "https://www.ech.nl/ech-wijzigt-deadlines-royementenproces-en-layout-aflosnota/",
  "title": "ECH wijzigt deadlines Royementenproces en layout aflosnota - ECH",
  "text": "ECH wijzigt deadlines Royementenproces en layout aflosnota - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH wijzigt deadlines Royementenproces en layout aflosnota / Nieuws / Door Ruby Met ingang van vrijdag 3 april 2020 gelden er nieuwe deadlines in het royementenproces en zal de weergave van aflosnota’s veranderen. Vanaf dat moment vragen we het notariaat om royementsverzoeken niet eerder dan 2 maanden voor de aflosdatum in te dienen. De maatschappijen sturen aflosnota’s vanaf dan uiterlijk 5 werkdagen voor de aflosdatum aan de notaris. Met deze nieuwe termijnen creëert ECH uniformiteit en verruiming van de verwerkingstermijnen in het aflosproces voor al haar gebruikers. ECH is zo ingericht dat de taken die de maatschappij en de notaris hebben in de afhandeling van een proces, worden uitgevoerd door het verzenden van een bericht aan de wederpartij. Elke taak kent een deadline voor de uitvoering. Deadlines zijn geïntroduceerd om beide partijen (notaris en maatschappij) voldoende gelegenheid te geven hun opvolgende werkzaamheden uit te voeren. Gebruikers hebben inzichtelijk wanneer een deadline nadert, maar deadlines zijn in ECH niet dwingend in die zin dat het systeem blokkeert bij overschrijding van een termijn. Berichten kunnen altijd worden verzonden, zodat in uitzonderingssituaties ook spoedverzoeken afgehandeld kunnen worden. Gebruikers van ECH bij zowel maatschappijen als notarissen kunnen elkaar erop aanspreken als zij zich niet aan de deadlines houden. Aanleiding wijziging deadlines Gebruikers van ECH hebben aangegeven dat de huidige deadlines in het aflosproces niet in overeenstemming zijn met de behoefte in de praktijk. De termijn voor het aanleveren van de aflosnota bleek in de praktijk regelmatig te kort voor tijdige verwerking en publicatie aan de cliënt door de notaris. De termijn voor het aanleveren van het verzoek aflosnota is voor enkele maatschappijen te ruim. Nieuwe werkwijze deadlines De nieuwe aanlevertermijn voor het verzoek aflosnota is vanaf 2 maanden tot uiterlijk 15 werkdagen voor aflosdatum. De uiterste datum verandert dus niet ten opzichte van de huidige deadline. Wel nieuw is dat de notaris niet eerder dan 2 maanden voor de aflosdatum deze taak mag uitvoeren. De aflosnota en getekende royementsvolmacht zullen uiterlijk 5 werkdagen voor de aflosdatum aan de notaris beschikbaar worden gesteld. Met deze nieuwe termijnen creëert ECH uniformiteit in het aflosproces en ontstaat er meer ruimte om de vervolgtaken af te handelen. De nieuwe termijnen worden zichtbaar bij zaken waarin het royementsverzoek op 3 april of later is ingediend. Raadpleeg onze website voor een overzicht van alle deadlines. Vernieuwde layout aflosnota Vanaf 3 april zal ook de weergave van aflosnota’s veranderen. Met name de leesbaarheid wordt verbeterd. Bijvoorbeeld door bepaalde gegevens dikgedrukt weer te geven. Ook zullen bedragen als positief of negatief getoond worden in plaats van met een indicatie debet of credit. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:22:21Z",
  "source": "ech.nl"
}