{
  "id": "9b6e158eb5afbbdebd6dd0b04287b306b2bc8a95",
  "url": "https://www.ech.nl/rabobank-en-ech-stellen-klant-centraal-in-digitalisering/",
  "title": "Digitalisering als gezamenlijke reis met de klant centraal - ECH",
  "text": "Digitalisering als gezamenlijke reis met de klant centraal - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Digitalisering als gezamenlijke reis met de klant centraal / Nieuws , Referenties banken / Door echadmin ‘Wanneer je kijkt naar de hypotheekmarkt dan is het bieden van inzicht, gemak en snel zekerheid krijgen voor de eindklant hetgeen waar we alles aan ophangen. Zo is mijn belangrijkste KPI bijvoorbeeld direct gerelateerd aan de doorlooptijd voor de klant die een woningfinanciering afsluit. Want dat levert uiteindelijk blije klanten op en voor de bank tegelijkertijd een lagere kostprijs. Aan het woord is Jolanda de Heer als Area Lead Aanvraag en Afsluiten Hypotheken actief binnen Rabobank én bestuurslid binnen stichting ECH. ‘Daarom kijken we steeds naar waar de verspilling in het proces zich bevindt, met als doel de verwerkingstijd en doorlooptijd te verkorten. Want dat wil je, naast het omhoog krijgen van de kwaliteit van het proces. Dat scheelt immers veel checks die weer een langere doorlooptijd met zich meebrengen. Daarnaast verhoog je de risico’s in een proces aanzienlijk op het moment dat je veel handmatige stappen hebt binnen dat proces. Als je klanttevredenheid wilt verhogen, elimineer je de handmatige stappen zoveel mogelijk.’ Digitalisering ECH en Rabobank: snelle cyclus van belang ‘En natuurlijk, dat is best wel een uitdaging in de wereld van financiële dienstverlening. Vanuit een groene weide ontwikkelen is niet altijd mogelijk, maar tegelijkertijd is samen met die klant denken over wat er beter kan nog altijd het beste wat je kunt doen. Vóór de klant denken is sowieso niet meer van deze tijd, met je eindgebruiker aan de tekentafel zitten wél. Zo nodigen wij klanten uit in een laboratorium waarin een bepaald prototype kan worden getest, de klant is daarbij de eindgebruiker of de interne gebruiker in de rol van een collega. Zo testen wij bijvoorbeeld nieuwe software nog voordat we ermee starten en daarnaast werken we in sprints en reviewen we in een tweewekelijkse cyclus. Dat moet ook wel om de vaart er in te houden. Je kunt immers heel lang ontwikkelen en de boot misschien missen of je kunt iets na een maand live zetten, waardoor je een snelle feedbackloop krijgt. En dat is wat je wilt anno nu. Alleen al daarom werken we binnen de Rabobank vanuit de ‘continu verbeteren loop’. Deze aanpak houdt het ontwikkelingsproces goed op gang.’ Houd de energie vast ‘Ik zie om me heen soms dat er maanden gewerkt wordt aan een Rolls Royce-oplossing, die wanneer deze eenmaal op de markt is, al achterhaald blijkt. Perfectie is er nooit en er is altijd wel iets om te verbeteren. Het gevaar van heel stroperig zijn is dat mensen uiteindelijk afhaken en het energielevel daalt. Ik geloof dat het juist heel erg belangrijk is om, kijkend vanuit die intrinsieke motivatie vanuit je DNA vast te houden aan hoe het morgen weer beter kan’, vervolgt Jolanda. ‘En dat bereik je alleen door het gesprek met elkaar te voeren en oprechte interesse te tonen. Wanneer je niet openstaat dan kun je niet samen een ontwikkelproject in. Voor mij is dan ook de kernboodschap: dat de klant of de interne gebruiker centraal staat en dat de kracht zit in de wendbaarheid om snel verbeteringen in het klantproces door te voeren. En wendbaarheid gaat nu eenmaal met vallen en opstaan. Tegelijkertijd gaat het ook over verwachtingsmanagement. Wanneer iemand iets aan je vraagt en het is voor jou op dat moment niet waar te maken in de ontwikkelcyclus dan is het echt de toon die op dat moment de muziek maakt. Die kan toch positief zijn, bijvoorbeeld door te benadrukken wat er op dat moment wél kan. Daarnaast geloof ik heilig in het meenemen van je belangrijkste stakeholders waarbij je vanuit een perspectief van storytelling bekijkt waar je naartoe wilt en wat daarbij je grootste uitdagingen zijn. Digitalisering is wat mij betreft een gezamenlijke reis. Maar dan wél een reis met de eindklant, intern of extern, helder op het netvlies.’ Wil je meer weten over hoe Rabobank en ECH de klant centraal stellen in digitalisering? Neem dan contact met ons op via info@ech.nl Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T04:03:56Z",
  "source": "ech.nl"
}