{
  "id": "9f8bd2e926e247b1bee048f4e7389daf3518d936",
  "url": "https://www.ech.nl/ech-internetapplicatie-ondersteunt-ech-4-0/",
  "title": "ECH internetapplicatie ondersteunt ECH 4.0 - ECH",
  "text": "ECH internetapplicatie ondersteunt ECH 4.0 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH internetapplicatie ondersteunt ECH 4.0 / Nieuws / Door Ruby Vanaf vandaag zijn de nieuwe functies van ECH 4.0 in de ECH internetapplicatie beschikbaar. Stichting ECH heeft met ECH 4.0 haar grootste project ooit afgerond. ECH 4.0 is een verzameling van wensen die de afgelopen jaren zijn ingebracht door hypothecair financiers en notariskantoren. Deze samenvatting geeft een beeld van de verbeteringen die worden doorgevoerd in ECH. De passeeropdracht De term definitieve passeeropdracht verdwijnt. Deze naam blijkt voor verwarring te zorgen bij de varianten waarbij er geen voorlopige passeeropdracht wordt verzonden. De duiding “definitieve” vervalt. Vanaf nu is er binnen ECH sprake van de “voorlopige passeeropdracht” en de “passeeropdracht”. Bij de (voorlopige) passeeropdracht wordt (meestal) een invulinstructie meegestuurd door de hypothecair financier. In ECH 4.0 introduceert stichting ECH een gestructureerde invulinstructie. Deze nieuwe manier van het versturen van de invulinstructie verkleint het handwerk voor notariskantoren die gebruik maken van een notarieel softwarepakket. Invulvelden kunnen automatisch worden gevuld met de juiste informatie en dit voorkomt handmatig overnemen van gegevens. Deze functie is niet beschikbaar voor notariskantoren die gebruik maken van de ECH webclient. Binnen de passeeropdracht kunnen hypothecair financiers nu ook op een uniforme wijze aanvullende instructies meesturen richting het notariskantoor. Een andere verbetering in de (voorlopige) passeeropdracht heeft betrekking op de hypotheekrECHten. Het is in ECH 4.0 mogelijk om verschillende hypotheekrECHten en onderpanden te definiëren. Ook is hierbij een rangorde aan te geven. Daarnaast is het in ECH 4.0 verplicht het inschrijfbedrag, de opslag en het totaalbedrag apart te specificeren. Hiermee is deze opgave uniform vanuit alle hypothecair financiers en wordt onduidelijkheid voorkomen. Melden passeergegevens Het notariskantoor kan in ECH 4.0 een reeds doorgegeven passeerafspraak annuleren. Het is hierdoor niet meer nodig om een fictieve datum in te vullen of buiten ECH te communiceren. Verder heeft de notaris hier de mogelijkheid om aan te geven dat er helemaal geen gelden nodig zijn. Melden gelden Voor de hypothecair financier is het in ECH 4.0 mogelijk om in de (voorlopige) passeeropdracht aan te geven dat de taak melden gelden verplicht uitgevoerd moet worden. In deze situatie moet het notariskantoor de gelden specificeren of aangeven dat er géén gelden nodig zijn. De notaris heeft de mogelijkheid om aan de hypothecair financier te laten weten hoeveel eigen middelen van de cliënt aangewend worden bij het passeren van de akte. Passeerbevestiging Het bericht bewaardersverklaring krijgt een andere naam. Dit bericht zal in ECH 4.0 passeerbevestiging gaan heten. Inhoudelijk veranderen er ook een aantal zaken. Zo wordt voortaan ook de werkelijke passeerdatum meegegeven in het bericht en stuurt het notariskantoor ook de hypotheekakte en notarisverklaring digitaal mee. Hierdoor verdwijnt het laatste stuk papier uit het passeerproces via ECH. Overige verbeteringen In ECH 4.0 is het voor notariskantoren mogelijk om “gedelegeerd” te werken. Een kantoor kan dan het werk voor een gelieerd kantoor (bijvoorbeeld een nevenvestiging of label) uitvoeren. ECH zorgt dat het bericht op de juiste plaats ontvangen wordt. Hierdoor hoeven hypothecair financiers niet handmatig te zoeken naar welk van de gelieerde kantoren de passeerzaak gestuurd moet worden. Tot slot zijn er wat kleine verbeteringen doorgevoerd. Zo zijn er veldlengtes aangepast en zoveel mogelijk aangepast aan andere bronnen, zoals hdn en brp. Ook zijn sommige keuzelijsten opgeschoond of verwijderd. ECH geeft in 4.0 ook de mogelijkheid om een gehele zaak in pdf te downloaden ten behoeve van het digitaal archief. Bovenstaande punten zorgen voor een verbetering van het proces voor zowel hypothecair financier als notariskantoor. De (softwareleveranciers van) aangesloten partijen zijn hard aan het werk om de nieuwe functies in te bouwen. Daarom is er een overgangsperiode naar ECH 4.0 tot 31 december 2018. Tot die datum is ook ECH 3.1 nog beschikbaar. Vanaf 1 januari 2019 moeten alle partijen over zijn op de nieuwe versie. KNB servicedesk Bij onduidelijkheden kunt u de antwoorden op veel gestelde vragen raadplegen of contact opnemen met de KNB servicedesk via telefoonnummer 070 330 71 35. Gedelegeerd werken U kunt bij ons een aanvraag indienen om zaken voor een gelieerd kantoor af te handelen. In dat geval kunt u rECHtsboven ook meerdere vestigingen selecteren en is het wél mogelijk om zaken voor die vestigingen af te handelen. U kunt hiervoor een email sturen aan functioneelbeheer@ECH.nl. Wij nemen dan binnen 10 werkdagen contact met u op. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:07:29Z",
  "source": "ech.nl"
}