{
  "id": "a05d5f03aca2b3b0ed914694369e2f2a9d132921",
  "url": "https://www.ech.nl/stichting-ech-notariaat-tips-tricks-ech-deel-2/",
  "title": "Stichting ECH & Notariaat: tips & tricks ECH (deel 2) - ECH",
  "text": "Stichting ECH & Notariaat: tips & tricks ECH (deel 2) - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Stichting ECH & Notariaat: tips & tricks ECH (deel 2) / Nieuws / Door echadmin Stichting ECH maakt digitale communicatie mogelijk tussen het notariaat en geldverstrekkers op een veilige en gestandaardiseerde manier. Om ervoor te zorgen dat de communicatie tussen hypothecair financiers en het notariaat nog efficiënter kan verlopen, geeft Johan Agterberg (consultant bij Stichting ECH) een aantal Tips & Tricks. VERSTUREN VAN MELDEN GELDEN – WANNEER WEL EN WANNEER NIET? In het passeerproces van ECH dient u als notaris in het bericht ‘Melden Passeergegevens’ aan te geven of u wel of niet de op te vragen gelden specificeert. Maar wist u al dat de hypothecair financier in de Passeeropdracht aangeeft of zij de benodigde gelden gespecificeerd wil ontvangen? Indien de hypothecair financier het niet nodig acht om de gelden gespecificeerd te ontvangen, dan hoeft u de ‘Melden Gelden’ niet te versturen. U kunt dan in de ‘Melden Passeergegevens’ aangeven dat u het beschikbare bedrag nodig heeft. Hiermee komt de taak ‘Melden Gelden’ te vervallen en voorkomt u dat de hypothecair financier op dit bericht moet wachten, zij kan direct de Sluitnota versturen. Dit versnelt het gehele passeerproces! HET VERWERKEN VAN EEN AFLOSNOTA – HET LIEFST IN MEERDERE BETALINGEN! Een belangrijke voorwaarde voor een algeheel royement is uiteraard dat alle leningdelen die onder het hypotheekrecht vallen geheel worden afgelost. De bijkomende vraag is hoe de notaris herkent of die aflossing dan in één of meerdere betalingen moet geschieden? Als er sprake is van meerdere hypotheken, dan kan een maatschappij deze elk afzonderlijk opnemen in de aflosnota die via ECH wordt verstuurd. Hierdoor is het voor de debiteur duidelijk welke hypotheken er worden afgelost en wat per hypotheek de specificatie van het te betalen bedrag is. Voor de debiteur is het daardoor makkelijk om de opgave te controleren aan de hand van diens eigen administratie. In alle jaaropgaven en online hypotheekdossiers zijn immers ook de diverse hypotheken separaat opgenomen. In de aflosnota kan voor elke hypotheek separaat het (sub)totaalbedrag, het IBAN en het betalingskenmerk worden vermeld. Hieraan kan de notaris gemakkelijk herkennen of de overboeking van de aflossing uiteindelijk in één of meerdere betalingen moet plaatsvinden. Geeft een maatschappij aparte betalingskenmerken mee? Zorg er dan in ieder geval voor dat u de betalingen ook daadwerkelijk apart verricht. Het combineren van betalingen met verschillende betalingskenmerken leidt tot administratieve problemen. VERSTUREN VAN DE PASSEERBEVESTIGING VIA ECH Sinds de ingebruikname van ECH 4.0 in 2018 is het mogelijk om via ECH het afschrift van de hypotheekakte en de bijbehorende notarisverklaring te versturen. Hiermee is het niet meer nodig om het afschrift en de notarisverklaring per post te versturen. Dit voorkomt extra kosten aan de kant van het notariaat. Denk bijvoorbeeld aan frankeringskosten. Ook voorkomt dit extra behandeltijd aan de kant van de hypothecair financier. Deze dient na ontvangst namelijk na te gaan of de akte die per post is binnengekomen, wellicht ook al via ECH is ontvangen. Wilt u meer weten over de Tips & Tricks binnen ECH voor u als notariskantoor? Of heeft u zelf nog tips voor het gebruik van ECH? Neem dan contact met ons op via info@ech.nl. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:29:48Z",
  "source": "ech.nl"
}