{
  "id": "a2247d43dbb5dd67087541ed160b4702172d1eed",
  "url": "https://www.ech.nl/digitalisering-binnen-de-financiele-keten-is-gewenste-ontwikkeling/",
  "title": "‘Digitalisering binnen de financiële keten is gewenste ontwikkeling’, John Smulders, COO, third party servicer Quion - ECH",
  "text": "‘Digitalisering binnen de financiële keten is gewenste ontwikkeling’, John Smulders, COO, third party servicer Quion - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Digitalisering binnen de financiële keten is gewenste ontwikkeling’, John Smulders, COO, third party servicer Quion / Bestuur , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Aan het woord is John Smulders , COO van Quion, de grootste onafhankelijke third party servicers van Nederland voor hypotheken en consumptief krediet. Het thema van dit verhaal? De samenwerking tussen Quion en stichting ECH, en dé digitale brievenbus tussen notariaat en geldverstrekker. ‘Wij verzorgen de back-end in opdracht van een dertigtal geldverstrekkers. Dit betekent kort gezegd dat we de financieringsaanvragen beoordelen en het (bijzonder) beheer uitvoeren. Ook onderhouden we het klantcontact dat daaruit voortvloeit. Een belangrijk element in onze visie is dat we de consument en betrokken partijen in de keten zo snel mogelijk duidelijkheid willen geven. Dat proces verloopt al decennialang op een bepaalde manier door de keten heen. En dat proces is wat ons én veel andere ketenpartijen betreft, inmiddels echt wel aan vernieuwing en innovatie toe.’ John Smulders, COO van Quion Automatisering van processtappen in de keten ‘Er is behoorlijk wat informatie nodig om tot goedkeuring van een financieringsaanvraag te komen. We hebben vanuit Quion een innovatieprogramma lopen dat inzet op digitalisering van dit goedkeuringsproces. Feitelijk zou je met één druk op de knop moeten kunnen bepalen of iemand de hypotheek met een bepaalde omvang voor een huis kan krijgen. In de ideale situatie verloopt dat proces door de gehele keten heen geautomatiseerd. Zo hebben wij bijvoorbeeld ingezet op het gebruik van brondata, waarbij de consument via een app toestemming kan geven om de relevante data op te halen bij de desbetreffende instantie. Denk dan aan instanties als het UWV (inkomen), NWWI (taxaties) en platforms zoals Mijn Pensioenoverzicht van de Rijksoverheid en BRP (Basisregistratie Personen)’, aldus John. Stap één in beoordelingsproces van de hypotheek is kijken naar de betaalbaarheid van de lening en validering van het onderpand. Maar de aankoop van een woning kent uiteraard meer stappen, onder meer richting het notariaat en het kadaster. En ook dát wil je automatiseren. Dat is de belangrijkste reden dat we aangesloten zijn bij stichting ECH. Het voordeel is uiteindelijk voor de consument, omdat deze goedkoper en sneller met veel minder kans op fouten door de digitale uitwisseling van data wordt geholpen.’ Inzet ECH leidt tot efficiëntie ‘In 2019 werd ik uitgenodigd om samen met collega’s van het bestuur en de raad van advies stil te staan bij de visie en missie van ECH. We hebben toen met elkaar geconstateerd dat we de dienstverlening door de stichting nog meer vanuit de keten konden benaderen. Feitelijk moet ECH een afspiegeling zijn van ketenoplossingen, en dat dan uitgebreider dan puur vanuit de technische kant bezien maar zeker ook als bruggenbouwer tussen partijen. Ik ben dan ook erg blij dat de visie en missie herijkt zijn naar een wat bredere blik. Op basis van een nader onderzoek zal halverwege dit jaar gekeken worden naar hoe ECH en met welke initiatieven zij een verdere bijdrage aan ketenoptimalisatie kan leveren en daarmee een meerwaarde voor de bij haar aangesloten leden. Met veel energie draag ik vanuit mijn rol mijn steentje eraan bij om dit verder te richten. Uiteindelijk willen we met elkaar betere producten voor de klant bereiken, en de inzet van ECH moet tegelijkertijd tot een stukje efficiëntie leiden voor alle partijen in de keten.’ Samenwerking top of the bill ‘Wij vinden het belangrijk om met ECH samen te werken aan het neerzetten van een beter klantproduct in de keten en van daaruit tevens een stuk gemak en voorkeur vanuit de klant voor onze dienstverlening. Het is een stap die je als serieuze partij in de markt wilt zetten. De samenwerking verloopt overigens uitstekend. Er zijn korte lijnen met de Directie en Bestuur en er wordt goed naar je geluisterd. Ook de manier waarop je bij zaken betrokken wordt ervaar ik als buitengewoon plezierig. Ik ben er trots op dat ik een bijdrage kan leveren aan de beweging die we aan het maken zijn met elkaar: van een meer operationeel/tactische naar een meer strategische agenda. Een goed fundament is uiteraard key, maar vanuit een stuk visie, doel en ontwikkeling is het nu tijd om die zaken zwaarder te laten wegen in de stappen die we zetten. Daar gaat behoorlijk wat tijd inzitten maar nog actiever inspelen op de dag van morgen en toekomst gaat uiteindelijk voor alle stakeholders de meeste waarde creëren. En er iets niets mooier dan met elkaar die kant op te bewegen langs een oprechte en daarmee goede samenwerking’, besluit John. Meer informatie Wil je meer weten over de visie van John Smulders of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:21:07Z",
  "source": "ech.nl"
}