{
  "id": "a229147325adc47ce80630ed8f805bbf7fed5804",
  "url": "https://www.ech.nl/notarissen/nationale-nederlanden/",
  "title": "Nationale Nederlanden - ECH",
  "text": "Nationale Nederlanden - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel  van: Nationale-Nederlanden Bank N.V. Proces: Passeren & Royeren E-mail: – Telefoon: 010 513 01 21 01 Nieuwsberichten 02 Passeren 03 Royeren 04 Overstap erfpacht Deelnemersinfo Nationale Nederlanden Algemene informatie/nieuwsberichten (kort) Het beleid van Nationale Nederlanden voor het royeren met verrekening van een Kapitaalverzekering Eigen Woning (KEW) wijzigt per 1 juli 2024. Meer informatie hierover leest u hier . Nationale-Nederlanden Bank maakt gebruik van ECH ter ondersteuning van haar proces van hypotheekverstrekking. Hieronder vindt u een uitleg van dit proces en een aantal aandachtspunten om rekening mee te houden. Notarisinstructie p asseerproces Passeerproces passeeropdracht U ontvangt van ons de passeeropdracht onder de maatschappijnaam Nationale-Nederlanden (Bank N.V./Levensverzekering Maatschappij N.V.) Bij de passeeropdracht zitten 2 bijlagen: – de Notarisinstructie (notary_instructions); – de invulinstructie (XML); Met de informatie in deze documenten kunt u de definitieve hypotheekakte opmaken. Gebruik in de akte altijd de juiste juridische entiteit . Deze staat in zowel in de invulinstructie als de notarisinstructie: – Nationale Nederlanden Bank N.V. of – Nationale Nederlanden Levensverzekering Maatschappij N.V. Neem in de akte ook altijd het offertenummer op. Deze vindt u in de invulinstructie. Voor de invulinstructie gelden een aantal aandachtspunten: Bij S3_geldverstrekker vindt u terug welke juridische entiteit van toepassing is. Het is belangrijk dat u de juiste maatschappij in de akte opneemt, anders moet achteraf een nieuwe akte worden aangeleverd om het te corrigeren. Bij ‘S6_stellingen’ en ‘S7_zekerheden’ is sprake van variabele blokken die alleen opgenomen moeten worden in geval van meerdere registergoederen. In ‘S7_zekerheden’ kunt u onder ‘Registergoed’ terugvinden om hoeveel registergoederen het gaat. Bij ‘S8_overbrugging En Depots’ wordt de rangorde van de overbruggingshypotheek niet meegegeven, omdat deze bij ons niet bekend is. Dit kunt u zelf rechercheren. Bij ‘S10_domiciliekeuze’ wordt het adres van het hoofdkantoor van de schuldeiseres niet opgenomen. Deze vindt u terug in ‘S3_geldverstrekker’. Bij ‘S13_bedingen’ en ‘S17_verpanding’ is sprake van variabele tekstblokken, die alleen opgenomen moeten worden in geval van een overbruggingskrediet. Dit kunt u terugvinden in S8_overbrugging En Depots. Hoewel de sectie ‘Wettelijke schuldsanering natuurlijke personen’ niet in de invulinstructie staat, moet deze wel in de akte opgenomen worden. U ontvangt bij een passeeropdracht van Nationale-Nederlanden ook de hypotheekofferte. Deze hypotheekofferte hoeft bij het passeren niet te worden getekend of retour te worden gestuurd. U dient deze hypotheekofferte wel samen met de hypotheekakte op te slaan in uw archief. Melden passeergegevens De passeerdatum die u kunt opgeven, ligt minimaal 3 werkdagen in de toekomst. Wij verzoeken u in het geval van bestaande bouw de optie ‘nee’ aan te vinken bij de vraag ‘Specifiek bedrag nodig bij passeren?’. Ook als u geen gelden nodig heeft. Mocht u gebruik maken van een softwarepakket met geïntegreerde ECH functionaliteit, dan kan het voorkomen dat uw pakket bij het versturen van de passeerdatum ongemerkt voor u aangeeft dat u de gelden gaat specificeren. Dit betekent dat Nationale-Nederlanden Bank wacht met uitbetalen tot de specificatie van de gelden ontvangen is. Dit doet u in de stap ‘melden gelden notaris’. Melden gelden Het kan uiteraard voorkomen dat je onverhoopt toch meer of minder gelden benodigd hebt tijdens passeren. Je kan dit middels een nieuwe gelden specificatie doorgeven. Het kan ook voorkomen dat er geen gelden bij passeren benodigd zijn geef dan via het passeergegevens bericht aan dat je geen gelden nodig hebt bij passeren en doe geen geldenspecificatie met €0,-. Krijgen wij de melding niet binnen 3 werkdagen voor de passeerdatum, dan kan het gebeuren dat de hypotheek niet op de gewenste datum kan passeren. Eigen middelen nieuwbouw specificeren Bij nieuwbouw moet u aangeven of u een specifiek bedrag nodig heeft bij passeren of dat er geen gelden nodig zijn. Als u een specifiek bedrag nodig heeft, gebruik dan de taak ‘ melden gelden notaris ‘. Dien uw verzoek hiervoor nog dezelfde dag bij ons in. En doe dit altijd uiterlijk 3 werkdagen voor passeren. Voor nieuwbouw is het verplicht om de eigen middelen te specificeren. Het is belangrijk dat je de eigen middelen opgeeft via het invulveld ingebrachte eigen middelen. Let op: dus niet specificeren als nota-regel of bedrag. Als de eigen middelen nieuwbouw niet zijn opgegeven bij ingebrachte eigen middelen, ontvangt u geen ECH-sluitnota. Verplicht af te lossen kredieten Heeft uw klant een krediet dat wordt ingelost met de nieuwe hypotheek? Vraagt u het benodigde bedrag voor de aflossing van het (consumptief) krediet dan op. Wij zorgen er dan voor dat u de gelden voor aflossing van het (consumptief) krediet ontvangt. Verplicht af te lossen kredieten worden in een apart blok in de passeeropdracht genoemd. Daarmee weet u welke kredieten verplicht moeten worden afgelost bij het passeren van de hypotheek. Zoals u van ons gewend bent betaalt Nationale-Nederlanden het geld naar u uit, zodat u deze kredieten kunt aflossen bij de desbetreffende partijen. De verplicht af te lossen kredieten worden ook genoemd in de sluitnota onder punt ‘99 – Overige inhouding maatschappij – Af te lossen verplichting’. Houdt u er rekening mee dat Nationale-Nederlanden met haar klant heeft afgesproken dat eventuele eigen middelen eerst aangewend moeten worden. Sluitnota/Passeeropdracht In de bijlage van dit bericht vindt u de specificatie van de sluitnota. Nationale-Nederlandenmaakt het geld over op het door u opgegeven rekeningnummer. Passeerbevestiging U stuurt ons de passeerbevestiging en als bijlage een notarisverklaring, een afschrift van de hypotheekakte en eventuele andere benodigde stukken (bijv. akte van kwijting, akte van confirmatie). Aandachtspunten maatschappij: Aflossing krediet – Heeft uw klant een krediet dat wordt ingelost met de nieuwe hypotheek? Vraagt u het benodigde bedrag voor de aflossing van het (consumptief) krediet dan op. Wij zorgen ervoor dat u de gelden voor aflossing van het (consumptief) krediet ontvangt.  Wilt u voor de rechtstreekse aflossing met gelijktijdige opheffing zorgdragen? Wijzigen passeerdatum – Wij verzoeken u een wijziging van de passeerdatum altijd uiterlijk 3 werkdagen voor de huidige passeerdatum via ECH door te geven. Dit zorgt ervoor dat wij de wijziging ook tijdig in onze systemen kunnen doorvoeren. Als de nieuwe passeerdatum binnen zeven werkdagen na de oorspronkelijke passeerdatum plaatsvindt, is het niet nodig om eventueel ontvangen gelden terug te storten. Bijlagen – Voegt u altijd de afrekening die u voor de klant opmaakt toe als bijlage in ECH. Gebruikt u een softwarepakket met geïntegreerde ECH functionaliteit? Dan kunt u dit direct toevoegen aan een ander bericht. Als u de ECH webapplicatie gebruikt, dan kunt u dit doen door een apart bericht te sturen. Dit kunt u doen door onder het tabblad ‘extra’ te kiezen voor ‘versturen bijlage’. U kunt in ECH ook andere bijlagen toevoegen aan berichten (bij gebruik van een softwarepakket met geïntegreerde ECH functionaliteit) of een bijlage als apart bericht versturen (bij gebruik van de ECH webapplicatie). Deze bijlagen worden altijd opgeslagen maar niet actief gebruikt. Als u wilt dat wij de bijlagen in behandeling nemen, laat het ons dan weten via een wijzigingsbericht. Geautomatiseerde wijzigingsverzoeken – In een aantal gevallen stuurt Nationale-Nederlanden een wijzigingsverzoek naar de notaris. Het is belangrijk dat u deze wijzigingsverzoeken goed in de gaten houdt, omdat het mogelijk is dat uw bericht niet verwerkt kan worden. Via het wijzigingsverzoek wordt u verzocht om het bericht aan te passen. Het betreffende bericht is dan verwerkt en dient opnieuw verstuurd te worden. De betreffende fout in het bericht wordt in het wijzigingsverzoek omschreven. Contact Voor  vragen over het gebruik van de ECH applicatie op notarisnet evenals voor technische vragen kunt u contact opnemen met de servicedesk van ECH via het telefoonnummer 070-3307135 of via servicedesk@knb.nl . Voor vragen over het gebruik van ECH vanuit uw softwarepakket kunt u contact opnemen met de servicedesk van uw eigen leverancier. Voor inhoudelijke vragen over een zaak kunt u een wijzigingsbericht sturen, of contact opnemen met Nationale-Nederlanden via het telefoonnummer 010-5130121. Wij zijn bereikbaar op werkdagen van 09.00 tot 17.00 uur. Notarisinstructie royementen proces Royeren bij Nationale-Nederlanden U kunt via ECH een verzoek tot royement indienen voor: Nationale-Nederlanden Bank N.V. Nationale-Nederlanden Levensverzekering Maatschappij N.V. Wat kan er WEL via ECH Verkoop van een onderpand Oversluiten van een hypotheek Aflossen van een overbruggingshypotheek (altijd via een los ECH verzoek) Royement om niet Gedeeltelijk royement (bijvoorbeeld stuk tuin of garage) Wat kan er NIET via ECH? Toestemming vestigen vervolghypotheek Erfpacht wijzigen voortdurend naar eeuwigdurend Klik door naar de betreffende aanvraagformulieren of ga naar onze notarispagina Hoofdelijk ontslag Splitsing Bovenstaande verzoeken kunt u mailen onder vermelding van het hypotheekkenmerk naar hypotheken@nn.nl . Verzoek aflosnota via ECH We helpen u graag met het op tijd regelen van de aflosnota voor uw klant. Om de aflosnota vóór de gewenste aflosdatum te kunnen maken, is het belangrijk dat wij het aflosverzoek correct en op tijd ontvangen.  Wij ontvangen uw verzoek graag 2 maanden tot 25 werkdagen voor de gewenste aflosdatum. Lukt dit niet? Dan hanteren wij de volgende uiterste aanlevertermijnen: Verzoek aflosnota zonder verrekening: 6 werkdagen Verzoek aflosnota met verrekening verpande zekerheid: 11 werkdagen Als het om een KEW (Kapitaalverzekering Eigen Woning) polis gaat dan: 25 werkdagen Verzoek aflosnota voor een Overbruggingshypotheek: 6 werkdagen Royement om niet: 5 werkdagen Gedeeltelijke verkoop: 10 werkdagen Interne verpande zekerheden : Uw klant kan het bedrag op zijn gekoppelde spaarrekening, beleggingsrekening of levensverzekering gebruiken voor het (deels) aflossen van de hypotheek. We berekenen de waarde van de beleggingen om te beoordelen hoeveel uw klant hiermee kan aflossen. De percentages die we hierbij hanteren en de instructie voor uw klant om de beleggingsrekening liquide te maken vindt u op onze notarispagina . Externe verpande zekerheden: Bij Nationale-Nederlanden kunnen geen externe verpande zekerheden gebruikt worden voor het (deels) aflossen van de hypotheek. Externe verpande zekerheden : Bij Nationale-Nederlanden kunnen geen externe verpande zekerheden gebruikt worden voor het (deels) aflossen van de hypotheek. Aflosnota We doen ons best om de aflosnota 5 tot 10 werkdagen voor de aflosdatum bij u aan te leveren. In sommige gevallen is dit later, maar nooit later dan twee dagen voor de aflosdatum. Een aflosnota is 14 dagen geldig vanaf de door u gevraagde aflosdatum. U kunt dan dagrente bijtellen. Let op! U kunt geen dagrente aftrekken. Wilt u de aflosdatum vervroegen of langer dan 14 dagen uitstellen? Wijzig dan de aflosdatum binnen de bestaande ECH zaak en verzend t het verzoek opnieuw. Dit kan ook als u al een aflosnota van ons ontvangen heeft. Specificatie Aflosnota Als u de aflosnota en getekende royementsvolmacht van ons ontvangt, zetten wij voor uw klant een specificatie van de aflosnota en de eventueel te betalen vergoeding klaar in mijn.nn. Betaling en akkoord royement In de aflosnota vindt u ons betalingskenmerk. Vermeld t alléén dit kenmerk bij de betaling. Alleen dan kunnen we de aflossing op tijd en goed afhandelen. Nadat wij de gelden van u ontvangen hebben ontvangt u meestal direct en altijd binnen 10 dagen het ‘akkoord royement.’ Controleer de aflosnota goed. Klopt er iets niet? Laat het ons weten via een wijzigingsbericht. Tips voor een soepele afwikkeling van uw verzoek Wijziging doorgeven op bestaande royeerzaak Wilt u een wijziging doorgeven op een bestaand royementsverzoek? Laat dit aan ons weten door de gegevens in de ECH zaak te wijzigen en verzend deze opnieuw. U ontvangt dan direct de (gewijzigde) voorlopige royementsvolmacht. Wij sturen uiterlijk 2 werkdagen voor de aflosdatum een (nieuwe) aflosnota en getekende royementsvolmacht. Voor vragen en/ of aanvullende informatie kunt u een wijzigingsbericht of bijlagebericht naar ons sturen via ECH. Overbruggingshypotheek Verkoopt uw klant zijn oude woning? Moet hiervoor zowel het overbruggingskrediet als de hypotheek bij Nationale-Nederlanden afgelost worden? Dan ontvangen wij hiervoor graag twee aparte verzoeken. Wij kunnen dit niet binnen één ECH verzoek afhandelen. Gedeeltelijke verkoop U kunt ook via ECH een verzoek tot gedeeltelijk royement indienen in verband met ruiling of verkoop van een deel van het onderpand. Specificeer het te royeren stuk zo goed mogelijk. Ook vernemen wij graag wat de eventuele verkoopopbrengst is. In veel gevallen vragen wij ook een gevalideerd taxatierapport op, stuur deze direct mee met uw verzoek. In het taxatierapport moet in ieder geval de waarde van het onderpand in huidige staat staan, de waarde van het te royeren deel en de waarde van het onderpand nadat het perceelgedeelte geroyeerd is. In de onderstaande tabel vindt u meer informatie over de beoordeling van een gedeeltelijk royement. Neem deze goed door en dien het verzoek zo volledig mogelijk in. Zo kunnen wij uw verzoek beter beoordelen en voorkomen we dat het beoordelen van uw verzoek langer duurt. Het te royeren perceel is Kleiner dan 5m2 Geen aanvullende stukken Geen verplichte aflossing Groter dan 5m2 en kleiner dan 10% van de totale oppervlakte van het onderpand/perceel Afhankelijk van de hoogte van de hypotheek ten opzichte van de waarde van de woning vragen wij na ontvangst van het verzoek een gevalideerd taxatierapport of Calcasa desktoptaxatie op Mogelijk verplichte aflossing Meer dan 10% van de totale oppervlakte van het onderpand/perceel Gevalideerd taxatierapport Verplichte aflossing Meer dan 50% van de totale oppervlakte van het perceel/onderpand Hier gaan wij in principe niet mee akkoord. Verwijs de klant door naar zijn tussenpersoon en laat die contact met ons opnemen. Notarispagina Nationale-Nederlanden Het aflosformulier op de notarispagina van Nationale-Nederlanden kunt niet meer gebruiken. Wel vindt u actuele informatie over het wijzigen en aflossen van een hypotheek. Zo heeft u de processen, regels, doorlooptijden én belangrijkste downloads binnen handbereik. Contact Heeft u na het lezen van deze informatie nog vragen of suggesties? Neem dan contact met ons op via het telefoonnummer 010-5130121. Wij zijn bereikbaar op werkdagen van 09.00 tot 17.00 uur. Notarisinstructie overstapproces van voortdurende naar eeuwigdurende erfpacht Op de notarispagina van Nationale-Nederlanden vindt u actuele informatie over het aanvragen van een overstap van voortdurende naar eeuwigdurende erfpacht. Zo heeft u de processen, regels, doorlooptijden én belangrijkste downloads binnen handbereik. Verzoek indienen overstap van voortdurende naar eeuwigdurende erfpacht We helpen u graag met het op tijd regelen van een overstap van voortdurende naar eeuwigdurende erfpacht voor de klant. Om de wijziging vóór de gewenste passeerdatum te kunnen doorvoeren, is het belangrijk dat wij de aanvraag correct en op tijd ontvangen. Goed om te weten: sinds 1 mei 2023 is er geen aanvullende hypotheekakte meer nodig bij de overstap van voortdurende naar eeuwigdurende erfpacht. Let op: dit geldt alleen voor dit type overstap. Voor alle andere vormen van overstappen van erfpacht blijft een nieuwe hypotheekakte nodig. Omdat er in die situaties een nieuw hypotheekrecht gevestigd moet worden. Dien uw aanvraag in via het Aanvraagformulier overstap van voortdurende naar eeuwigdurende erfpacht . Overige erfpachtverzoeken Alle andere verzoeken rondom erfpacht kunt u mailen naar hypotheken@nn.nl . Contact Voor inhoudelijke vragen over een zaak kunt u contact opnemen met Nationale-Nederlanden via het telefoonnummer 010-5130121. Wij zijn bereikbaar op werkdagen van 09.00 tot 17.00 uur. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:09:19Z",
  "source": "ech.nl"
}