{
  "id": "a5ac84b33f2c0754e387e0ccb8cb8076b976f708",
  "url": "https://www.ech.nl/wijziging-ech-aansluitingen-de-volksbank-per-1-juni-2020/",
  "title": "Wijziging ECH-aansluitingen De Volksbank per 1 juni 2020 - ECH",
  "text": "Wijziging ECH-aansluitingen De Volksbank per 1 juni 2020 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Wijziging ECH-aansluitingen De Volksbank per 1 juni 2020 / Nieuws / Door echadmin De Volksbank, waar de merken ASN Bank, BLG Wonen, Regiobank en SNS Bank onder vallen, voert begin juni een wijziging door aan haar systemen. Er zullen andere ECH-aansluitingen gebruikt worden voor het royementenproces. Dit betekent dat nieuwe royementsverzoeken bij andere ECH-aansluitingen zullen moeten worden ingediend. Mogelijk moet u ook lopende zaken opnieuw indienen. In dit nieuwsbericht zullen we toelichten wat er voor u wijzigt en hoe u ervoor kunt zorgen dat u de royementsverzoeken bij de juiste ECH-aansluitingen indient. Dit wijzigt voor u Het proces rondom het opvragen van royement inclusief aflosnota blijft inhoudelijk ongewijzigd. Op 1 juni zullen nieuwe ECH-aansluitingen geactiveerd worden. Vanaf dat moment zult u nieuwe royementsverzoeken bij deze aansluitingen moeten indienen. De bestaande ECH-aansluitingen zullen tegelijkertijd hernoemd worden zodat u onderscheid kunt maken tussen beide aansluitingen. Heeft u royementsverzoeken met een aflosdatum tot en met 30 juni 2020 ? Deze verzoeken kunnen tot 1 juni worden ingediend via de bestaande ECH-aansluitingen. Het uitgangspunt is dat deze verzoeken ook zullen worden afgehandeld via deze ECH-aansluitingen. Heeft u royementsverzoeken met een aflosdatum op 1 juli 2020 of later ? Dan vragen we u deze verzoeken op te sparen en vanaf 1 juni alsnog in te dienen via de nieuwe ECH-aansluitingen. Heeft u deze verzoeken toch ingediend via de oude ECH-aansluitingen? Dan worden deze begin juni gestopt met het verzoek om deze opnieuw in te dienen via de nieuwe aansluiting. Helaas kunnen wij de al ingediende verzoeken niet omzetten naar de nieuwe aansluiting. Vanaf 1 juni kunnen er géén nieuwe royementsverzoeken worden ingediend via de oude ECH-aansluitingen. Probeert u dit toch? Dan ontvangt u een foutmelding van ECH. Enkel bestaande verzoeken met een aflosdatum tot en met 30 juni 2020 zullen worden afgehandeld. Heeft u in juni nieuwe zaken die nog vóór 1 juli moeten worden afgehandeld? Dan kunt u deze gewoon indienen via de nieuwe ECH-aansluitingen. Wat kunt u zelf doen? Heeft u royementsverzoeken met een aflosdatum op 1 juli 2020 of later ? Wacht met het indienen tot 1 juni 2020. Daarmee voorkomt u dat uw verzoek voortijdig wordt gestopt en opnieuw moet worden ingediend. U voorkomt daarmee ook dubbele ECH-kosten. Zodra de nieuwe ECH-aansluitingen beschikbaar worden gesteld zult u de lijst met ECH-aansluitingen mogelijk moeten verversen in uw notarieel softwarepakket. ECH heeft met de notarieel softwareleveranciers overlegd over de uit te voeren acties: Codex / NIS (Van Brug) : Om de nieuwe aansluitingen van de Volksbank beschikbaar te krijgen in Van Brug Codex dan wel NIS kunt u via de ApplicatieManager de lijst van ECH-maatschappijen vernieuwen. Op het klantportaal van Van Brug wordt hiervoor een uitleg gepubliceerd. Q-bis (Quantaris) : Om gebruik te kunnen maken van de nieuwe aansluiting van de Volksbank dient u in Qu-beheer de Tabel ECH banken opnieuw op te halen. Er wordt een Kennis Item beschikbaar gesteld op het klantportaal waarin uitleg is opgenomen. NEXTassyst (NEXTlegal) : In NEXTassyst worden de ECH-aansluitingen elke dag automatisch opnieuw opgehaald. Hiervoor hoeft u niets te doen. Notarisdossier (Dirict) : Dirict zal ervoor zorgen dat u een actueel overzicht van de ECH-aansluitingen heeft. Notis One (Notis) : Neem contact op met Notis. Nobilex : U beschikt altijd over het actuele overzicht van ECH-aansluitingen. Webapplicatie ECH (bereikbaar via NotarisNet) : U beschikt altijd over het actuele overzicht van ECH-aansluitingen. Mocht u vragen hebben over de lijst van ECH-aansluitingen, neem dan contact op met uw notarieel softwareleverancier. Dit zullen wij doen Vanaf 1 juni zullen de bestaande ECH-aansluitingen hernoemd worden. Deze aansluitingen krijgen een aparte indicatie zodat duidelijk is welke aansluitingen de nieuwe zijn en welke de oude. Royementsverzoeken met een aflosdatum op of na 1 juli 2020 die wij niet meer kunnen verwerken zullen wij actief beëindigen. Dit doen wij na de ingebruikname van de nieuwe aansluitingen. Het verzoek kunt u vervolgens (opnieuw) indienen via de nieuwe aansluitingen. Op de door ons gestuurde aflosnota’s zullen we vanaf nu ook melding maken over de nieuwe werkwijze. Dit om u waar mogelijk te informeren. Passeren blijft ongewijzigd Voor het passeren proces hoeft u geen actie te ondernemen. Dit blijft zoals het is. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:10:32Z",
  "source": "ech.nl"
}