{
  "id": "a7b663e98c0134878ca26e0fa2eb1b62ab1ae6f8",
  "url": "https://www.ech.nl/notarissen/impacthypotheken/",
  "title": "Impact Hypotheken - ECH",
  "text": "Impact Hypotheken - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel  van: Impact Hypotheken Proces: Passeren E-mail: – Telefoon: 088 – 205 64 65 01 Nieuwsberichten 02 Passeren 03 Royeren Deelnemersinfo Impact Hypotheken Algemene informatie/nieuwsberichten (kort) Ook geldverstrekker Impact Hypotheken is overgegaan op het passeerproces van ECH. Vanaf  5 oktober 2023 ontvangen notarissen berichten over en voor het passeren van hypotheken dan ook via ECH. Hierdoor kunt u een nog betere en voorspelbare dienstverlening verwachten van Impact Hypotheken. Betrouwbare dienstverlening Impact Hypotheken heeft gekozen voor de werkwijze van de stichting Elektronische Communicatie Hypotheken, omdat de communicatie en de dienstverlening naar notarissen zo beter, efficiënter en betrouwbaarder verloopt. Ruim de helft van alle transacties tussen notarissen en geldverstrekkers verloopt al via ECH, waarmee dit platform zichzelf ruimschoots heeft bewezen. Dat Impact Hypotheken overgaat op het platform van ECH, heeft enkele gevolgen voor notarissen. Zo ontvangt u bepaalde documenten niet meer of worden deze op een ander moment verstuurd. En ook de notarisinstructies zijn iets gewijzigd. U leest hieronder wat er voor u verandert en in welke specifieke volgorde u de notarisinstructies het beste kunt opvolgen. Notarisinstructie p asseerproces Passeerproces Notarisinstructies ontvangt u voortaan via een passeeropdracht via ECH. Daarbij zit geen conceptakte; deze is niet meer nodig. Wel sturen wij u bij deze passeeropdracht een invulinstructie toe die u kunt gebruiken om de daadwerkelijke hypotheekakte op te stellen. Deze hypotheekakte is overigens niet veranderd. Melden passeergegevens U kunt een passeerdatum opgeven die, nadat u deze hebt doorgegeven aan Impact Hypotheken, nog minimaal 3 werkdagen in de toekomst ligt. Wanneer u gebruikmaakt van een softwarepakket met een geïntegreerde ECH-functionaliteit, kan het gebeuren dat dit pakket bij het versturen van de gewenste passeerdatum ongemerkt aangeeft dat u gelden wilt specificeren. Wanneer (onbewust) is gekozen voor een specifiek bedrag bij passeren, zal Impact Hypotheken wachten met het uitbetalen van alle gelden, totdat we die specificatie van gelden hebben ontvangen. In dat geval wordt tijdens het ECH-proces gevraagd: ´Specifiek bedrag nodig bij passeren?´. In het geval van bestaande bouw verzoeken wij u de optie ´Nee´ aan te vinken, ook als u geen gelden hoeft aan te vragen bij Impact Hypotheken. Hebt u wel specifieke gelden bij passeren nodig? Dan kunt u dit specificeren in de stap ‘Melden gelden notaris’. In het geval van nieuwbouw dient u ook aan te geven of u een specifiek bedrag nodig hebt bij passeren of dat er geen gelden nodig zijn. Als uw klant een specifiek bedrag nodig heeft, dan geeft u dit op bij de stap ‘Melden gelden notaris’. Specificeren gelden Bij het specificeren van de gelden in de stap ‘Melden gelden notaris’ is het mogelijk om verschillende kostentypen of notaregels op te geven. Hierbij dient u gebruik te maken van ten minste één notaregel; een specificatie zonder regel is niet mogelijk. Melden gelden notaris Wij verzoeken u om de stap ‘Melden gelden notaris’ op dezelfde dag bij Impact Hypotheken in te dienen, als de dag waarop u de stap ‘Melden passeergegevens’ hebt uitgevoerd. Het verzoek ´Melden gelden notaris´ moet in elk geval uiterlijk 3 werkdagen voor passeren bij Impact Hypotheken binnen zijn. Indien dit niet minimaal 3 werkdagen voor de passeerdatum gebeurt, kan het zijn dat u een ander bedrag ontvangt dan u op het moment van passeren nodig hebt. Afwijkende data opvragen gelden Voor het opvragen van gelden moeten wij rekening houden met nationale en internationale feestdagen. Voor feestdagen, zoals Kerstmis en Pasen, gelden afwijkende data waarop gelden moeten worden opgevraagd. U kunt op onze website zien of en wanneer er sprake is van een afwijkende datum. In dat geval dient u de gelden eerder dan 3 werkdagen voor het passeren op te vragen. Verplicht af te lossen kredieten Heeft uw klant een fiscaal aftrekbaar krediet dat wordt ingelost met de nieuwe hypotheek? Dan dient u het bedrag dat nodig is voor het aflossen van dit krediet op te voeren als onderdeel van het totaal te ontvangen bedrag. U hoeft en kunt dit niet apart opvoeren; kredieten die verplicht moeten worden afgelost, moeten in een aparte categorie in de passeeropdracht worden genoemd. Daarmee weet u welke kredieten verplicht moeten worden afgelost bij het passeren van de hypotheek. Zoals u van ons gewend bent, betaalt Impact Hypotheken vervolgens het geld aan u uit, zodat u deze kredieten kunt aflossen bij de desbetreffende partijen. Houd er overigens rekening mee dat Impact Hypotheken met haar klant(en) kan hebben afgesproken dat eigen middelen eerst aangewend moeten worden bij het aflossen van kredieten. Sluitnota Doordat wij nu werken met ECH, krijgt u voortaan vóór het passeren van de hypotheekakte een sluitnota toegestuurd. U ontvangt deze zodra we de gegevens hebben ontvangen in de categorie ‘Melden passeergegevens’ of, indien van toepassing, in de categorie ‘Melden gelden’. In de sluitnota lichten wij toe welk bedrag wij daadwerkelijk uitbetalen. Impact Hypotheken maakt het geld over op het door u opgegeven rekeningnummer. Passeerbevestiging Wanneer het passeren van de hypotheekakte heeft plaatsgevonden, stuurt u ons de passeerbevestiging via ECH toe; als bijlage ontvangen wij graag een notarisverklaring en een afschrift van de hypotheekakte. Wijzigen passeerdatum Het kan voorkomen dat een passeerdatum wijzigt. In dat geval verzoeken wij u de nieuwe passeerdatum uiterlijk 3 werkdagen vóór de huidige passeerdatum door te geven via ECH. Zo kunnen wij de wijziging ook tijdig in onze systemen doorvoeren. Als de nieuwe passeerdatum binnen drie werkdagen na de oorspronkelijke passeerdatum plaatsvindt, hoeft u de ontvangen gelden die u al hebt ontvangen niet terug te storten. Wanneer u de gelden al hebt ontvangen en de nieuwe passeerdatum meer dan drie werkdagen in de toekomst ligt, dient u dit wel aan ons terug te betalen. Wij zullen dit dan later opnieuw aan u overmaken, wanneer u de gelden wederom opvraagt. Geautomatiseerde wijzigingsverzoeken Het kan voorkomen dat Impact Hypotheken uw bericht niet kan verwerken. In dat geval kunnen wij u een wijzigingsverzoek naar de notaris sturen; hierin wordt de betreffende fout altijd omschreven. In dit wijzigingsverzoek kan Impact Hypotheken u vragen uw bericht aan te passen en opnieuw via ECH te versturen. Het is daarom belangrijk dat u deze wijzigingsverzoeken goed in de gaten houdt. Wijziging passeeropdracht en ECH zaaknummer Als uw klant een wijziging aan Impact Hypotheken doorgeeft of als Impact Hypotheken een wijziging in de hypotheekaanvraag aanbrengt, wordt er een nieuwe passeeropdracht aangemaakt onder een nieuw ECH-zaaknummer. Het oude ECH-zaaknummer komt daarna te vervallen. U ontvangt hierover bericht via ECH. Vanaf dat moment dient u het nieuwe ECH-zaaknummer te gebruiken voor deze client en dit dossier. Notarisinstructie royementen proces Royeerproces Vooralsnog maakt Impact Hypotheken geen gebruik van het royeerproces van ECH. Hebt u een aflosnota nodig? Stuur uiterlijk 15 werkdagen voor passeren een e-mail naar administratie@Impacthypotheken.nl en u ontvangt de aflosnota van ons binnen 5 werkdagen voor passeren. Contact Voor vragen over het gebruik van de ECH-applicatie op Notarisnet of voor technische vragen, kunt u contact opnemen met de servicedesk van ECH via 070 – 330 71 35 of via servicedesk@knb.nl . Voor vragen over het gebruik van ECH vanuit uw softwarepakket kunt u contact opnemen met de servicedesk van uw eigen leverancier. Contact Impact Hypotheken Hebt u inhoudelijke vragen over een zaak of suggesties voor Impact Hypotheken? Stuur dan een e-mail naar administratie@Impacthypotheken.nl of neem op werkdagen van 9.00 tot 17.30 uur contact op met Impact Hypotheken via het telefoonnummer 088 – 205 64 65. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:27:00Z",
  "source": "ech.nl"
}