{
  "id": "a9e76794381accae654a245e7a2193fcbc20fa3c",
  "url": "https://www.ech.nl/terugblik-ech-maykel-van-londen/",
  "title": "‘ECH voelt als een tweede familie’, Maykel van Londen, teamlead beheer Davinci Conclusion - ECH",
  "text": "‘ECH voelt als een tweede familie’, Maykel van Londen, teamlead beheer Davinci Conclusion - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘ECH voelt als een tweede familie’, Maykel van Londen, teamlead beheer Davinci Conclusion / ECH medewerkers , Hypotheekmarkt , Nieuws , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Het was een mooie tijd. Een tijd waarin ik startte als functioneel beheerder, doorgroeide tot consultant en me vanuit die rol meer en meer bezighield met certificeringen in alle facetten van het woord, zowel bij de hypothecair financiers als de notarieel softwareleveranciers. Uiteindelijk heb ik als Product Owner gewerkt en was ik onder meer betrokken bij het vernieuwen van de ECH-webcliënt.’ Aan het woord is Maykel van Londen , vanuit Davinci Conclusion ruim 13 jaar werkzaam geweest voor Stichting ECH. Inmiddels heeft hij afscheid genomen: hij was toe aan een nieuwe uitdaging. Maykel van Londen, teamlead beheer Davinci Conclusion Van ECH naar PEC ‘Toen er een rol vrijkwam binnen Davinci had ik daar wel oren naar. Na een aantal gesprekken was duidelijk dat we het beiden een goed idee vonden dat ik deze stap ging zetten. Inmiddels ben ik, met veel plezier overigens, aan de slag als teamlead functioneel beheer. En dat dan voor de dienstverlening rondom het KNB-Platform Elektronische Communicatie, kortweg PEC. Dichtbij huis dus, want de dienstverlening van ECH verloopt via ditzelfde platform. Met deze stap ben ik weer teruggegaan naar mijn roots, want ik ben ooit begonnen bij functioneel beheer. Dit beheerteam zorgt ervoor dat de diensten die op het PEC-platform draaien ten behoeve van de dagelijkse notariële werkzaamheden, stabiel aangeboden worden.’ Sterke groei op alle fronten ‘Kijkend naar de ontwikkeling van ECH kan ik niet anders dan zeggen dat er veel is gebeurd. Zoals ik in een eerder artikel al eens vertelde, was het nog best een uitdaging om de diensten van ECH in beginsel op de gewenste grote schaal op de markt te brengen. De één wilde wel met ons in zee, maar alleen als de ander dat ook wilde. Kortom, het was een verhaal van de kip en het ei. Al snel kantelde dat en moesten we alles op alles zetten om aan de aanvragen te kunnen voldoen’, lacht Maykel. ‘Dat was een mooie ontwikkeling om van dichtbij mee te mogen maken. Verder heb ik ervaren hoe de stichting, mede dankzij deze groei, snel professioneler werd. Dat uitte zich in allerlei zaken: van de sessies die we organiseerden met de hypothecair financiers en het notariaat tót het opzetten van de nieuwsbrief die op structurele basis aan onze relaties wordt verstuurd en vele zaken meer.’ ECH als tweede familie ‘Tot slot wil ik nog stilstaan bij de mensen die voor ECH werken, want zij zijn belangrijk voor me geweest. Zij voelen écht als een soort tweede familie kan ik wel zeggen. Er werd op een informele manier samengewerkt en er was vaak tijd voor een lolletje. Tegelijkertijd konden we heel hard werken met elkaar en werden deadlines gehaald. Datzelfde gevoel van een warm bad heb ik nu overigens ook binnen het beheerteam. En dat is belangrijk wat mij betreft, want ik geloof dat we de doelen die we met elkaar bespreken alleen halen als we er plezier in hebben samen. En dat heeft te maken met uitdaging, energie en gewoon zín hebben in je werk. Dat was bij ECH het geval en dat is in mijn nieuwe rol niet anders’, besluit Maykel. Meer informatie Voor vragen of andere informatie over ECH kan contact worden opgenomen via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:10:17Z",
  "source": "ech.nl"
}