{
  "id": "a9fe07c7b858443158f99e8f16af77b2d2cde380",
  "url": "https://www.ech.nl/notaris-controleer-e-mailadres-bij-ech-zodat-hypothecair-financiers-u-kunnen-bereiken/",
  "title": "Notaris: Controleer e-mailadres bij ECH zodat hypothecair financiers u kunnen bereiken - ECH",
  "text": "Notaris: Controleer e-mailadres bij ECH zodat hypothecair financiers u kunnen bereiken - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Notaris: Controleer e-mailadres bij ECH zodat hypothecair financiers u kunnen bereiken / Nieuws , Notaris / Door echadmin ECH wil notariskantoren erop wijzen dat zij bij ECH altijd een up-to-date e-mailadres registreren. Dit e-mailadres kan namelijk door de op ECH aangesloten hypothecair financiers worden gebruikt om uw kantoor te bereiken in het kader van de afhandeling van hypotheekdossiers. De afgelopen periode hebben zich enkele incidenten voorgedaan waarbij het bij ECH opgegeven mailadres van het notariskantoor niet up-to-date bleek te zijn. Dit kan voor ongewenste vertragingen zorgen bij de afhandeling van dossiers. De op ECH aangesloten hypothecair financiers communiceren bij voorkeur via ECH. Echter, niet alle partijen ondersteunen zowel het passeer- als het aflosproces van ECH. Ook zijn er soms vragen over lopende ECH-zaken. Het kan daarom voorkomen dat hypothecair financiers via e-mail contact met notariskantoren willen zoeken.  Deze communicatieberichten zijn veelal gericht aan het bij ECH bekende mailadres. Het up-to-date houden van uw e-mailadres in de administratie van ECH is daarom belangrijk. Geeft u een wijziging van het e-mailadres van uw kantoor door bij de KNB? Zorg er dan voor dat u deze wijziging óók doorvoert bij ECH . De e-mailadressen worden door ECH – in tegenstelling tot kantoornaam en adresgegevens – namelijk niet automatisch overgenomen van KNB. ECH voert een eigen administratie van e-mailadressen. Controleren/wijzigen e-mailadres bij ECH U kunt het bij ECH bekende e-mailadres van uw kantoor zelf inzien en wijzigen in de webapplicatie van ECH. De notaris dient hiertoe met zijn/haar persoonlijke account in te loggen door op NotarisNet te kiezen voor ‘Registers en applicaties’, vervolgens te navigeren naar ‘ECH’ en daar te kiezen voor ‘Inloggen’. In de webapplicatie kan rechtsboven worden gekozen voor ‘Kantoorinstellingen’, waar het e-mailadres kan worden gewijzigd. Gebruik e-mailadres door ECH Naast dat ECH het e-mailadres beschikbaar stelt aan de hypothecair financiers, gebruikt ECH dit e-mailadres ook om geautomatiseerd notificaties van nieuwe ECH-berichten en herinneringen van taken aan te sturen. Stelt u deze berichten niet op prijs? Dan kunt u de Servicedesk van ECH benaderen om deze geautomatiseerde berichten uit te schakelen. Wilt u meer weten over het wijzigen van gegevens binnen ECH voor u als notariskantoor? Of heeft u verdere vragen over het gebruik van ECH? Neem dan contact op met de Servicedesk van ECH via servicedesk@knb.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:27:53Z",
  "source": "ech.nl"
}