{
  "id": "aa5e3353e3ed8fc4eca74771aa863dcdd392f387",
  "url": "https://www.ech.nl/ech-verzoeken-een-nieuw-proces/",
  "title": "ECH Verzoeken - een nieuw proces - ECH",
  "text": "ECH Verzoeken - een nieuw proces - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH Verzoeken – een nieuw proces / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ECH is al meer dan 20 jaar dé digitale brievenbus voor de communicatie tussen notarissen en hypothecair financiers. Waar in het begin alleen het passeerproces ondersteund werd, zijn daar later het royeerproces en recent ook het bankgarantieproces aan toegevoegd. En dit jaar voegen wij daar weer een nieuw proces aan toe; het verzoekenproces . Hiermee kunnen notarissen verzoeken indienen om toestemming te verkrijgen voor voorgenomen juridische wijzigingen aan het onderpand. Bijvoorbeeld wanneer er een vervolghypotheek wordt gevestigd of de erfpachtvoorwaarden wijzigen. In elke hypotheekakte staat de voorwaarde dat de eigenaar geen veranderingen mag aanbrengen zonder voorafgaande toestemming van de hypotheekhouder. Wanneer in de praktijk een juridische wijziging wordt doorgevoerd waarbij een notaris betrokken is, dan vraagt de notaris ambtshalve die toestemming aan. Het betreft over de gehele breedte duizenden verzoeken per maand. Dergelijke verzoeken worden op verschillende manieren bij hypothecair financiers ingediend. Notarissen moeten uitzoeken aan welk adres het verzoek gericht moet worden en zelf bedenken welke informatie en documenten relevant zijn om in te dienen. Het opstellen van het verzoek is voornamelijk handwerk. Bij ontvangst wordt er veel tijd besteed aan het uitzoeken bij welke klant het verzoek thuis hoort en aan het opvragen van aanvullende informatie. De communicatie via post duurt lang en via e-mail brengt het beveiligingsvraagstukken met zich mee. Het ECH-platform heeft met de bestaande processen aangetoond dat deze belemmeringen weggenomen worden. Op verzoek van diverse hypothecair financiers en vertegenwoordigers uit het notariaat voegen wij daarom dit jaar het verzoekenproces toe aan ons platform. Vanuit de notariële software kan straks geautomatiseerd een verzoek samengesteld en verzonden worden. De relevante kerngegevens zijn afkomstig uit de database van de notaris. En de notaris ziet in één oogopslag welke aanvullende documenten meegezonden moeten worden bij het betreffende verzoek. Bij binnenkomst in de systemen van de hypothecair financier wordt het verzoek dan automatisch gekoppeld aan het juiste klantdossier en heeft de betreffende medewerker direct beschikking over de vereiste informatie en documenten. Het besluit of er wel of geen toestemming wordt gegeven kan met een druk op de knop direct bij de notaris afgeleverd worden. De komende weken ronden wij onze ontwikkelwerkzaamheden af en stellen het nieuwe proces beschikbaar voor implementatie door hypothecair financiers en notariële softwareleveranciers. De Volksbank met haar labels SNS Bank, ASN Bank, RegioBank en BLG Wonen wordt de eerste hypothecair financier die dit nieuwe proces in gebruik gaat nemen. De verwachting is dat dit proces in de winter ‘24/’25 beschikbaar komt voor de medewerkers. Meer informatie Wil je meer weten over het nieuwe proces Verzoeken of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T03:58:47Z",
  "source": "ech.nl"
}