{
  "id": "af38bf177661f356d36941a55e5c97d93638d679",
  "url": "https://www.ech.nl/bestuurswisselingen-bij-stichting-ech/",
  "title": "Bestuurswisselingen bij Stichting ECH - ECH",
  "text": "Bestuurswisselingen bij Stichting ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestuurswisselingen bij Stichting ECH / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris / Door Raymond Bloot “De afgelopen jaren vormden Jolanda de Heer, Ed Engelen, Bernadette Verberne en Peter Doornbos het enthousiaste en betrokken bestuur van Stichting ECH. En dat heeft ons bepaald geen windeieren gelegd. Zij zijn mede verantwoordelijk voor waar we nu staan en daar ben ik als algemeen directeur erg trots op en dankbaar voor”, aldus Lisa Huisman. Jolanda de Heer zal de Rabobank gaan verlaten. Per 1 oktober is ze aan het genieten van een sabbatical en derhalve heeft zij ook afscheid genomen van het ECH-bestuur. Tegelijkertijd moet Peter Doornbos (NN) om gezondheidsredenen zijn werk de komende maanden neerleggen, waardoor zijn inzet in het bestuur moet worden waargenomen. Om de continuïteit van ECH te borgen heeft het bestuur (na raadpleging van de Raad van Advies) besloten om John Smulders (Quion) aan te stellen als opvolger van Jolanda. Quion is reeds jaren een van de grotere partijen op ECH en John was al vaker nauw betrokken bij diverse thema’s. John Buhrs (Volksbank) is door de Raad van Advies als plaatsvervangend bestuurder aangesteld en zal de taken van Peter tijdelijk waarnemen. Dit geschiedt in principe voor een periode van 4 maanden. John is reeds eerder bestuurslid geweest bij ECH en zal dus snel ‘up and running’ zijn. John Smulders (Quion) – links & John Buhrs (Volksbank) – rechts Het gehele team van ECH verheugt zich op de nieuwe samenwerkingen en kijkt uit naar de frisse blik van de nieuwe bestuursleden! Heel veel succes en vooral veel plezier toegewenst John en John. Vanuit ECH gaat zeer veel dank uit naar Jolanda, die ons als persoon maar ook als bestuurslid erg veel heeft gebracht! En uiteraard wensen we Peter en zijn familie ongelooflijk veel sterkte en kracht voor de komende maanden. Binnenkort volgt een uitgebreide profielschets van onze nieuwe bestuursleden, stay tuned. Meer informatie Voor vragen of andere informatie aangaande dit artikel kan contact met ECH worden opgenomen via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:21:47Z",
  "source": "ech.nl"
}