{
  "id": "b17944492d8b5ec510e207ab35439b929d7d7b0c",
  "url": "https://www.ech.nl/hypotrust-elan-plus-hypotheken-live-op-het-ech-passeerproces/",
  "title": "Hypotrust Elan (Plus) Hypotheken live op het ECH passeerproces - ECH",
  "text": "Hypotrust Elan (Plus) Hypotheken live op het ECH passeerproces - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Hypotrust Elan (Plus) Hypotheken live op het ECH passeerproces / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Vandaag is Hypotrust met haar productlijnen Hypotrust Elan Hypotheken en Hypotrust Elan Plus Hypotheken live gegaan op het passeerproces van ECH. Voor het notariaat betekent dit dat zij per vandaag passeeropdrachten via ECH kunnen ontvangen. Passeerzaken die al lopen worden nog buiten ECH om afgehandeld. Dit kan nog tot en met augustus 2023 voorkomen. De Hypotrust Vrij Leven hypotheek was eerder als productlijn van Hypotrust al op dit proces overgegaan. Deze drie productlijnen zijn naast het royerenproces ook aangesloten op het passeerproces van ECH. Voor Quion is dit een volgende stap in efficiency binnen de keten. De instructies voor het notariaat zijn hier te vinden: Hypotrust Elan (Plus) Hypotheken Meer informatie Wil je meer weten over de livegang van Hypotrust met het passeerproces van ECH, of heb je algemene vragen over aansluiten op ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:23:45Z",
  "source": "ech.nl"
}