{
  "id": "b3582869b43deb8cd7305da8eaf7157fbf694004",
  "url": "https://www.ech.nl/succesvolle-samenwerking-tussen-van-brug-software-en-ech/",
  "title": "‘‘We streven een gezamenlijk doel na’, Dorien Bartels, Manager Customer Care bij Van Brug Software - ECH",
  "text": "‘‘We streven een gezamenlijk doel na’, Dorien Bartels, Manager Customer Care bij Van Brug Software - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘‘We streven een gezamenlijk doel na’, Dorien Bartels, Manager Customer Care bij Van Brug Software / Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door echadmin ‘Wij kijken vanuit Van Brug Software altijd naar hoe we de notaris met zo min mogelijk handelingen zo goed mogelijk zijn werk kunnen laten verrichten. Altijd vanuit onze kernwaarden ‘klantgericht, innovatief en betrouwbaar’. Daar waar het mogelijk is om te integreren doen we dat.’ Aan het woord is Dorien Bartels, Manager Customer Care bij Van Brug Software. Samenwerken met het platform van ECH scheelt extra handelingen voor de notaris en daarnaast is het hele proces minder foutgevoelig door inzet van automatisering. Ik kan me niet direct voorstellen waarom een softwareleverancier eigenlijk géén integratie van ECH in zijn pakket wil aanbieden. Ik werk al een kleine acht jaar binnen Van Brug en ook daarvóór werkte ik zelf in het notariaat al met dit platform. Dat wil wel iets zeggen.’ Dorien Bartels, Manager Customer Care bij Van Brug Software ECH en Van Brug: kenmerken samenwerking ‘De samenwerking met ECH kenmerkt zich door korte lijnen, duidelijke informatie en aanwezige, relevante kennis over de markt. De mensen die actief zijn binnen ECH weten veel van het notariaat, maar ook over banken en andere geldverstrekkers. Ik heb zelf een achtergrond in de wereld van het notariaat en ervaar het als erg prettig dat de partijen waarmee ik samenwerk kennis hebben van de processen die een rol spelen bij de notarissen. Dat werkt goed, gemakkelijk en daardoor komen we snel tot de kern’, aldus Dorien. En natuurlijk is er ook altijd ruimte voor verbetering. Zo kan de integratie altijd verder geperfectioneerd worden en zijn we daarnaast met zijn allen steeds bezig met het aansluiten van meerdere banken en andere financiële dienstverleners. Voor het notariaat is het maximale marktaandeel wel zo ongeveer bereikt, want we zitten op een ruime 95%. Al sluiten we die laatste procenten natuurlijk ook graag aan.’ ‘Door slimme oplossingen zorgen we er samen voor dat het notariaat en geldverstrekkers zoveel mogelijk ontlast worden. Mét een tevreden klant als eindresultaat’, Dorien Bartels, Manager Customer Care bij Van Brug Software. Gezamenlijk doel ECH en softwareleverancier ‘De kern van wat er gebeurt vanuit Van Brug Software, is ervoor zorgen dat het de notaris zo min mogelijk tijd, geld en daarmee energie kost om zijn dagelijkse werkzaamheden goed uit te kunnen voeren. Uiteindelijk werken we als softwareleveranciers in de markt, als notariskantoren en zeker ook vanuit stichting ECH allemaal naar hetzelfde resultaat toe. Iedereen doet dat vanuit een focus op zijn eigen core business. En dan is het gewoon fijn dat je een partner hebt zoals ECH die de werkzaamheden goed oppakt en de communicatie met de verschillende partijen verzorgt. Maar zoals gezegd kan het nog altijd sneller, efficiënter en beter. De tijd verandert, de wereld verandert en ik vind dat we daar als softwareleverancier én marktleider ook actief op in moeten spelen. En dat doen we dan ook. Het is daarbij heel prettig dat stichting ECH sámen met andere partijen in de markt daar actief in mee beweegt’, besluit Dorien. Meer informatie Wil je meer weten over de de visie van Dorien Bartels of de samenwerking tussen Van Brug Software en Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:11:19Z",
  "source": "ech.nl"
}