{
  "id": "b44d6760ba928e8355d10d55cb2c4b200b4b27a5",
  "url": "https://www.ech.nl/gerben-jonkman-in-bestuur-bij-stichting-ech/",
  "title": "Gerben Jonkman in bestuur bij Stichting ECH - ECH",
  "text": "Gerben Jonkman in bestuur bij Stichting ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Gerben Jonkman in bestuur bij Stichting ECH / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris / Door Raymond Bloot Per 1 februari is Gerben Jonkman, Managing Director BCMGlobal (Netherlands), toegetreden tot het bestuur van Stichting ECH. Jonkman was al enkele jaren lid van de raad van advies en neemt in het bestuur de positie van John Smulders, voormalig COO bij Quion, over. Gerben Jonkman , Managing Director BCMGlobal (Netherlands) Smulders heeft Quion per 1 februari jl. verlaten, waardoor zijn rol in het bestuur van ECH beperkt is gebleven tot de duur van enkele maanden. “Wij vinden het oprecht jammer dat John ons bestuur heeft moeten verlaten. We hadden graag nog langer gebruik gemaakt van zijn positief kritische houding, grote netwerk en kennis. We bedanken John voor zijn inzet en waardevolle bijdrage en wensen wij hem heel veel geluk, succes en plezier toe met de volgende stap in zijn carrière”, aldus Lisa Huisman, algemeen directeur Stichting ECH. “We zijn heel blij dat we met de toetreding van Gerben Jonkman zo snel een goede invulling aan de vacante bestuurszetel hebben kunnen geven. Met zijn jarenlange ervaring als serviceprovider en kennis van de markt, gaat hij ongetwijfeld toegevoegde waarde leveren. Bovendien is het heel prettig samenwerken met Gerben”, vertelt Huisman enthousiast. John Buhrs (Volksbank) blijft naar verwachting de rest van het jaar de bestuurszetel van Peter Doornbos (NN) waarnemen. Het bestuur van Stichting ECH wordt verder gevormd door Bernadette Verberne (Manager Innovatie KNB) en Ed Engelen (Notariaat Engelen en penningmeester KNB). Meer informatie Voor vragen of andere informatie aangaande dit artikel kan contact met ECH worden opgenomen via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:02:30Z",
  "source": "ech.nl"
}