{
  "id": "b50b4d02ee9486b1fd786e475ed4398aa565f7d7",
  "url": "https://www.ech.nl/ohpen-over-samenwerking-met-ech/",
  "title": "‘ECH staat voor kundig, behulpzaam en sympathiek’, Jerphaes van Blijenburgh, Software Development Consultant bij Ohpen - ECH",
  "text": "‘ECH staat voor kundig, behulpzaam en sympathiek’, Jerphaes van Blijenburgh, Software Development Consultant bij Ohpen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘ECH staat voor kundig, behulpzaam en sympathiek’, Jerphaes van Blijenburgh, Software Development Consultant bij Ohpen / Bestuur , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Wij zijn een softwareleverancier voor banken en maatschappijen. Wij leveren de software die zij nodig hebben om hypotheekaanvragen goed te accepteren en de leningen in beheer te nemen.’ Aan het woord is Jerphaes van Blijenburgh, Software Development Consultant bij Ohpen, een toonaangevende software ontwikkelaar voor klanten in de financiële wereld met producten voor hypotheken, leningen, sparen, beleggen en pensioenen. Opvallend: Ohpen is de eerste SaaS core banking engine in de wereld die volledig werkt vanuit de cloud. Jerphaes van Blijenburgh, Software Development Consultant bij Ohpen Uniforme berichtenstandaard ideaal ‘Onze software richten wij in naar de klantwensen, echter streven we daarbij wel om zo generiek mogelijk zaken toe te passen en maatwerk te minimaliseren. Geheel voorkomen lukt ons niet, daar elke organisatie een eigen gedetailleerd acceptatiekader heeft en dat opgenomen wil hebben. Denk aan zaken als hoeveel iemand mag lenen, wat een geldig inkomen is et cetera. Je kan zeggen dat we zowel onze klanten, als de notarissen met gebruik van ECH zo goed mogelijk proberen te faciliteren’, vervolgt Jerphaes. ‘Voor onze klanten en ‘hun’ notarissen betekent de samenwerking met ECH rust en gemak. Voor Ohpen biedt dit duidelijkheid, eenduidigheid en een vast protocol waarop geen uitzonderingen zijn. Want daarvoor wordt er een marktstandaard aangehouden die ideaal in de processen van de betrokken partijen past. En uiteindelijk is iedereen, ook de consument, gebaat bij een soepel en efficient proces. In de praktijk is dat een proces dat zo geautomatiseerd mogelijk verloopt.’ Geautomatiseerd berichtenverkeer ‘ECH levert softwareleveranciers berichtstructuren, het proces en ketenafspraken, waardoor de integraties in applicaties eenvoudiger en eenduidiger verwerkt kunnen worden. Onze software sluit daarmee heel goed aan op ECH dat feitelijk als postbus fungeert. Het grote voordeel voor ons is dat we voor de banken en maatschappijen die onze software gebruiken, geautomatiseerd kunnen communiceren en dat vanuit een goed gedefinieerd proces. Dit betekent dat zowel de notaris als onze klanten weten wat en wanneer ze iets van elkaar kunnen verwachten. En dat is weer prettig omdat zij daardoor hun eigen proces weer strak kunnen inrichten. Denk bijvoorbeeld aan een onderwerp als bereidstellingsprovisie. Wanneer daarin een wijziging plaats vindt, nadat de definitieve nota met daarin een kostenoverzicht verstuurd is, dan komt er vanuit onze software geautomatiseerd een bericht en wordt er een nieuwe, kloppende afsluitende nota verstuurd. De berichtenstandaard, procesflow en ketenafspraken van ECH zijn naadloos geintegreerd in onze software en dat is voor ons én onze klanten heel prettig.’ ‘ECH heeft echt goede documentatie en dat kom je in IT-land niet zo vaak op die manier tegen.’, zegt Jerphaes van Blijenburgh, Software Development Consultant bij Ohpen Persoonlijke samenwerking ‘Als ik, los van de software, kijk naar de samenwerking met ECH dan kan ik niet anders dan zeggen dat het allemaal erg prettig verloopt. Wanneer je een vraag hebt dan krijg je, als dit bijvoorbeeld via e-mail gaat, antwoord van een persoon en niet een gestandariseerd antwoord. En niet vanuit een algemeen e-mailadres van de IT-afdeling dat door verschillende personen beheerd wordt, waardoor je minder snel een band opbouwt. Dat vind ik heel prettig. Daarnaast is de begeleiding die ze bieden, zowel richting de maatschappij als richting mij als softwareleverancier van hoog niveau. Bij een vraag krijg ik zelden het antwoord dat men het niet weet. Je merkt aan alles dat de mensen die bij ECH werken weten hoe het er aan toe gaat bij de notaris en maatschappijen. Dat is heel fijn. Doordat het geen grote logge organisatie is en men altijd bereid is om de handen uit de mouwen te steken ervaar ik de samenwerking als een partnerschap op gelijkwaardig niveau. Samenvattend vind ik de mensen van ECH kundig, behulpzaam en sympathiek.’ Tips voor andere softwareleveranciers ‘Mocht een andere softwareleverancier een samenwerking met ECH overwegen dan is dit mijn tip: lees de certificeringshandleiding goed door. Je kunt, omdat de handleiding zo zorgvuldig is opgesteld, nagenoeg alles terugvinden wat belangrijk is voor het (snel) verkrijgen van de certificering en daarmee livegang op het platform. ECH heeft echt goede documentatie en dat kom je in IT-land niet zo vaak op die manier tegen.’ Mooie projecten op de planning Jerphaes besluit: ‘De komende maanden staan er nog een aantal mooie projecten op de planning. Zo willen we, binnen het proces passeren, de hypotheekakte automatisch uit kunnen lezen zodat deze gevalideerd kan worden na passeren. Dat kan nu nog niet geautomatiseerd en daar ligt zeker nog een uitdaging waarin we graag met ECH willen kijken naar de mogelijkheden. Daarnaast zijn we druk bezig met het inbouwen van het proces royeren voor (een van) onze klanten, we hopen aan het eind van dit jaar met een eerste versie te komen. Je kunt je voorstellen dat we de samenwerking met ECH heel serieus nemen en de berichtenstandaard graag inzetten om onze klanten zo goed mogelijk te helpen.’ Meer informatie Wil je meer weten over de de visie van Jerphaes van Blijenburgh of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T04:03:21Z",
  "source": "ech.nl"
}