{
  "id": "b5ddd1e23fabe826ac2d8fc885cb0138f324a0b2",
  "url": "https://www.ech.nl/wijziging-omgang-kew-bij-royeren-bij-nationale-nederlanden/",
  "title": "Wijziging omgang KEW bij royeren bij Nationale-Nederlanden - ECH",
  "text": "Wijziging omgang KEW bij royeren bij Nationale-Nederlanden - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Wijziging omgang KEW bij royeren bij Nationale-Nederlanden / Bestuur , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Raad van Advies , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Wat verandert er? In plaats van een Kapitaalverzekering Eigen Woning (KEW) na de aflosdatum af te kopen en af te handelen met de klant, gaat Nationale-Nederlanden dit nu voor de aflosdatum doen en daarmee het gehele opgebouwde vermogen verrekenen met de resterende hypotheekschuld. Om een KEW voor de aflossing te verrekenen is het belangrijk dat het verzoek 5 weken voor de beoogde aflosdatum bij Nationale-Nederlanden binnen is. Deze termijn geldt voor alle KEW-polissen. Waarom wordt dit beleid aangepast? Het afkopen en verrekenen van de verzekering kost tijd. Daarom deed Nationale-Nederlanden dit feitelijk pas na de aflosdatum bij de notaris en kon er nog een finale afrekening na die datum met de klant plaatsvinden. Bij het opstellen van de aflosnota voor KEW-polissen met een beleggingscomponent werd er slechts rekening gehouden met 60% van de actuele waarde op het moment van het opstellen van de aflosnota. De overige 40% werd achteraf verrekend met de klant nadat de polis was afgekocht en de definitieve waarde bekend was. Klanten geven geregeld feedback dat ze dat proces complex en klantonvriendelijk vinden. Daarnaast bellen ze vaak met vragen over de afhandeling achteraf. Een ander punt is dat er ook mogelijk nadelige fiscale gevolgen zijn indien de klant de achteraf uitbetaalde waarde niet (volledig) gebruikt voor de aflossing van zijn eigenwoningschuld. Bespreek daarom tijdig met de klant wat er met een KEW-verzekering moet gebeuren. Wat betekent dat voor jou? Lopende afloszaken met verrekening van een KEW die al voor 1 juli 2024 zijn ingediend worden conform de afspraak nog afgehandeld. Nieuwe aflosverzoeken vanaf 1 juli worden afgehandeld conform het nieuwe beleid. Wanneer je niet zeker weet of je verzekering een KEW-verzekering is, vul dan op de website van Nationale-Nederlanden het polisnummer in. Meer informatie Voor vragen kan je Nationale-Nederlanden bellen via 088-663 06 63. Bereikbaar op werkdagen van 8.00 tot 18.00 uur. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:11:46Z",
  "source": "ech.nl"
}