{
  "id": "b8652bca68a8bb558f7f4fdfc11feab6503d5217",
  "url": "https://www.ech.nl/notarissen/robuust-hypotheken/",
  "title": "Robuust Hypotheken - ECH",
  "text": "Robuust Hypotheken - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Quion Proces: Passeren & Royeren E-mail: info@quion.com Telefoon: 010 242 1598 01 02 03 Nieuwsberichten Passeren Royeren Deelnemersinfo Robuust Hypotheken Algemene informatie/nieuwsberichten (kort) Notarisinstructie passeer proces Passeerproces Passeeropdracht U ontvangt de passeeropdracht van ons via ECH met als bijlage de invulinstructie. Op basis hiervan kunt u, samen met de meest recente hypotheekakte vanuit de modellenbank van de KNB, de hypotheekakte opstellen. Melden passeergegevens U kunt nu de passeerdatum, het passeertijdstip invullen en aangeven of u een specifiek bedrag nodig heeft. Het melden van gelden willen wij alleen indien dit is aangegeven bij de passeeropdracht.  De passeerdatum die u kunt opgeven, ligt minimaal 3 werkdagen in de toekomst. Lukt dit niet op tijd? Bel ons gerust op 010-242 1598, dan bekijken we de mogelijkheden. Melden gelden Wij verzoeken u het melden van de gelden dezelfde dag in te dienen als de Passeergegevens, maar uiterlijk 3 werkdagen voor passeren. Houdt u bij het melden van de gelden alstublieft rekening met het bedrag dat aan eigen middelen moet worden ingebracht. Gaat het om nieuwbouw? Stuur ons dan de notarisafrekening en een overzicht van de vervallen termijnen als bijlage mee. Sluitnota In de sluitnota staat het uitbetaalbedrag en staan de notaregels vermeld. Op de dag van passeren kan er een wijzigingsbericht volgen omdat er op dat moment nog een laagste rentecontrole wordt uitgevoerd. Het gevolg hiervan kan een lagere rente zijn of alsnog of juist geen bereidstellingskosten. Passeerbevestiging Na het passeren ontvangen wij graag binnen 3 werkdagen de passeerbevestiging. Is de passering uitgesteld of gaat de passering niet door? Geef dit via ECH aan ons door. Heeft u de gelden al ontvangen? Dan kunt u deze terugstorten op de rekening waarvan u het heeft ontvangen. Bij een uitstel van minder dan 5 werkdagen vragen wij u om de helden niet terug te storten. Aandachtspunten maatschappij: Wijziging passeerdatum Wij verzoeken u een wijziging van de passeerdatum altijd uiterlijk 3 werkdagen voor de huidige passeerdatum via ECH door te geven. Dit zorgt ervoor dat wij de wijziging ook tijdig in onze systemen kunnen doorvoeren. Als de nieuwe passeerdatum binnen 5 werkdagen na de oorspronkelijke passeerdatum plaatsvindt, is het niet nodig om eventueel ontvangen gelden terug te storten. Wijziging passeeropdracht Als uw klant een wijziging aan ons doorgeeft of als wij een wijziging doen, dan wordt er een nieuwe passeeropdracht aangemaakt onder hetzelfde ECH zaaknummer. U ontvangt hierover bericht via ECH. Koop-of kortingsconstructies in combinatie met NHG Als er sprake is van een koop- of kortingsconstructie is dit standaard akkoord in combinatie met NHG. U hoeft hiervoor geen akkoord te vragen. Dit is inclusief de constructies in combinatie met een starterslening. Contact Voor inhoudelijke vragen over een zaak kunt u contact opnemen met Quion via het telefoonnummer 010 242 1598. Wij zijn bereikbaar op werkdagen van 09.00 tot 17.30 uur. Uw mening is belangrijk. Geef verbeteringen aan ons door! Heeft u een vraag, opmerking of verbetering over ons ECH proces? Stuur dan een e-mail naar ProductteamMidoffice@Quion.com . Notarisinstructie royeer proces Royeerproces Meerdere aflosverzoeken per klant De aflosverzoeken worden verwerkt door Quion Groep B.V. . Heeft u voor een klant meerdere aflosverzoeken bij Robuust Hypotheken? Dit kunt u aan ons doorgeven in een gezamenlijk ECH-verzoek. Geeft u dan per hypotheek de kadastrale gegevens door. Gaat het om overbruggingshypotheek? Dan graag altijd in een apart verzoek. Deze royementen kunnen via ECH worden aangevraagd: Een geheel royement van een hypotheek op een onderpand Een gedeeltelijk royement van overbruggingshypotheken. Wanneer u het verzoek via ECH kunt indienen, vragen wij u om geen email te sturen. Verzoeken per email die via ECH kunnen worden ingediend, worden door ons niet in behandeling genomen. Deze royementen kunnen niet via ECH worden aangevraagd: Een aflosverzoek waarbij het onderpand wijzigt. Bijvoorbeeld met een verkoop van de garagebox, schuur of parkeerplaats of een ruiling van een stuk grond. Een geheel royement van een hypotheek die voor 01-06-2012 volledig is afgelost. Graag meesturen met de e-mail: een royementsvolmacht onder vermelding van het dossiernummer van de afgeloste hypotheek. Voor deze royementen stuurt u een mail naar info@quion.com . Voor een snelle doorstroom van uw verzoek vragen wij u in het onderwerp van de e-mail aan te geven of het een aflosverzoek voor wijziging onderpand betreft of een aflosverzoek van voor 01-06-2012. Aflosnota opvragen Wij hanteren een aankondigingstermijn van minimaal 15 dagen. Wij streven er naar om aflosnota’s uiterlijk 5 werkdagen voor aflosdatum aan te leveren, bij uitzondering is dit korter. Heeft u vier werkdagen voor de aflosdatum niets van ons gehoord, neemt u dan contact met ons op via 010-2421598. Wijziging op een lopend ECH-zaaknummer Gewijzigde aflosdatum Wijzigt de aflosdatum meer dan 4 werkdagen eerder of later: Dan kunt u via een lopend ECH-zaaknummer gemakkelijk een wijziging van de aflosdatum doorgeven. Wijzigt de aflosdatum minder dan 4 werkdagen eerder of later Dan kunt u het totaalbedrag vermeerderen of verminderen met de dagrente voor elke dag dat de betaling later of eerder heeft plaatsgevonden ten opzichte van de huidige aflosdatum. Overige wijzigingen Ook alle overige wijzigingen kunt u aan ons doorgeven via het lopende ECH-zaaknummer. Zoals het toevoegen van een kadastrale inschrijving of het toevoegen van een klant. Contact Heeft u een vraag over aflossen? Neemt u dan contact met ons op via telefoonnummer 010-2421598. Wij helpen u graag op werkdagen van maandag tot en met vrijdag van 8.30 tot 17.30 uur. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:29:12Z",
  "source": "ech.nl"
}