{
  "id": "b931f91445626497e7fefb1e415220735dd19a64",
  "url": "https://www.ech.nl/tarieven-ech-2023/",
  "title": "Tarieven 2023: ECH past prijsindexatie toe - ECH",
  "text": "Tarieven 2023: ECH past prijsindexatie toe - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Tarieven 2023: ECH past prijsindexatie toe / Bestuur , KNB , Nieuws , Notaris , Wijzigingen / Door Raymond Bloot Het bestuur van Stichting ECH heeft, na consultatie van de Raad van Advies, de tarieven voor 2023 vastgesteld. Gezien de ontwikkelingen op de hypotheekmarkt alsmede de stijging van prijzen waarmee iedereen zich geconfronteerd ziet, zal ECH haar tarieven dit jaar indexeren. Het betreft een indexatie van 8,36% op zowel de tariefstelling voor het notariaat als de hypothecair financiers. Naast de indexering worden – net als vorig jaar – de inkomsten uit het passeer- en royeerproces verder met elkaar in evenwicht gebracht. Dit zorgt ervoor dat het notariaat het tarief voor een passeerzaak ziet dalen, terwijl het tarief voor een royementszaak stijgt. Nieuwe tarieven per 2023 Per 1 januari 2023 betaalt het notariaat voor een passeerzaak € 8,22 en voor een royementszaak € 2,38. De korting van 10 % (oftewel € 0,82 per passeerzaak) op het tijdig versturen van de passeerbevestiging blijft onveranderd van kracht. De transactiekosten voor het gebruik van de ECH webapplicatie gaan € 2,06 bedragen. De kosten voor een bankgarantiezaak blijven € 0,00. Alle genoemde bedragen zijn exclusief BTW. Meer informatie Wil je meer weten over de tarieven van Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:13:12Z",
  "source": "ech.nl"
}