{
  "id": "ba6c3f5fd8d704235f8e37a7112fd42c6c2a7a89",
  "url": "https://www.ech.nl/ing-zet-volgende-stap-in-digitalisering-hypotheekproces-met-aansluiting-op-ech/",
  "title": "Ing zet volgende stap in digitalisering hypotheekproces met aansluiting op ECH - ECH",
  "text": "Ing zet volgende stap in digitalisering hypotheekproces met aansluiting op ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Ing zet volgende stap in digitalisering hypotheekproces met aansluiting op ECH / Nieuws / Door Ruby Ing gaat in januari landelijk live met het aflosproces via elektronische communicatie hypotheken (ECH). De exacte datum wordt binnenkort bekend. Royementsverzoeken van, in eerste instantie algehele doorhalingen, kunnen dan via ECH ingediend worden, gedeeltelijke aflossingen zullen later volgen. ING zet hiermee een nieuwe stap in het verder digitaliseren van het hypotheekproces. Lisa huisman, directeur stichting ECH: “het vervult mij met plezier en trots dat we ING nu ook landelijk mogen verwelkomen in ons platform voor digitaal berichtenverkeer tussen banken en notarissen.” Ing wil de dienstverlening voor haar klanten graag verder optimaliseren. De mogelijkheid om met ECH volledig digitaal, eenduidig en betrouwbaar met het notariaat te kunnen communiceren versterkt het hypotheekproces. Ook voldoet ECH aan de europese wet- en regelgeving op het gebied van veiligheid en privacy. Meer informatie Op onze ECH-website staat een uitgebreide instructie voor het notariaat van ing. Op ing.nl/notaris is meer informatie te vinden over het huidige proces van ing.Bij vragen over dit nieuwsbericht kunnen notariskantoren zich wenden tot de servicedesk van stichting ECH . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:24:02Z",
  "source": "ech.nl"
}