{
  "id": "bab71515c5c76865a9d3083c8e53a72c79098c5e",
  "url": "https://www.ech.nl/stephanie-scheiberlicht-voor-ech-over-virtuele-collega-els-de-bot/",
  "title": "‘Onze collega Els de Bot? Die werkt vooral als wij naar huis zijn’, Stephanie Scheiberlich, notaris bij Kern notarissen - ECH",
  "text": "‘Onze collega Els de Bot? Die werkt vooral als wij naar huis zijn’, Stephanie Scheiberlich, notaris bij Kern notarissen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Onze collega Els de Bot? Die werkt vooral als wij naar huis zijn’, Stephanie Scheiberlich, notaris bij Kern notarissen / KNB , Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door Raymond Bloot ‘Onze collega Els begint ’s ochtends om 6 uur. En als wij ’s avonds naar huis gaan dan werkt zij verder. Soms tot diep in de nacht. Haar achternaam? De Bot. Els de Bot is namelijk onze virtuele arbeidskracht. En ze neemt ons veel, heel veel repeterend werk uit handen.’ Aan het woord is Stephanie Scheiberlich , notaris bij Kern notarissen . Het kantoor in Harderwijk staat bekend om de toegankelijkheid en maatschappelijk betrokken werkwijze. ‘Doe maar gewoon’ en ‘gaan voor kwaliteit’ zijn de kernwaarden en van ‘stoffig’ en ‘ingewikkeld’ moet men niets hebben. Stephanie Scheiberlich, notaris bij Kern Notarissen Els neemt saai, repeterend werk over ‘Els de Bot voert een behoorlijk aantal handelingen uit die mijn medewerkers nu niet meer hoeven te doen. Denk bijvoorbeeld aan het centraal digitaal repertorium. Daarin krijgt elke akte een uniek nummer. Virtuele collega Els is voortaan degene die de akte koppelt en klaarzet voor mij als notaris. Dat werkt heel praktisch: wanneer ik ’s morgens om 9 uur begin dan hoef ik hetgeen klaargezet is alleen maar te checken, vervolgens zet ik mijn digitale handtekening en de stukken gaan door naar de Belastingdienst. Een ander voorbeeld gaat over de Wwft. Vanuit die wet wordt gesteld dat mensen met een bepaalde functie een PEP-verklaring moeten tekenen. Ook het verwerken daarvan is in feite saai repeterend werk. Maar wel werk dat moet gebeuren. Els regelt het: het staat de volgende werkdag allemaal keurig gereed.’ ‘ Kortom, zie niet alleen de beren op de weg maar pak ook de kansen die digitalisering biedt. Dan komt het allemaal dik in orde’, zegt Stephanie Scheiberlich. Werk voor medewerker interessanter ‘Door op deze manier met de technologische mogelijkheden om te gaan maak je het werk voor de medewerker interessanter. Met deze applicatie, want dat is Els natuurlijk in de basis, kun je zelf je wensen vervullen. Je hoort weleens dat mensen bang zijn voor het verliezen van hun werkplek als digitalisering om de hoek komt kijken. Dat was bij ons op geen enkel moment het geval. Dat heeft ook te maken met de manier waarop we het intern aangepakt hebben: we hebben onze mensen vanaf het begin bij dit project betrokken en gevraagd van welke werkzaamheden ze liever afscheid wilden nemen. Daardoor werd Els als kans gezien in plaats van een bedreiging.’ Het gaat om de juiste balans ‘Overigens probeer ook ik nog steeds de balans te zoeken tussen het menselijke en het digitale aspect. Al ben ik er wel van overtuigd dat je als notaris niet bang moet zijn voor de ontwikkelingen die plaatsvinden, ze komen immers toch wel. Zo zit de wereld immers in elkaar. Ik vind dat je vooral gebruik moet maken van de mogelijkheden die er zijn door hetgeen je verder kan helpen, zo goed mogelijk te adopteren en te implementeren. Wij zetten voor ons kantoor de beste zaken in. Het gaat erom dat je keuzes maakt die bij je passen. Om me heen zie ik in de beroepsgroep nog altijd mensen die het niet echt oppakken. Een gemiste kans wat mij betreft, want het is niet de vraag óf je hiermee aan de slag gaat maar wanneer.’ Lezing aan studenten: angst voor baanverlies én oog voor kansen ‘Ik gaf laatst een lezing over robotisering en digitalisering in het notariaat, voor een groep studenten van de Universiteit Groningen. Wat ik niet verwacht had gebeurde wel: je zag die twintigers schrikken toen ik over de technologische ontwikkelingen sprak. Vervolgens heb ik uitgelegd dat deze vooruitgang juist betekent dat je meer tijd hebt voor specifieker, interessanter werk. Je krijgt immers ruimte voor verdieping aan de uitvoerende kant. Er waren ook andere sprekers aanwezig en er ontstond een mooie dialoog over hoe ver iedereen op dit moment is op dit vlak. Uit de zaal kwamen ook vragen van studenten die nu bijvoorbeeld een bijbaantje op een notariskantoor hebben en precies dát werk doen dat Els de Bot over kan nemen. De eindconclusie was dat ze niet bang hoeven te zijn dat ze niet meer nodig zijn. Want één aspect blijft altijd bestaan. En dat is het menselijke aspect.’ De notaris als ondernemer ‘Persoonlijk vind ik dat je als notaris ook je ondernemerschap laat zien door mee te gaan in de (digitale) vooruitgang. Daarmee straal je uit dat een notaris verder kijkt dan alleen de akte die getekend moet worden. Wanneer ik klanten over Els de Bot vertel verschijnt er steevast een glimlach op hun gezicht. Kortom, zie niet alleen de beren op de weg maar pak ook de kansen die digitalisering biedt. Dan komt het allemaal dik in orde’, besluit Stephanie. Meer informatie Wil je meer weten over de de visie van Stephanie Scheiberlich of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:28:43Z",
  "source": "ech.nl"
}