{
  "id": "bc52df9dcf3ca17da0ed3176a100231760fc71a1",
  "url": "https://www.ech.nl/verbetering-van-de-pdf-invulinstructie-bij-hypotheekakten/",
  "title": "Verbetering van de PDF invulinstructie bij hypotheekakten - ECH",
  "text": "Verbetering van de PDF invulinstructie bij hypotheekakten - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Verbetering van de PDF invulinstructie bij hypotheekakten / Hypotheekmarkt , KNB , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot In het kader van ons programma ter verbetering van de kwaliteit van hypotheekakten heeft Stichting ECH een grondige inventarisatie uitgevoerd. Eén van de geïdentificeerde mogelijkheden voor optimalisatie betreft de leesbaarheid van de PDF van de invulinstructie bij hypotheekakten. Het goede nieuws is dat deze verbeteringen kunnen worden doorgevoerd door ECH zonder dat aangesloten partijen technische aanpassingen hoeven door te voeren. Bij uitgebreide hypotheekaktes is een eenvoudige passeeropdracht niet voldoende; notarissen hebben een uitgebreide invulinstructie nodig. Deze instructie wordt door de hypothecaire financier aangeleverd in het zogenaamde xml-formaat. De notaris kan diens eigen software gebruiken om automatisch de concept hypotheekakte samen te stellen. Op het ECH-platform wordt van elke instructie een leesbare PDF-versie gegenereerd en naar de notaris gestuurd. Deze PDF is belangrijk voor medewerkers op het notariskantoor, aangezien ze daarmee de concept-akte kunnen controleren of, in geval van software die het automatisch genereren niet ondersteunt, handmatig kunnen aanmaken. De huidige versie van de PDF kenmerkt zich door dicht op elkaar staande tekst, waarbij percentages en bedragen als gewone cijfers zonder opmaak worden weergegeven. Hierdoor ontstaan eerder fouten in de concept-hypotheekakte. Een significante verbetering wordt doorgevoerd door niet langer expliciet te beschrijven welke elementen niet moeten worden opgenomen, maar te volstaan met het opsommen van de elementen die wel van toepassing zijn. Hierdoor wordt de instructie korter en duidelijker. Daarnaast zijn extra witruimte en de juiste opmaak van bedragen en percentages geïmplementeerd, waardoor het document niet alleen duidelijker wordt, maar ook een prettiger leeservaring biedt. Deze verbeteringen dragen bij aan de efficiëntie van het notariële proces en bevorderen de nauwkeurigheid bij het opstellen en controleren van hypotheekakten. Meer informatie Wil je meer weten over het project of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:09:14Z",
  "source": "ech.nl"
}