{
  "id": "bd627c2eda9d3f18b2f6f90bdd4d7fc798b98c45",
  "url": "https://www.ech.nl/robert-jan-van-pelt-directeur-change-ech/",
  "title": "‘Mensen en vernieuwing, daar word ik gelukkig van’, Robert Jan van Pelt, nieuwe directeur Change bij ECH - ECH",
  "text": "‘Mensen en vernieuwing, daar word ik gelukkig van’, Robert Jan van Pelt, nieuwe directeur Change bij ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Mensen en vernieuwing, daar word ik gelukkig van’, Robert Jan van Pelt, nieuwe directeur Change bij ECH / Bestuur , Directie ECH , ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot ‘Oorspronkelijk was het idee dat we de rol van directeur Change en die van Product Owner binnen dezelfde functie zouden beleggen. De Product Owner is immers diepgaand op de hoogte van de werkzaamheden en processen binnen ECH en daarmee kan, zo veronderstelden we, het verandertraject goed vormgegeven worden. Maar dat bleek zowel qua brede inhoud van de functie als qua hoeveelheid tijd nogal ambitieus gesteld. Daarom hebben we deze rol gesplitst in een directeur Change en een rol van Product Owner, die Johan Agterberg met verve vervuld.’ Dat zegt Robert Jan van Pelt , de nieuwe directeur Change binnen stichting ECH. ‘Juist door onze verschillen zijn Johan en ik een ideaal koppel, we vullen elkaar precies aan daar waar nodig. Vooruitgang is de rode draad in onze samenwerking, waarbij we vasthouden aan de basis van ECH die rust op veiligheid en betrouwbaarheid.’ Robert Jan van Pelt, Directeur Change ECH Uitbreiden en onderhouden ‘We gaan ons vooral bezig houden met het uitbreiden van de bestaande dienstverlening, het onderhouden van bestaande relaties en het aangaan van nieuwe samenwerkingen in de markt’, aldus Robert Jan. ‘Kijkend naar de bestaande dienstverlening gaat dit bijvoorbeeld over een wens die hypothecair financiers en het notariaat al langer uitspreken, namelijk die van automatische akte controle. Concreet betekent dit dat de hypothecair financiers hun gegevens beschikbaar stellen aan het notariaat en het model van de akte waarbinnen deze akte moet worden opgemaakt. Op dit moment verschillen de opgenomen gegevens in de akte soms nog van hetgeen de bank heeft aangegeven. Dat kan verschillende oorzaken hebben. Er ligt een duidelijke behoefte om automatisch te kunnen controleren of de inhoud van de akte gelijk is aan hetgeen de bank of andere financiële instelling heeft aangeleverd. We starten met onderzoeken waar de verschillen vandaan komen en hebben dan een beter idee welke oplossing het best kan worden doorontwikkeld. Dit onderwerp staat in de top drie van zaken die we met prioriteit op willen pakken. Een ander onderwerp is ontslag hoofdelijke aansprakelijkheid dat een rol kan spelen wanneer mensen uit elkaar gaan. Het proces waar je als consument doorheen moet is dan behoorlijk ingewikkeld. En wij geloven dat dit eenvoudiger kan door een procesverbetering door te voeren. Na overleg met de partners zullen we, samen met het bestuur, uiteindelijk besluiten welke verbeteringen we als eerste zullen beetpakken. Veel kansen ‘Ook liggen er kansen om het netwerk tussen ECH, banken en het notariaat breder in te zetten. Een mooi voorbeeld daarvan is de verklaring van erfrecht. De notaris zou deze op kunnen maken, zoals dat nu al gebeurt, en rechtstreeks aan kunnen bieden bij de bank. Ook dit is een onderzoeksonderwerp dat we in de komende periode nader bekijken. En rondom nieuwe samenwerkingen denk ik al snel aan het initiatief Zorgeloos Vastgoed waar we het voornemen hebben om aan deel te nemen.  Daarnaast zijn we aan het onderzoeken of we samen met HDN het berichtenverkeer tussen het intermediair en de notaris kunnen verbeteren.’ Belangrijke pijlers ‘Onze change strategie rust op een aantal pijlers, die bakenen het af. Zo is een belangrijk uitgangspunt dat ECH zich bezighoudt met de ontsluiting van het notariaat, waarbij de processen ‘passeren’ en ‘aflossen’ centraal staan. Daar ligt onze focus en binnen die kaders blijven we acteren. Daarnaast zorgen we er bij onze keuzes altijd voor dat er balans is tussen de meerwaarde voor het notariaat en de geldverstrekkers. Bij de ontwikkeling van nieuwe kanalen willen wij dit het liefst doen met bestaande partijen die al langer actief zijn in de markt’, vervolgt Robert Jan. ‘Tot slot kijken we naar de markt: het is duidelijk dat de markt in 2023 verder onder druk kan komen te staan. Dit betekent dat we, kijkend naar nieuwe initiatieven, zorgvuldig beoordelen wat we wel en niet op gaan pakken.’ Business development als rode draad ‘Deze rol past heel goed bij me: ik ben mijn hele loopbaan al bezig met business development, met het ontwikkelen van nieuwe diensten. Zo heb ik meegeholpen aan het opzetten van een nieuwe bank in Ierland, in Maleisië een nieuwe online autoverzekeraar gelanceerd en in Vietnam de marketing en sales van een nieuwe levensverzekeraar geleid. In Nederland ben ik in het verleden verantwoordelijk geweest voor het nieuwe kantoorconcept van Fortis Bank (nu onderdeel van ABN AMRO Bank). Ik krijg energie van bouwen en het zien van de resultaten: pas wanneer het écht draait wil ik loslaten.’ Robert Jan in ’t kort: muziek, reizen en koken ‘Van huis uit ben ik muzikant, ik heb 18 jaar als toetsenist in een band gespeeld, zowel in Nederland als daarbuiten. Ook componeer ik mijn eigen muziek. Verder houd ik van lekker koken en we reizen graag. Work hard, play hard, dát past bij mij. Ik steek veel energie in mijn werk, maar bouw ook graag feestjes. Uiteindelijk word ik het gelukkigst van samenwerken met mensen en volop bezig zijn met innovatie.’ Meer informatie Wil je meer weten over de de visie van Robert Jan van Pelt of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:08:00Z",
  "source": "ech.nl"
}