{
  "id": "bd65fe7640b29bcf1e07c2f4babe46250e4acd18",
  "url": "https://www.ech.nl/notariele-softwareleverancier-quantaris-als-eerste-op-ech-4-0/",
  "title": "Notariële softwareleverancier quantaris als eerste op ECH 4.0 - ECH",
  "text": "Notariële softwareleverancier quantaris als eerste op ECH 4.0 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Notariële softwareleverancier quantaris als eerste op ECH 4.0 / Nieuws / Door Ruby Stichting ECH informeert u met veel plezier over de certificering van de allereerste notariële softwareleverancier quantaris op ECH 4.0. Maykel van londen heeft reeds vele certificeringen namens ECH verricht en spreekt over een succesvol verlopen traject. Het pakket qu-bis geeft daarmee haar notariële klanten de mogelijkheid om van de nieuwe functionaliteiten binnen ECH 4.0 gebruik te maken. Bas mathon, managing director van quantaris vindt het belangrijk dat qu-bis aansluit bij de digitalisering van processen met ketenpartners. “samen zorgen we ervoor dat de transacties veilig, direct en volledig digitaal voor onze notarissen verlopen. De integratie met ECH 4.0 heeft daarom ook topprioriteit gehad op de ontwikkelagenda. Wij zijn blij dat quantaris als eerste erin is geslaagd om ECH 4.0 naadloos in qu-bis in te passen zodat de werkprocessen nog efficiënter kunnen verlopen.” Doordat quantaris gecertificeerd is voor ECH 4.0 kunnen de notariskantoren die gebruik maken van qu-bis profiteren van de nieuwe mogelijkheden die ECH 4.0 biedt. Denk hierbij aan het ontvangen van de gestructureerde invulinstructie vanuit de hypothecair financier. Dit gaat het nog makkelijker maken voor notariskantoren om de hypotheekakte op te stellen. Daarnaast kan het afschrift van de akte voortaan digitaal aangeleverd worden aan maatschappijen. Hetzelfde geldt voor de notarisverklaring. Hierdoor vervalt het laatste stukje papieren proces. Ook ‘gedelegeerd’ werken behoort nu tot de mogelijkheden. Van brug, Devoon en dirict hebben eveneens een certificeringsdatum ingepland, zodat ook hun klanten zsm kunnen profiteren van de mogelijkheden binnen ECH 4.0. Bent u benieuwd naar de nieuwe functionaliteiten en of uw softwareleverancier ook gecertificeerd gaat worden? Neem contact met het ECH-team op via functioneelbeheer@ECH.nl. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:36:40Z",
  "source": "ech.nl"
}