{
  "id": "c2aca88275015e1c7976930fb0116835c4d0b361",
  "url": "https://www.ech.nl/bestuurswissel-ech/",
  "title": "Bestuurswissel ECH - ECH",
  "text": "Bestuurswissel ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestuurswissel ECH / Nieuws / Door Ruby Stichting ECH verwelkomt Remco van der Kuijp en Bernadette Verberne als nieuwe bestuursleden namens de Koninklijke Notariële Beroepsorganisatie (KNB). Remco en Bernadette zullen de bestuurszetels van Sander Smits en Geert Lekkerkerker overnemen. Bernadette Verberne is sinds 2013 werkzaam bij de KNB als Manager ICT en Procesoptimalisatie. Haar focus ligt op het versterken van de positie van het notariaat in de digitale wereld. Een vitaal onderdeel daarvan zijn de processen in de vastgoedketen. ECH neemt daarin vanzelfsprekend een belangrijke plaats in. Remco van der Kuijp is sinds 2013 bestuurder bij de KNB met aandachtsgebieden digitalisering (Notariaat 2.0) en financiën. Vanuit die rol is hij ook betrokken bij ECH. Voorop staat het verstevigen van de positie van het notariaat in de digitale vastgoedketen. ECH is daarom van belang voor de KNB. Het bestuur van Stichting ECH bestaat naast Bernadette Verberne en Remco van der Kuijp uit Geert Roggen (Rabobank) en John Buhrs (SNS Bank/BLG Wonen/Regiobank). Meer informatie over het bestuur is hier te vinden. Met de bestuurswissel wordt afscheid genomen van Geert Lekkerkerker en Sander Smits. Stichting ECH wil Geert Lekkerkerker en Sander Smits bedanken voor de jaren waarin zij zich hebben ingezet voor ECH. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:20:03Z",
  "source": "ech.nl"
}