{
  "id": "c5f3f108c5074a9487ec6fce0820ef452534c6d9",
  "url": "https://www.ech.nl/directie-stichting-ech-breidt-uit/",
  "title": "Directie Stichting ECH breidt uit - ECH",
  "text": "Directie Stichting ECH breidt uit - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Directie Stichting ECH breidt uit / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris / Door Raymond Bloot “Met veel plezier en trots maak ik bekend dat de directie van ECH per 1 januari jl. is uitgebreid met Floris Beerens (directeur IT & Operations) en Johan Agterberg (directeur Change)”, aan het woord is Lisa Huisman , Algemeen directeur van ECH. Directie ECH, v.l.n.r. Johan Agterberg, Floris Beerens en Lisa Huisman “ECH is de afgelopen jaren enorm gegroeid. Toen ik 7 jaar geleden verantwoordelijk werd, was er circa 6 fte betrokken en hadden we een marktaandeel van zo’n 15% van de nieuwe hypotheken. Inmiddels zijn er in totaal circa 80 personen betrokken bij het reilen en zeilen, lang niet allemaal fulltime overigens, en verwerken we zo’n 50% van de nieuwe hypotheken in de markt.” ECH is een stichting en heeft derhalve geen winstoogmerk. De eerste 12 jaar werd er geen positief financieel resultaat behaald en is er dus ook niet afgelost op de initiële investering. Huisman blikt terug: “Ik maakte het mijn eerste én hoogste prioriteit om meer hypothecair financiers aan te sluiten, zodat de volumes toenamen.” Dit is gelukt. De markt trok aan en de wens en noodzaak om verder te digitaliseren nam toe voor hypothecair financiers. Ook de invoering van de AVG wetgeving heeft een belangrijke rol gespeeld in de groei van ECH. Het bestuur besloot het behaalde nettoresultaat te gebruiken om de openstaande schulden af te lossen. Toen dat na 3 jaar gelukt was, is ECH de benodigde reserves gaan vullen. Nieuwe ontwikkelingen ECH Huisman vertelt verder: “Inmiddels zijn we een financieel gezonde stichting en dat maakte dat het tijd werd voor zelfreflectie. Het bestuur en management kwamen tot de conclusie dat we de afgelopen jaren heel goed zijn geworden in ‘running the business’, en dat op een gecontroleerde en veilige wijze. Dat is cruciaal geweest voor het succes van ECH. Vanuit die positie is het nu tijd om actiever in te zetten op de doorontwikkeling van ECH. Want juist die doorontwikkeling gaat in de toekomst het verschil maken.” Enthousiast gaat ze verder: “Naast de huidige dienstverlening van ECH liggen er kansen om nog meer communicatiestromen tussen hypothecair financiers en het notariaat te standaardiseren en digitaliseren. Denk bijvoorbeeld aan het stellen van een bankgarantie en ontslag hoofdelijke aansprakelijkheid bij echtscheiding. Daarnaast geloof ik in samenwerking binnen de vastgoedketen om de woonreis voor de consument verder te optimaliseren. Het proces rondom de aankoop van een woning kan namelijk efficiënter en goedkoper. Verkenningen hieromtrent met onder andere HDN en Zorgeloos Vastgoed zijn reeds opgestart en veelbelovend”. Dit alles biedt veel potentie, maar vereist uiteraard ook de nodige aandacht. Met behulp van externe partijen heeft ECH de organisatie en governance onder de loep genomen. “We willen ondanks de groei van ons platform immers een snelle en flexibele ‘speedboot’ blijven en geen logge ‘olietanker’ worden. Diverse maatregelen zijn sindsdien genomen, waaronder de uitbreiding van de directie waardoor meer slagkracht én focus gaan ontstaan”, aldus Huisman. “Ik voel me bevoorrecht om samen met Floris en Johan ECH naar het volgende niveau te mogen brengen” , zegt Lisa Huisman, Algemeen directeur Stichting ECH. Uitbreiding directie ECH Floris Beerens is reeds 6 jaar betrokken bij ECH als Manager Operations. Hij heeft net als Huisman notarieel recht gestudeerd, maar daarnaast enorme affiniteit met IT. “Een jurist met IT-ervaring is uniek en voor ECH dan ook erg waardevol. Hij kent het platform en de stakeholders op z’n duim. Hij heeft zijn toegevoegde waarde de afgelopen jaren meermaals bewezen. Zo is hij de drijvende kracht geweest achter de stabiele dienstverlening en het behalen van onze SOC 2 type 2 verklaring. Tevens heeft hij een grote rol gespeeld in de professionalisering van ECH, bijvoorbeeld door de introductie van het eigen ontwikkelteam waarmee we op een Agile-manier werken aan de doorontwikkeling van het platform. Ik ben dan ook verheugd dat hij eindverantwoordelijk is geworden voor IT & Operations”, licht Huisman toe. Directeur IT & Operations, Floris Beerens Johan Agterberg heeft eveneens een notariële achtergrond. Jarenlang werkte hij bij een gerenommeerd notariskantoor als manager van de vastgoed-afdeling. “In tegenstelling tot Floris en mijzelf heeft Johan veel praktijkervaring.” Ook Agterberg is reeds jaren betrokken bij ECH. Niet alleen heeft hij zitting gehad in de Raad van Advies, maar tevens is hij product owner geweest van de major release naar 4.0. Als directeur Change is hij eindverantwoordelijk voor de doorontwikkeling van de dienst ECH. Daartoe werkt hij nauw samen met de betrokken ECH-deelnemers (hypothecair financiers, servicers, notariaat en softwareleveranciers). Er zijn diverse werkgroepen waarin het ‘net’ opgehaald wordt voor wat betreft nieuwe functionaliteiten. Agterberg vult daarmee de backlog. “Precies daarom zijn alle gebruikers van ECH daar van harte welkom en is hun input van groot belang voor de toekomst van ECH”, aldus Huisman. Directeur Change, Johan Agterberg “Ik voel me bevoorrecht om samen met Floris en Johan ECH naar het volgende niveau te mogen brengen. We vullen elkaar goed aan qua competenties en hebben daarnaast ook veel respect voor én lol met elkaar. Als dat geen succes gaat worden?! Maar dit alles kunnen wij natuurlijk niet met z’n drieën. We hebben een geweldig team om ons heen verzameld de afgelopen jaren”, vertelt Huisman met een grote lach op haar gezicht. Strategische partnerships ECH heeft geen eigen loonlijst en betrekt alle capaciteit bij haar partners. Zo levert de KNB de medewerkers op het gebied van financiën, servicedesk, secretariaat en communicatie. Avisi draagt zorg voor de engineers en levert een dedicated DevOps-team. Bij Davinci (a Yellowtail | Conclusion company) komen de beheerders, de testers, de directie en de consultants vandaan die nieuwe partijen helpen de berichtenstandaard te implementeren. “Stuk voor stuk enthousiaste, betrokken en deskundige professionals die ECH hebben gebracht waar we vandaag de dag staan en dat is een compliment waardig! ECH werkt al ruim 19 jaar intensief met deze drie partijen samen, een sec klant-leverancier-relatie doet de samenwerking dan ook te kort, een strategisch partnership voor de woonketen dekt de lading veel beter”, sluit Huisman oprecht trots af. ECH heeft grootse plannen, een enorme drive en verheugt zich op de toekomst. To be continued… Meer informatie Voor vragen of andere informatie aangaande dit artikel kan contact met ECH worden opgenomen met Raymond Bloot via rbloot@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:21:13Z",
  "source": "ech.nl"
}