{
  "id": "c77cb0405a83e5f6621c49c161ba05a9ff0b3556",
  "url": "https://www.ech.nl/ech-groei-verandering-en-een-eigen-ontwikkelteam/",
  "title": "ECH: groei, verandering én een eigen ontwikkelteam - ECH",
  "text": "ECH: groei, verandering én een eigen ontwikkelteam - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH: groei, verandering én een eigen ontwikkelteam / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot Floris Beerens, Johan Agterberg en Hubert Flisijn over ECH: groei, verandering én een eigen ontwikkelteam ‘We zijn als ECH, vanuit onze rol als middle man tussen het notariaat en hypothecair financiers, enorm gegroeid. Enerzijds heeft dat te maken met de grote hoeveelheid partijen die we aangesloten hebben en anderzijds met de volumes die er inmiddels over ons platform gaan.’ Dat zegt Floris Beerens , Directeur IT & Operations bij ECH. ‘We zijn continu met elkaar in gesprek over hoe je dat proces tussen verschillende partijen zo goed mogelijk laat verlopen. Maar dat is slechts één kant van het verhaal.’ ‘Aan de andere kant willen we graag onze dienstenportefeuille verbreden en verdiepen. ECH staat op een keerpunt in haar bestaan. Volgend jaar bestaan we 20 jaar en kijken we met trots naar de bestaande dienstverlening. Er komt nu echt ruimte voor verbetering en verdieping. We zijn volwassen geworden en daar hoort bij dat we een andere invulling gaan geven aan onze rol. Dit maakt dat we ons bewust zijn dat we aan andere behoeften van onze klanten invulling willen geven. Tot voor kort acteerden we vanuit een projectgedachte en al met al nam dat behoorlijk wat doorlooptijd in beslag. Voor softwareontwikkeling werken we nauw samen met de KNB en Avisi. We waren op zoek naar een manier om de samenwerking in deze driehoek in een andere, meer efficiënte werkvorm te gieten. En mede daarom zijn we van start gegaan met een eigen ontwikkelteam dat vanuit Avisi samengesteld is. We zien dit ontwikkelteam niet alleen als een fysieke inrichting van een groep mensen bij elkaar, maar vooral als de aanzet naar een andere gedachtegang. De gedachtegang waarin we van projectgericht denken naar productgericht denken zijn gegaan, met daarin de eindgebruiker continu centraal.’ Hubert Flisijn , Teamlead & Software Developer bij Avisi vult aan: ‘Doordat we nu vanuit een eigen ontwikkelteam binnen ECH opereren, worden we niet meer beperkt door de grenzen van het project. We zijn immers van voor tot achter verantwoordelijk voor het product dat we leveren en dat geeft ons controle over het hele proces. Dat uit zich in een absoluut gevoel van productverantwoordelijkheid die loopt van A tot Z.’ Floris bevestigt dat: ‘Deze manier van productgericht ontwikkelen zorgt er inderdaad voor dat je andere keuzes maakt. De scope op kwaliteit gaat zich anders verhouden en je kijkt op een strategischer niveau naar deadlines. Al met al zorgt de beslissing om dit ontwikkelteam in te zetten ervoor dat we duurzamere keuzes maken en ons nóg meer bewust van kwaliteit zijn.’ Ontwikkelteam spreekt over digitaal vakmanschap Johan Agterberg , Product Owner bij ECH vervolgt: ‘Dat horen we terug van de leden van het ontwikkelteam. Onlangs vertelde onze collega Skip de Groot in een interview nog dat zijn werk, door deze specifieke teaminrichting, nog leuker geworden is en er meer betrokkenheid is ontstaan. En dat is natuurlijk heel belangrijk, dat mensen met plezier werken aan onze diensten. Want daardoor wordt het werk uiteindelijk nog beter gedaan.’ Hubert: ‘Het voelt eigenlijk niet eens echt als werken, je wilt graag resultaten bereiken vanuit een soort intrinsieke motivatie. Binnen onze organisatie hebben we daar een mooie term voor bedacht: digitaal vakmanschap.’ De rol van Floris Beerens, Directeur IT & Operations bij ECH Floris: ‘Van huis uit ben ik jurist en daarnaast IT’er. Ik vind het fantastisch om die twee werelden met elkaar te combineren. Mijn passie op het gebied van IT komt goed tot zijn recht binnen ECH. Al sta ik tegenwoordig iets verder af van de dagdagelijkse ontwikkeling. Ik geef meer sturing aan met welke technieken, met welke vernieuwingen en met welke acceptabele risico’s we aan de slag gaan. Het team zelf komt met alle ideeën, maar dan moet een en ander op het gebied van planning en strategie nog bij elkaar komen. En dat stuk ligt me wel. Ik ben vanuit mijn karakter een enorme problem solver. Die eigenschap past goed bij mijn rol van het technisch up-to-date houden van het platform, zodat we snel kunnen schakelen als er zich kwetsbaarheden voordoen. Want die snelheid in combinatie met stabiliteit is belangrijk om de betrouwbaarheid van ECH te kunnen borgen. Er gaan immers tienduizenden zaken per maand over het platform en dat ervaren we als een hele verantwoordelijkheid.’ ‘Daarnaast komen er dagelijks verzoeken voorbij vanuit diverse maatschappijen, hypothecair financiers en notarissen. Het is juist de afwisseling in mijn rol die ik erg leuk vind. Het werk is immers nooit af. De samenwerking met andere partijen, en dan specifiek met het ontwikkelteam dat aangestuurd wordt door Johan en Hubert, geeft plezier, is informeel en laagdrempelig.’ De rol van Johan Agterberg, Product Owner bij ECH Johan: ‘Mijn rol begint feitelijk bij de eindgebruikers van ons platform. Samen met onze consultants sta ik steeds met hen in contact om te praten over hoe het op dit moment werkt en over hoe het beter kan. Ik pak mijn rol vooral op vanuit mijn eigen praktijkervaring in het notariaat waar ik zelf bijna 20 jaar werkzaam was. Toen al richtte ik me op het verbeteren van zaken. Ik geloof persoonlijk dat hoe goed het ook is, het áltijd nog beter kan. En in de rol die ik nu bekleed kan ik daar echt mijn steentje aan bijdragen. Daar ben ik doorlopend mee bezig: ik vind niets mooier dan een complex probleem oplossen. Het begint vaak bij het ophalen van wensen en behoeften uit de dagelijkse praktijk. Die vertalen we vervolgens samen met de teamleden naar concrete technische toevoegingen en aanpassingen op het platform. Tot slot wordt dit beschikbaar gemaakt voor de eindgebruikers, waarna de cirkel rond is. Ik werk echt in co-creatie met de teamleden, waarbij ik, basaal gezegd, aangeef wat we willen veranderen, de teamleden me tot in detail bevragen over wat ik precies bedoel, en dat onder aansturing van Hubert. Floris denkt vervolgens mee als het gaat over de beste manier waarop dit gerealiseerd kan worden. Change is niet het doel op zich. Het gaat erom wat we willen bereiken en daar is uiteindelijk wel verandering voor nodig.’ De rol van Hubert Flisijn, Teamlead & Software Developer vanuit Avisi Hubert: ‘Ik geef leiding aan het ontwikkelteam dat dedicated voor ECH aan de slag is. Maar ik heb een dubbelrol, want ik ontwikkel zelf ook mee. Van origine ben ik een techneut, ik ben lange tijd in de softwaresector werkzaam geweest en vind het prachtig dat ik zelf mee kan blijven bouwen. Dat zorgt ervoor dat ik de affiniteit met de praktische kant behoud. Bovendien zijn we een relatief klein team, dat bestaat uit vijf mensen. We werken nauw met elkaar samen, en uiteraard ook met Floris en Johan. De lijnen zijn ontzettend kort: ECH en het ontwikkelteam zijn bijna met elkaar versmolten, we doen het écht samen. De relatie is er zeker niet een van opdrachtgever en opdrachtnemer, alles verloopt heel soepel, onder meer omdat we dezelfde waarden nastreven en hetzelfde gedachtegoed hebben.’ De resultaten en ervaringen tot zover Floris: ‘Wanneer ik vanuit mijn perspectief naar de ervaringen en resultaten tot nu toe kijk, dan vind ik dat we flinke stappen hebben gezet op het gebied van technische vernieuwing en onderhoud. Hiermee borgen we de continuïteit van de dienstverlening en zorgen we voor de stabiele basis waarop verdere doorontwikkeling kan plaatsvinden. Zonder continuïteit kom je immers niet aan vernieuwing toe. Momenteel zijn we bezig met het technisch realiseren van bankgaranties, doen we technische updates en verzorgen we vernieuwingen in onze API’s, zodat er gemakkelijker en vaker wijzigingen doorgevoerd kunnen worden. Dit betekent dat als er in de toekomst een verandering nodig is op het platform, de snelheid waarmee we kunnen schakelen is vergroot, waardoor we notariskantoren en financiers beter van dienst kunnen zijn.’ Johan: ‘Dat de buitenwereld daar niets van merkt is natuurlijk goed nieuws, het platform blijft vlekkeloos beschikbaar al kost het op de achtergrond soms veel effort om bepaalde aanpassingen te verwerken. We krijgen als ECH regelmatig complimenten over deze werkwijze. We zijn nu bijna een jaar onderweg met elkaar en merken dat we veel invloed hebben in het aanpakken van zaken die we willen veranderen of toevoegen. Dat is een grote winst, want als we in het verleden iets gingen veranderen dan moesten we eerst een projectteam samenstellen, de leden daarvan moesten ingewerkt worden en dan was het soms nog niet duidelijk wanneer we konden beginnen. En al helemaal niet wanneer we klaar zouden zijn. Nu weten we precies waar we aan toe zijn.’ Hubert: ‘Omdat we nu met een compleet ontwikkelteam volledig voor ECH aan de slag zijn, bouw je heel veel ervaring en kennis op rondom de producten van ECH. En die aspecten kun je doorlopend inzetten, waardoor de doorontwikkeling een stuk sneller gaat dan voorheen.’ Vragen of een bijdrage leveren? Neem contact op ! ‘Wanneer je als lezer een vraag hebt of graag een bijdrage wil leveren, neem dan vooral contact met ons op. We willen dat de drempel om verbinding te zoeken zo laag mogelijk is. Laat dit artikel daarom een uitnodiging zijn’, besluit Floris. Meer informatie Wil je meer weten over Stichting ECH, heb je een vraag, suggestie of wil je een bijdrage leveren? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:07:19Z",
  "source": "ech.nl"
}