{
  "id": "c841d489f3f232da13f3540f3b9d2e8ce0a8a642",
  "url": "https://www.ech.nl/nieuwe-samenstelling-directie/",
  "title": "Nieuwe samenstelling directie - ECH",
  "text": "Nieuwe samenstelling directie - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Nieuwe samenstelling directie / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris / Door Raymond Bloot Sinds begin 2022 is de directie van Stichting ECH onder andere uitgebreid met een directeur Change om haar ambities ten aanzien van de groei en uitbreiding van het platform kracht bij te zetten. Johan Agterberg heeft in aanvang deze rol vervuld naast zijn werk als Product Owner. Gezien de groei die ECH doormaakt, is het belangrijk om meer focus te creëren op beide rollen. Daarom gaat Stichting ECH deze rollen nadrukkelijk naast elkaar neerzetten met een losse rol van directeur Change en een losse rol Product Owner. v .l.n.r. Johan Agterberg – Product Owner, Floris Beerens – Directeur IT & Operations en Lisa Huisman – Algemeen directeur Johan Agterberg blijft met zijn expertise in het notariële domein de rol van Product Owner invullen. Daarbij gaat Stichting ECH de komende periode op zoek naar een dedicated directeur Change. Tot die tijd blijft Johan de functie als waarnemer vervullen binnen het directieteam van ECH.’Vanuit zakelijk oogpunt een logische ontwikkeling die ongetwijfeld bij gaat dragen aan de next step voor ECH. Op persoonlijke titel vinden Floris en ik het uiteraard jammer dat Johan het directeur-stokje gaat overdragen en daarmee buiten het directieteam komt te staan. We hebben de samenwerking immers als zeer prettig ervaren. Tegelijkertijd zijn we blij dat Johan in de rol van Product Owner nauw betrokken blijft. Met zijn kennis en kunde draagt hij dagelijks bij aan de verdere ontwikkelingen van ons platform.’, aldus Lisa Huisman, Algemeen directeur ECH. Meer informatie Voor vragen of andere informatie aangaande dit artikel kan contact met ECH worden opgenomen met ons via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:07:09Z",
  "source": "ech.nl"
}