{
  "id": "c8bfca226188d3704788c0ef685dccb59ff8ed55",
  "url": "https://www.ech.nl/ervaringen-rabobank-met-afschriften-via-ech/",
  "title": "Ervaringen Rabobank met afschriften via ECH - ECH",
  "text": "Ervaringen Rabobank met afschriften via ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Ervaringen Rabobank met afschriften via ECH / Nieuws / Door Ruby Rabobank is sinds 13 december 2018 aangesloten op ECH4.0. Sindsdien is er een nieuwe werkwijze voor het versturen en ontvangen van de hypotheekakte (inclusief notarisverklaring). Met dit bericht wil de Rabobank de nieuwe werkwijze opnieuw onder de aandacht brengen bij notariskantoren. Elektronisch aanleveren via ECH komt in plaats van papieren aanlevering In de nieuwe werkwijze wordt de hypotheekakte niet meer per post of e-mail aangeleverd bij de Rabobank, maar uitsluitend als elektronisch ondertekend afschrift via het ECH-bericht ‘passeerbevestiging’. Elektronische aanlevering werkt sneller en efficiënter en heeft als voordeel een besparing op de portokosten. Bovendien beschikt het notariaat automatisch over een bevestiging dat het afschrift is verstuurd. De elektronische aanlevering via ECH is in de plaats gekomen van de (inefficiënte) papieren aanlevering. Waar een elektronische aanlevering op notariskantoren al voor een verbetering kan zorgen, helpt het de Rabobank bij het aanzienlijk verminderen van de verwerkingstijd van dossiers op grote schaal. Rabobank beoordeelt namelijk alle stukken die via post of email zijn binnengekomen. Naast de reeds via ECH binnengekomen hypotheekakten zitten hier ook zekerheidsstukken tussen die nog behandeld dienen te worden, denk bijvoorbeeld aan rectificaties. Belangrijkste gedeelte aanlevering gaat inmiddels elektronisch Verreweg het grootste gedeelte van de notariskantoren is inmiddels overgestapt naar de elektronische aanlevering via ECH. Rabobank ervaart dit als positief. Het verlaagt de interne poststroom enorm, waardoor de Rabobank de stukken efficiënter kan verwerken. Er zijn ECHter nog steeds notariskantoren die de hypotheekakten alleen per post/email aanleveren of zowel elektronisch via ECH als per post/email aanbieden. Net als de papieren aanlevering levert ook een dubbele aanlevering extra werk op, zowel voor het notariaat als de Rabobank. In het eerste kwartaal is door de Rabobank actief terugkoppeling verleend aan deze notariskantoren met als doel de elektronische aanlevering via ECH en het achterwege laten van de papieren/email aanlevering. Rabobank heeft inmiddels besloten om voor de notariskantoren die nog problemen ervaren met het elektronisch aanleveren via ECH een uitzondering te maken en tijdelijk nog de papieren/email aanlevering te accepteren. We hopen ECHter dat u begrijpt dat de elektronische aanlevering via ECH voor zowel uw kantoor als ook voor de Rabobank minder handelingen oplevert. We willen u daarom vragen om te controleren of u al elektronisch aanlevert via ECH en het versturen van het afschrift per post/email inmiddels achterwege laat. Op weg naar volledige elektronische aanlevering via ECH Rabobank en stichting ECH vinden het belangrijk om te achterhalen waarom nog niet alle notariskantoren zich (kunnen) conformeren aan de nieuwe werkwijze van ECH. Met input van deze notariskantoren zal onderzocht worden wat er nodig is om tot de gewenste wijze van aanleveren te komen. Als daar aanleiding toe is, wordt contact opgenomen met notariskantoren die nog niet uitsluitend via ECH (kunnen) aanleveren. Ook kan het zijn dat ECH contact opneemt met notarieel softwareleveranciers.Mocht u problemen ervaren met het elektronisch via ECH aanleveren van afschriften vanuit uw eigen software, neem dan contact op met de helpdesk van uw eigen softwareleverancier. Voor vragen over het gebruik van de ECH webapplicatie op notarisnet kunt u contact opnemen met de servicedesk van ECH via het telefoonnummer (070) 330 71 35 of via servicedesk@KNB.nl. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:08:07Z",
  "source": "ech.nl"
}