{
  "id": "ca52356ac6045e6fc2699aba1ae5d231be35da0e",
  "url": "https://www.ech.nl/omarm-innovatie-maar-blijf-uiterst-zorgvuldig-bernadette-verberne-manager-ict-en-innovatie-bij-de-knb-en-bestuurslid-bij-ech/",
  "title": "‘Omarm innovatie, maar blijf uiterst zorgvuldig’, Bernadette Verberne, manager ICT en innovatie bij de KNB en bestuurslid bij ECH - ECH",
  "text": "‘Omarm innovatie, maar blijf uiterst zorgvuldig’, Bernadette Verberne, manager ICT en innovatie bij de KNB en bestuurslid bij ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Omarm innovatie, maar blijf uiterst zorgvuldig’, Bernadette Verberne, manager ICT en innovatie bij de KNB en bestuurslid bij ECH / Bestuur , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door Raymond Bloot ‘Ik heb al eerder aangestipt dat allerlei organisaties uit de vastgoedmarkt actief bezig zijn met de toekomst. Doel is om te transformeren naar wat zij denken dat deze (digitale) toekomst dan gaat zijn.’ Aan het woord is Bernadette Verberne , manager ICT en innovatie bij de KNB en bestuurslid bij ECH. ‘Het gaat dan om het verbreden van dienstverlening en het vormen van een goed koppelvlak tussen consument, makelaar en notaris. Uiteindelijk moet het voor die eindgebruiker beter worden, bijvoorbeeld omdat deze te allen tijde gemakkelijk bij zijn akten kan. Ook ondernemers denken overigens volop na over hoe ze de processen in de vastgoedsector beter kunnen ondersteunen. Zo zijn er geluiden om een generiek afsprakenstelsel neer te zetten waar iedereen kan aanhaken: het notariaat, de makelaars, de geldverstrekkers en andere relevante partijen. Kortom, er is veel in beweging en eigenlijk gaat het erover hoe dat we vanuit slimme oplossingen de dienstverlening tussen de partners, waartoe ook de consument behoort, kunnen optimaliseren.’ ‘Nu zijn er in de markt nogal veel verschillende koppelvlakken en dat is niet efficiënt en bovendien moeilijk te onderhouden. Het kost enorm veel tijd. Afsprakenstelsel Zorgeloos Vastgoed, waar ik al eerder aan refereerde, speelt daar ook een rol in. Dit stelsel zorgt er onder meer voor dat we dezelfde taal met elkaar spreken. Voor de betrokken partijen gaat het daarnaast ook om positionering: dus hoe zorgen we er nu voor dat we ook in de toekomst een voldoende grote footprint blijven hebben en voldoende transacties naar ons toe trekken? Dat kan bijvoorbeeld door uit te breiden met wat je nu doet. Maar ook door te specialiseren’, aldus Bernadette. Bernadette Verberne, manager ICT en innovatie bij de KNB en bestuurslid bij ECH Snelheid kans en uitdaging Wat ik ook zie in de markt is een nadruk op versnelling van het hele proces (straight-through processing) om tot financiering te komen. Dat is in basis natuurlijk een goede ontwikkeling, maar minstens zo belangrijk is ervoor zorgen dat de klant tijdens elke fase inzicht heeft in wat de status is van zijn transactie. En persoonlijk vind ik dat onderdeel nog steeds onvoldoende op de kaart staan. De positie van de consument moet écht meer aandacht krijgen, misschien wel door juist die eindklant al aan de spreekwoordelijke tekentafel te betrekken bij het proces.’ Overheid legt nadruk op burger ‘Bovenstaand past ook in de ontwikkeling waarbij de overheid steeds meer nadruk legt op het centraal stellen van de burger. Je bent baas van je eigen identiteit en je mag als consument steeds meer zelf bepalen wie welke informatie van je krijgt. Dat betekent dus niet alleen dat je als consument veel meer inzicht moet krijgen in het proces zelf, maar ook in welke stappen daar dan in zitten. Ik vind het enorm belangrijk dat we dat met elkaar nastreven. Zo kan ik me voorstellen dat er op een gegeven moment een soort van dashboard is waarin burgers alle data rondom hun persoon kunnen zien.’ ‘Digitalisering moet dus niet alleen maar gaan over efficiëntie, maar zeker ook over oog hebben voor de kwetsbaren’, Bernadette Verberne, manager  ICT en innovatie bij KNB. Omarm innovatie, maar blijf zorgvuldig ‘ Als mens ben ik enthousiast over alles wat vernieuwend is. Dat omarm ik bij wijze van spreken bij voorbaat al. Wel denk ik dat we voorzichtig omgaan met de bereikte zekerheden en andere verworvenheden. Het gevaar bestaat dat we dit onderwaarderen omdat we de illusie hebben dat het allemaal beter wordt. Zo hebben we op dit moment bijvoorbeeld binnen de stichting ECH, maar ook binnen het notariaat, een bepaald niveau bereikt rondom de betrouwbaarheid van onze digitale dienstverlening. Dus er moet volop aandacht zijn om dat vertrouwen ook vast te houden. Zoiets als koesteren wat er te koesteren valt.’ ‘Te veel focus op versnelling is daarom ook niet zaligmakend wat mij betreft. Ik hecht ook aan zorgvuldigheid, dus de weg naar meer digitalisering moet niet alléén maar gaan over snelheid en efficiëntie. Er moet ook aandacht zijn voor thema’s als: hoe blijven we het wenselijke niveau van vertrouwen handhaven? En hoe zorgen we ervoor dat de consument meer een plek krijgt in het geheel? Ik vind op dit moment dat de klant nog vooral wordt uitgeleverd aan een proces. En dat is niet meer van deze tijd.’ ‘Kortom, we worden als dienstverleners meer en meer uitgedaagd om na te denken over de manier waarop onze diensten uitpakken voor cliënten. Veiligheid is daarbij key. Dit betekent ook zoiets eenvoudigs als niet om méér gegevens vragen dan nodig, ook bekend als need to know . Kijkend naar de rol van de notaris denk ik daarbij dat het onmisbaar blijft om heel goed uit te leggen wat consequenties zijn van een bepaalde beslissing die iemand neemt. Mensen weten immers niet wat ze niet weten’, vertelt Bernadette. Aandacht voor integriteit ‘Verder geloof ik dat er meer aandacht moet komen voor ethiek in relatie tot digitale dienstverlening. Zo vind ik het belangrijk dat bij automatische processen, waarin je met een druk op de knop iets kunt regelen, een extra stap wordt ingebouwd. Een stap waarin je met iemand kunt overleggen om te onderzoeken of iemand echt wel dát wil wat er op het punt staat geregeld te worden. Ik denk bijvoorbeeld aan de nieuwe Europese regelgeving die faciliteert dat je online een onderneming kunt oprichten. Dat betekent dat we met elkaar goed moeten nadenken over hoe we iemand identificeren en hoe we ervoor zorgen dat het passeren van een akte juist en zorgvuldig gebeurt. Dit gaat verder dan een kleine invuloefening online waarbij iemand via e-signing akkoord geeft. Zo komt er bijvoorbeeld al verplicht een digitaal passeerproces met video conferencing, maar misschien dat we iets extra’s moeten doen zoals bijvoorbeeld emotion recognition. Dat gaat dan meer over het non-verbale aspect. Hoe kijkt iemand uit zijn ogen? Verstrakken zijn spieren? Lijkt een persoon misschien onder druk gezet te worden? Digitalisering moet dus niet alleen maar gaan over efficiëntie, maar zeker ook over oog hebben voor de kwetsbaren.’ Positie in de toekomst ‘Waar ik hoop dat we over vijf jaar staan in de keten? Ik hoop dat de beleving en de positie van de cliënt serieus aan kracht hebben gewonnen. En daar maak ik me sámen met de professionals van ECH, KNB en andere ketenpartners heel graag sterk voor.’ Meer informatie Wil je meer weten over de visie van Bernadette Verberne of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:09:50Z",
  "source": "ech.nl"
}