{
  "id": "ca5a9f8be7bf79bd3be528131e5794e3abc3c787",
  "url": "https://www.ech.nl/de-notaris-als-digitale-proces-operator/",
  "title": "De notaris als digitale proces operator - ECH",
  "text": "De notaris als digitale proces operator - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X De notaris als digitale proces operator / Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door Raymond Bloot ‘De digitalisering binnen de notariële beroepsgroep gaat steeds verder en steeds dieper. De komende jaren zal het beroep van notaris ingrijpend veranderen. Deels gedreven door coronamaatregelen en de gevolgen daarvan, deels door een Europese wetgever die steeds meer digitaal wil.’ Aan het woord is Remco van der Kuijp, notaris bij Van der Kuijp Notariaat Strijen. Remco van der Kuijp, notaris Digitalisering in het notariaat ‘Ik noem zomaar wat voorbeelden: in de loop van dit jaar moet het, op verzoek van de EU, in Nederland mogelijk zijn om een bv digitaal op te richten bij de notaris. Als dit voor de bv kan, dan zal de rest (zoals aandelenoverdrachten, transporten, hypotheken en zelfs testamenten) niet lang op zich laten wachten. Andere landen gingen ons daarin al voor. Als de coronaperiode iets heeft laten zien, is het dat niets meer heilig is.’ ‘Waar het tot voor kort in Nederland niet mogelijk was om een testament digitaal te ondertekenen, maakt de speciale coronawetgeving het ineens wél mogelijk. En waarom zou dit geen blijvertje kunnen zijn? Ook diverse landen in Europa maken digitale slagen. Zo verloren Portugese notarissen bijvoorbeeld ruim 70% aan omzet omdat kantoorbezoek niet meer mogelijk was. De oplossing kwam al snel in de vorm van een digitaal platform. De diverse digitale oplossingen waren voor de Europese notarissen reden om te kijken naar een berichtenplatform voor probleemloze en grensoverschrijdende communicatie tussen notarissen in diverse landen’, aldus Remco. ‘De notaris als digitale proces operator? Het is nog even wennen, maar ik heb er alle vertrouwen in dat dit goed komt’, Remco van der Kuijp. Probleemloze communicatie ‘Bij deze laatste ontwikkeling moest ik meteen denken aan ECH. Daar werken ze immers al jaren met een probleemloze communicatie tussen hypothecair financiers en notarissen. Ze zijn klein begonnen met enkele aangesloten partijen en inmiddels bestrijken ze, na zoveel jaren, een groot gedeelte van de markt. De veranderende technieken en de wensen van zowel de hypothecair financiers als de notarissen vereisen een stabiel en veilig berichtenverkeer. De aanbieders willen daarbij STP kunnen werken, de notarissen beginnen daar pas net aan. Maar bij iedereen bestaat de wens om uiteindelijk volautomatisch de diverse processtappen te kunnen afwerken. En daar wordt stap voor stap naartoe gewerkt. De notaris is dan niet helemaal de digitale vis in het water, maar dat begint hij wel langzaam te worden. De processen die leiden tot de akte, lijken uiteindelijk belangrijker te worden dan de akte zelf. De notaris als digitale proces operator? Het is nog even wennen, maar ik heb er alle vertrouwen in dat dit goed komt’, besluit Remco. ‘ Uiteraard sta ik open voor vragen of opmerkingen na het lezen van dit blog.’ Meer informatie Wil je meer weten over de de visie van Remco van der Kuijp of Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:20:45Z",
  "source": "ech.nl"
}