{
  "id": "cd769f137fa1a7a7c46c1452b8a04e54687c8ea8",
  "url": "https://www.ech.nl/notarissen/ing/",
  "title": "ING - ECH",
  "text": "ING - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: ING Bank N.V. Proces: Royeren E-mail: – Telefoon: 020-5847710 01 Nieuwsberichten 02 Royeren 03 Bankgaranties Deelnemersinfo ING Bank Algemene informatie/nieuwsberichten (kort) Maatschappij specifieke informatie Statutaire naam: ING Bank N.V. Vestigingsplaats: Amsterdam Kantooradres: Bijlmerdreef 106 Postcode en plaats: 1102 CT Amsterdam Telefoon: 020-5847710 Welke bestandtypes worden geaccepteerd? Onbeveiligde PDF’s van maximaal 25 MB per bijlage. Per e-mail kunt u maximaal één bijlage toevoegen. Algemene informatie/nieuwsberichten Op www.ing.nl/notaris vindt u veel informatie over zowel het opvragen van een aflosnota via ECH als over een aanvraag buiten ECH om. Wel via ECH: Geheel royement van particuliere hypotheken op een regulier onderpand. Gedeeltelijk royement van particuliere hypotheken. Gedeeltelijk royement van overbruggingshypotheken (toevoegen aan bestaande ECH-zaak s.v.p.). Watervillahypotheek (woonark e.d.): u kunt uw aanvraag via ECH doen. Vermeld naam schip en brandmerk alstublieft in het ‘Opmerkingenveld’, indien beschikbaar. U krijgt onze reactie buiten ECH om, per e-mail. U kunt er ook voor kiezen om uw aanvraag buiten ECH om te doen via aflossen.hypotheken@ing.nl . Niet via ECH: Royement van hypotheekhouder ING Bank NV (WUB): verzoeken voor Westland Utrecht Bank graag via Stater aanvragen met de portal E-Notaris. Royement van een financiering bij ING Real Estate Finance (REF): graag aanvragen via ref.accounting.cancellations@ing.com inclusief royementsvolmacht en hypotheekakte. Bij vragen kunt u ons bellen op werkdagen tussen 9.00 en 17.00 via 020 5647377. Buitenlandhypotheek (onderpand in het buitenland) en Jachthypotheek (pleziervaartuig e.d.): graag met het formulier ‘Aflosnota Hypotheek opvragen’ ( www.ing.nl/notaris ) aanvragen via aflossen.hypotheken@ing.nl . Het belast inbrengen van een pand bij een juridische omzetting: Graag aanvragen via juridischeomzetting@ing.nl . Als doorlooptijd voor de beoordeling hanteren wij 10 werkdagen voor de passeerdatum (voor oprichting nieuwe vennootschappen of belast inbrengen). Bij vragen kunt u ons bellen op werkdagen tussen 8.30 en 17.00 via 020-5847706. Royement van een zakelijke financiering: Sinds 1 maart 2025 is het mailadres voor de zakelijke verzoeken gewijzigd naar Royement.Zakelijk@ing.nl . De zakelijke inschrijvingen herkent u in veel gevallen doordat er in de hypotheekakte wordt gesproken over een kredietnemer in plaats van een schuldenaar. Via Royement.Zakelijk@ing.nl kunt u verzoeken indienen voor zakelijke klanten die betrekking hebben op: Geheel royement voor zakelijke hypotheken Gedeeltelijk royement voor zakelijke hypotheken Toestemming vestigen hypotheek achter ING voor zakelijke klanten Toestemming vestigen van het recht van opstal t.b.v. o.a. zonnepanelen, netwerkbeheerders voor zakelijke klanten Toestemming vestigen van het recht van erfdienstbaarheid voor zakelijke klanten Toestemming vestiging akte van wijziging splitsing in appartementsrechten voor zakelijke klanten Toestemming vestiging kwalitatieve verplichtingen voor zakelijke klanten Verzoek ontslag hoofdelijke aansprakelijkheid voor zakelijke klanten ( bij scheiding ) Royement voor Lubbers akten Dien de verzoeken s.v.p. inclusief hypotheekakte en royementsvolmacht in. Voor verzoeken voor algehele aflossing en royement hanteren wij 10 werkdagen. Voor alle andere verzoeken hanteren wij 15 werkdagen. (dag van aanlevering telt niet mee). Notarisinstructie royementenproces Royementenproces Verzoek aflosnota Tijdstip opvragen U vraagt de aflosnota’s uiterlijk 15 dagen voor de aflosdatum op. Verzoeken die u meer dan twee maanden voor de aflosdatum indient neemt ING niet in behandeling en zullen direct worden afgewezen. Geen aflosnota’s eind van de maand Tegen het einde van iedere maand kunnen wij gedurende een korte periode geen aflosnota’s opmaken. Kijkt u voor de exacte datums op www.ing.nl/notaris . Vraagt u tijdens één van deze periodes een (gewijzigde) aflosnota op, omdat de hypotheek in deze periode passeert? Dan maken wij de aflosnota op via een spoedprocedure. Hiervoor kunt u contact met ons opnemen via onderstaand telefoonnummer. Getekende volmacht – Aflosnota Opzegtermijn Sommige klanten hebben een hypotheek bij de ING met een opzegtermijn van 1 maand. In dat geval brengen wij standaard één maand rente in rekening vanaf aanvraagdatum; ook als de aflosdatum binnen die maand ligt. U kunt klanten doorverwijzen naar de hypotheekadviseur voor vragen. Situaties waarin u een gewijzigde aflosnota krijgt van ING: De klant is door een rentedaling meer kosten voor vervroegde aflossing verschuldigd De klant wil zijn gekoppelde kapitaalverzekering, Spaarpolis, Bankspaarrekening of Beleggingsrekening verrekenen Wijziging aflosdatum (eerder of later passeren) Wijzigt de datum waarop u met de klant de royementsafspraak hebt? Dan vragen wij u om altijd de aflosdatum via de ECH-zaak te wijzigen; ook als u reeds een aflosnota van ING hebt ontvangen. Dit is belangrijk omdat het werkelijke moment van aflossen bepalend is in de wettelijke eisen over de berekening van kosten vervroegde aflossing. De geldigheidsduur van de aflosnota kan worden gebruikt voor het feit dat u enkele dagen moet wachten op een terugkoppeling van het Kadaster. Géén dagrente in mindering brengen Wij vragen u om zelf geen dagrente in mindering te brengen. U vindt deze instructie ook in de Aflosnota. Als u toch dagrente in mindering brengt, dan kunnen wij de verwerking van de aflossing niet garanderen (het akkoord royement kan dan tot maanden op zich laten wachten, omdat wij de resterende rente via een eigen procedure bij de klant zullen vorderen). Akkoord royement Uiterlijk 12 werkdagen nadat u aan de opschortende voorwaarden cq. betalingsverplichting hebt voldaan ontvangt u van ons het bericht ‘Akkoord Royement’. Om technische reden kan het voorkomen dat u dit bericht pas later van ons krijgt. De combinatie van de getekende royementsvolmacht, de aflosnota en de betaling van het verschuldigde aflossingsbedrag aan ING is voldoende om de doorhaling van de hypothecaire inschrijving te verzorgen. U kunt door middel van een wijzigingsverzoek of per telefoon eventueel om een bevestiging vragen dat uw betaling is ontvangen. Omdat wij weten dat u belang hecht aan het ‘Akkoord Royement’, werken wij eraan om dit bericht in alle situaties binnen de gestelde termijn te versturen. Gedeeltelijk royement In veel situaties vragen wij om een gevalideerd taxatierapport (niet ouder dan 6 maanden), opgesteld door een erkende taxateur, waarin de waarde van het na gedeeltelijke doorhaling resterende gedeelte wordt gespecificeerd. U kunt het rapport meesturen als bijlage met het verzoek. Wanneer een klein perceeldeel wordt afgestaan dan is een taxatierapport soms niet nodig. Voor vragen kunt u ons bellen via het nummer 020 584 77 10. Aandachtspunten maatschappij Verrekenen van gekoppelde producten Vaak is het mogelijk om de afkoopwaarde van de gekoppelde kapitaalverzekering, Spaarpolis, Bankspaarrekening of Beleggingsrekening te verrekenen op de aflosnota. Vraag de aflosnota daarom ruim op tijd op, zodat ING tijd heeft om de gelden op te vragen. Hieronder ziet u wat de mogelijkheden zijn. De benodigdheden kunt u uploaden in de case via ECH. Aflosreden en situatie Verrekening mogelijk Benodigdheden Opmerking Verkoop woning (geen tekort): verzoek tenminste 3 weken voor aflosdatum ingediend Ja bij: – Spaarpolis intern bij ING, ING Bankspaarrekening of ING Beleggingsrekening- Nationale Nederlanden Maatwerkverzekering – Getekend verzoek van alle schuldenaren om gekoppeld product te beëindigen en te verrekenen Verkoop woning (geen tekort): verzoek korter dan 3 weken voor aflosdatum ingediend Ja bij: – Spaarpolis intern bij ING, ING Bankspaarrekening – Getekend verzoek van alle schuldenaren om gekoppeld product te beëindigen en te verrekenen Verkoop woning met tekort: Ja – Getekend verzoek van alle schuldenaren om gekoppeld product te beëindigen en te verrekenen Indien kapitaalverzekering buiten ING: – Uw voorlopige eindafrekening waaruit het tekort blijkt – Kopie afkoopwaarde van de polis (max. 6 maanden oud) Indien aanvraag korter dan 3 weken voor aflosdatum: mogelijk wordt 92% van de afkoopwaarde als fictieve waarde verrekend Oversluiten Ja bij: – Spaarpolis intern bij ING, ING Bankspaarrekening of ING Beleggingsrekening – Nationale Nederlanden Maatwerkverzekering – Spaarverzekering buiten ING En mits:- de gelden uit het gekoppeld product door ING zijn ontvangen vóór de aflosdatum. – Getekend verzoek van alle schuldenaren om gekoppeld product te beëindigen en te verrekenen. Als de gelden nog niet zijn ontvangen dan moet de aflosdatum / passeerdatum worden verzet. Beleggings- en Levensverzekeringen buiten ING kunnen nooit worden verrekend bij Oversluiten. Na ontvangst van de beno digdheden beëindigen wij de Spaarpolis, Bankspaarrekening of Beleggingsrekening en/of claimen wij de kapitaalverzekering bij de verzekeraar. In het laatste geval zijn wij afhankelijk van de doorlooptijden van verzekeraars. Er is een tekort ontstaan Is de opbrengst van de verkoop ( inclusief opbrengst van gekoppelde producten) alsnog onvoldoende? Of is er een tekort bij Oversluiten? Neemt u dan op werkdagen van 8.30 tot 17.00 uur via 020 363 36 92 contact op met onze afdeling Collections . U kunt ook mailen naar IBREC.OHV@ing.nl . Vermeld u alstublieft het hypotheeknummer en stuur een nota van afrekening mee, plus het getekend verzoek van klant met een akkoord om gekoppelde producten te verrekenen . Overlijden De klant mag de hypotheek aflossen zonder kosten voor vervroegde aflossing als de aflossing plaatsvindt binnen 12 maanden na het overlijden van de ( mede ) schuldenaar of van de persoon met wie hij/zij een duurzame huishouding voerde. Voor deze situatie kiest u in ECH de aflosreden ’99 overig’ en vermeldt u hierbij ‘overlijden’. Contact Heeft u na het lezen van deze pagina nog vragen? Bel dan 020 584 77 10. Wij helpen u graag op werkdagen van 8.30 tot 17.00 uur. Aandachtspunten maatschappij – Bankgaranties ING verzendt sinds 17 februari 2025 de bankgaranties via ECH. De bankgarantie is te raadplegen via de ECH-webapplicatie. Voor meer informatie omtrent het bankgarantieproces kunt u deze FAQ raadplegen. Heeft u vragen of opmerkingen over de gestelde bankgarantie? Bel ons op werkdagen tussen 8.30 uur en 17.00 uur op 020-5847710. Houd het hypotheeknummer bij de hand. We helpen u graag. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:06:03Z",
  "source": "ech.nl"
}