{
  "id": "cd794aa3d861272c431a783366161a26ee3a7fc5",
  "url": "https://www.ech.nl/meet-the-team-casper-van-ginneken/",
  "title": "Meet the team - Casper van Ginneken - ECH",
  "text": "Meet the team - Casper van Ginneken - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Casper van Ginneken / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Ik vind het belangrijk om werk te doen dat impact maakt,’ Casper van Ginneken, Compliance Officer & Consultant bij ECH ‘Binnen ECH werken we in een hecht team waarin je snel de verantwoordelijkheid kunt pakken en die vervolgens daadwerkelijk krijgt. Dat past goed bij me, ik houd van de vrijheid om zelf zaken uit te zoeken.’ Dat zegt Casper van Ginneken, sinds drie jaar als Compliance Officer & Consultant aan de slag voor ECH. ‘En hoewel we een klein team zijn, maken we in de markt best een behoorlijke voetafdruk, want op jaarbasis komen honderdduizenden mensen onbewust in aanraking met ECH. Vaak is dat tijdens een relatief stressvolle periode, namelijk bij het passeren van een aangekochte woning.’ ‘Ik vind het belangrijk om werk te doen dat impact maakt en iets bijdraagt omdat mensen er voordeel van hebben. Dat hoef ik niet van de daken te schreeuwen, want zo zit ik niet echt in elkaar. Ik ben niet per se iemand die vooraan loopt, dat vind ik niet zo interessant. Meestal kijk ik eerst de kat rustig uit de boom. Verder geeft het team me veel energie, juist omdat het zo hecht is. We ondernemen niet alleen allerlei activiteiten samen, zoals een gezellige lunch of een barbecue, maar ook onder werktijd is er genoeg tijd om grapjes onderling te maken. Daarnaast, en dat is best bijzonder denk ik, komen we zelfs regelmatig bij elkaar thuis over de vloer. Kortom, de sfeer is heel open en informeel. En dat laatste vind ik heel fijn, dat het niet uitmaakt welke functie je hebt, maar allemaal op dezelfde manier met elkaar omgaat.’ Casper van Ginneken, Compliance Officer & Consultant ECH De werkweek van Casper ‘Ik ben niet iemand die erg houdt van een vast ritme; afwisseling vind ik belangrijk. Dit betekent dat ik geen vaste dagen voor bepaalde activiteiten heb. Eigenlijk loopt alles zo’n beetje door elkaar heen, afhankelijk van prioritering en persoonlijke voorkeur. Dit betekent dat ik de ene dag of week erg gefocust ben op de voorbereiding op SOC 2-audits en de dag of week daarna bijvoorbeeld weer onderweg ben naar klanten, leveranciers of andere partners’, aldus Casper. ‘Verder probeer ik er elke dag voor te zorgen dat ik een mooie balans heb tussen een aantal meetings aan de ene kant en inhoudelijke uitwerking aan de andere kant. Je zult in mijn agenda niet snel een hele dag vol overleggen zien en de dag daarna alleen maar uitwerktaken vanuit huis. Dat trekt me niet. Verder vind ik het leuk om met anderen op pad te zijn en nauw samen te werken.’ Combinatie kwantitatief, techniek en business past als een jas ‘Ik ben afgestudeerd als technisch bedrijfskundige, met een master in financial engineering. Dat gaat vooral over risicomanagement en de wiskundige kant van financiële markten, maar is minder kwantitatief dan bijvoorbeeld econometrie. Juist dat snijvlak tussen de techniek, cijfermatige onderbouwing en de business die aangeeft wat de behoeften uit de praktijk zijn, vind ik heel interessant. Dit betekent dat ik binnen ECH, samen met mijn collega Floris, vaak degene ben die zaken uitrekent als het nodig is. In deze functie kan ik mijn analytisch vermogen kwijt, uitzoekwerk verrichten, processen verbeteren en vervolgens implementeren voor het team en onze klanten. Onder andere het ontwikkelen van financiële rapportages, opstellen van businesscases, Business Intelligence en Risk Management horen in mijn takenpakket thuis. Die veelheid van taken past goed bij mijn generalistische inslag. Al focus ik me ook graag tot in detail op een onderwerp, om vervolgens weer naar een ander onderwerp te gaan dat ik dan opnieuw tot in detail ontleed.’ Trots op SOC 2 assurance rapportage ‘Waar ik trots op ben? Dat vind ik best lastig, maar als ik dan iets zou moeten noemen dan denk ik al snel aan het thema security en compliance en dan specifiek aan de uiteenlopende vragenlijsten die hypothecair financiers jarenlang hanteerden. We hebben er destijds voor gekozen om een SOC 2 assurance rapportage te behalen. Dat was echt een enorme klus, mede omdat we zo’n kleine organisatie zijn’, aldus Casper. ‘Toen ik begon bij ECH was dat traject net gestart en ik trek inmiddels, na een inwerkperiode, de kar voor het behalen van de jaarlijkse type 2 rapportage. Het is fijn om te merken dat dit project goed geslaagd is. Zo gaf de auditor recentelijk aan dat ze niet vaak zo’n goede voorbereiding zien en dat is terug te zien in de resultaten . We merken verder dat er meer rust is ontstaan in de organisatie en er een verdieping van de professionalisering heeft plaatsgevonden. En voor mijzelf vind ik het mooi dat ik hier een bijdrage aan heb kunnen leveren.’ De komende periode op de agenda ‘We richten ons, binnen de stichting, op verschillende nieuwe ontwikkelingen en daar krijg ik veel energie van. Zo zijn we bezig met het ontwikkelen van BI-dashboards. Wat mij betreft een logische stap, want we beschikken over veel metadata die we kunnen gebruiken om processen nog inzichtelijker te maken en te verbeteren. Verder gaan we het security en compliance team uitbreiden. Voor mij persoonlijk betekent dit dat ik wat meer een aansturende rol kan gaan bekleden. Daar heb ik veel zin in.’ Casper in privé ‘Ik sport graag, zo loop ik regelmatig hard, speel ik wekelijks squash en ben ik vorig jaar begonnen met golfen. Verder krijg ik veel energie van het afspreken met vrienden. Ook ga ik graag op wintersport, ik ben een fervent snowboarder. En in de zomer zoek ik bij voorkeur het avontuur op, dan ga ik bijvoorbeeld wandelen in de bergen of een lange reis maken. Overigens komt mijn analytische inslag bij al mijn sporten terug. Want ik vind het hartstikke leuk om bezig te zijn met de cijfertjes rondom mijn hardlopen of de snelheid waarmee ik de berg af raas. Als je het zo bekijkt past mijn werkend leven perfect bij de zaken waar ik in privé energie van krijg.’ Meer informatie Heb je vragen voor Casper, heb je ideeën of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor ieder klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:24:17Z",
  "source": "ech.nl"
}