{
  "id": "cda94d7c4cfe0397ddf8493d0e91c0a217155829",
  "url": "https://www.ech.nl/ech-zet-privacy-centraal/",
  "title": "ECH zet privacy centraal - ECH",
  "text": "ECH zet privacy centraal - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH zet privacy centraal / Nieuws / Door Ruby Per vandaag is de algemene verordening gegevensbescherming (AVG) van kracht. Deze verordening ziet toe op de privacy van persoonsgegevens voor alle bedrijven die zaken doen in de europese unie. Op de ECH gebruikersdag is hier al kort bij stilgestaan. De afgelopen maanden heeft ECH niet stil gezeten. Alles is in werking gesteld om haar processen volledig ‘AVG-proof’ te maken. Consument centraal Hoewel ECH geen rechtstreeks contact heeft met de consument, voorziet ECH in de noodzakelijke communicatie over de consument tussen hypothecair financier en notaris. De consument weet vaak niet hoe deze communicatie verloopt. Het is daarom uiterst belangrijk dat ECH volledig kan meewerken aan verzoeken voor inzage, wissing, rectificatie en bezwaren die de consument bij zijn financier, notaris of ECH indient. ECH heeft haar processen zo aangepast dat het indienen en behandelen van een dergelijk verzoek op een snelle en transparante wijze wordt uitgevoerd. Hierbij houden wij rekening met de geheimhoudingsplicht en het verschoningsrECHt van de notaris en de wettelijke termijnen die gelden voor verwerkingsverantwoordelijken. Om dit richting de deelnemers van ECH te borgen zijn alle bepalingen die de wet stelt aan de verwerking  van persoonsgegevens vastgelegd in verwerkingsovereenkomsten. Alle hypothecair financiers hebben in 2017 een aangepaste overeenkomst met ECH getekend. Voor de notarissen committeert ECH zich te voldoen aan de rECHten en plichten die zijn vastgelegd in de “voorwaarden verwerking persoonsgegevens” welke onderdeel uitmaken van de overeenkomst KNB online services betreffende o.a. Het pec platform waarop de applicaties van ECH draaien. Informatiebeveiliging Om de informatie zo goed mogelijk te beveiligen handelt  ECH in overeenstemming met de security agreement die eveneens is afgesloten tussen hypothecair financiers en ECH. Tevens is samen met de hypothecair financiers een  werkgroep security opgezet, waarin professionals van verschillende betrokken partijen periodiek overleggen en ervaringen uitwisselen. Mocht er onverhoopt toch iets misgaan, dan heeft ECH een protocol klaarliggen om zo snel mogelijk al het noodzakelijke te doen om risico’s te beperken. Vervolgstappen De komende tijd blijft ECH zich ontwikkelen. ECH 4.0 zal de komende maanden worden geïmplementeerd. Daarnaast worden processen doorlopend aangescherpt en verbeterd. Hierbij zal ECH continu de beveiliging toetsen en binnen haar ontwikkelproces rekening houden met het minimaliseren van de data die wij opslaan. Meer weten? Wilt u meer weten over privacy, de werkgroep security of de acties die wij ondernemen om onze dienstverlening continu te laten voldoen aan de hoogst mogelijke standaarden, neem dan contact op met leon roseleur, privacy officer via privacy@ECH.nl Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:06:13Z",
  "source": "ech.nl"
}