{
  "id": "ce935ca442ae9e5628390cac52e26177c00b0c35",
  "url": "https://www.ech.nl/bestuur-aan-het-woord-gerben-jonkman/",
  "title": "Een goede teamdynamiek bevorderen, werken aan vooruitgang en samen resultaten boeken. Dáár krijg ik energie van’, Gerben Jonkman, nieuw bestuurslid van Stichting ECH - ECH",
  "text": "Een goede teamdynamiek bevorderen, werken aan vooruitgang en samen resultaten boeken. Dáár krijg ik energie van’, Gerben Jonkman, nieuw bestuurslid van Stichting ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Een goede teamdynamiek bevorderen, werken aan vooruitgang en samen resultaten boeken. Dáár krijg ik energie van’, Gerben Jonkman, nieuw bestuurslid van Stichting ECH / Bestuur , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris / Door Raymond Bloot ‘ECH neemt een heel belangrijke plek in de hypotheekketen in. De stichting draagt bij aan het gebruiksgemak van alle betrokken partijen en aan het efficiënter maken van belangrijke processen. Precies zoals in mijn dagelijks werk, waarbij we ons eveneens ten doel stellen om het proces zo klantvriendelijk, voorspelbaar en degelijk mogelijk te maken. Zo doen we dat met het hele ECH-team ook. En met véél energie kan ik wel zeggen.’ Aan het woord is Gerben Jonkman , Managing Director bij BCMGlobal , een toonaangevende Europese onafhankelijke dienstverlener op het gebied van krediet- en vermogensbeheer. Sinds 1 februari is Gerben overgestapt van de Raad van Advies naar het bestuur van ECH.  ‘Bovenstaande factoren zijn belangrijk. Want juist bij de aankoop van een huis, één van de grootste evenementen in iemands leven, is het van belang om het proces zo soepel mogelijk te laten verlopen. Een dergelijke situatie is immers vaak al spannend genoeg. Dat een proces dan op een efficiënte en veilige manier wordt ingeregeld geeft rust aan de consument.’ Gerben Jonkman , Managing Director BCMGlobal (Netherlands) Veel ruimte om te ontwikkelen ‘Het spreekt dus ook voor zich dat wij als BCMGlobal zijn aangesloten bij ECH. En daarnaast nodigde de aanpak van ECH me uit om een actieve bijdrage te leveren aan de stichting. Niet voor niets ben ik sinds april 2019 al lid van de Raad van Advies. In deze rol werd ik uitgedaagd om op verschillende vlakken mee te denken en advies aan het bestuur te geven. Toen men vroeg of ik de overstap naar het bestuur wilde maken hoefde ik niet lang na te denken. Al heb ik al die jaren met veel plezier zitting genomen in de Raad van Advies. Het lijkt me mooi om op strategisch niveau mee te denken over de toekomst van ECH, zeker nu de marktomstandigheden uitdagender zijn. Denk bijvoorbeeld aan de teruggelopen volumes van de hypothekenmarkt ten opzichte van de vorige jaren, maar ook aan thema’s als oversluiten en verduurzamen. Dat soort omstandigheden spoort van nature aan om weer eens op een andere manier tegen de zaken aan te kijken’, aldus Gerben. Het doel? Een waardevolle bijdrage leveren ‘Als ik vanuit een wat breder perspectief naar mijn rol binnen het bestuur van ECH kijk, dan hoop ik een bijdrage te kunnen leveren aan een nog bredere adaptatie en toepasbaarheid van het ECH-platform in de markt. Een voorbeeld daarvan is de uniformering van de hypotheekaktes: als we dat voor elkaar hebben dan zetten we met elkaar een aanzienlijke stap voorwaarts in efficiëntie. Die efficiëntie sluit dan weer naadloos aan op de veilige ECH-omgeving waarin privacy gewaarborgd is en het gebruiksgemak nog steeds toeneemt. Dat gemak zal bijvoorbeeld gaan blijken uit de sterk verminderde noodzaak om aktes te controleren na passeren, juist vanwege die uniformiteit. Ook denk ik aan het aansluiten van ECH op verschillende bronnen waardoor het nog gemakkelijker wordt om een passering of een aflossing te faciliteren.’ Samen resultaat behalen ‘Deze rol geeft me de juiste energie: in het verleden heb ik veelal leidinggevende functies gehad die altijd raakvlak met het hypothekendomein hadden. Ik houd erg van het brengen van verandering en maak graag, samen met teams dingen beter, of zet nieuwe zaken op. Bij alles wat ik doe spelen mensen en processen een belangrijke rol. Een goede teamdynamiek bevorderen, werken aan vooruitgang en samen resultaten boeken, dáár krijg ik energie van. En dat gaat bij ECH zeker weten goed komen’, besluit Gerben. Meer informatie Wil je meer weten over de visie van Gerben Jonkman of over ECH in het algemeen neem dan gerust contact met ECH via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T03:56:41Z",
  "source": "ech.nl"
}