{
  "id": "d09bec8702e70d21a91f7c9868c76d6c7a9774ad",
  "url": "https://www.ech.nl/succesvolle-samenwerking-tussen-quion-en-ech/",
  "title": "‘Coronavirus geeft boost aan hypotheken- en woningmarkt’, John Smulders, COO bij third party servicer Quion - ECH",
  "text": "‘Coronavirus geeft boost aan hypotheken- en woningmarkt’, John Smulders, COO bij third party servicer Quion - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Coronavirus geeft boost aan hypotheken- en woningmarkt’, John Smulders, COO bij third party servicer Quion / Nieuws , Referenties banken , Referenties notariaat / Door echadmin ‘Wat je in de hypotheken- en woningmarkt zag gebeuren bij het ontstaan van de coronacrisis? Er ontstond een enorme run op woningen. Mensen wilden hun woonwensen verzilveren.’ Dat zegt John Smulders, COO bij Quion, één van de grootste onafhankelijke third party servicers van Nederland voor hypotheken en consumptief krediet. ‘Dat verzilveren kon gaan om het kopen van dat ene droomhuis of over het aanpassen van het bestaande huis. Zo zagen we daarmee samenhangend een verdubbeling van het aantal bouwdepots in onze portefeuille. De run op nieuwe woningen en aanpassing van bestaande, had uiteraard ook te maken met het feit dat we met zijn allen structureel meer zijn gaan thuiswerken en meer woongenot zoeken. Dat alles heeft een enorme boost aan het aantal aanvragen en de onderliggende volumes gegeven. Zaken die dit versterkten zijn de lage rente maar ook extra vraag van mensen werkzaam in voor corona kwetsbare sectoren als de horeca, luchtvaartmaatschappijen en bijvoorbeeld zzp’ers die een mogelijke aanscherping van regelgeving c.q. acceptatievoorwaarden voorzagen en snel wilden handelen. Tenslotte zagen we ook een patroon dat vanwege het thuiswerken mensen graag een huis met meer kamers wilden, en dat dit niet per definitie meer in de grote steden hoefde te zijn met sterke prijsstijgingen van woningen buiten de Randstad’. John Smulders, COO bij third party servicer Quion Grote impuls voor de markt ‘Kortweg kun je stellen dat de markt in zijn totaliteit een enorme boost heeft gekregen’, aldus John. ‘De rente is als gevolg van corona, nog verder naar beneden gegaan. Ook de oversluitmarkt heeft een gigantische impuls gekregen van mensen die vanwege financieel voordeel overstapten naar nieuwe geldverstrekkers. Uiteraard zijn wij content met de groei, maar aan de andere kant heeft onze organisatie met weken van meer dan 3 maal het reguliere aanvraagvolume ook echt wel gepiept en gekraakt om het allemaal binnen bepaalde afgesproken tijdlijnen in orde te krijgen. Naar de toekomst toe denk ik dat het belang van een eigen huis, het extra investeren daarin en het toevoegen van waarde, bijvoorbeeld door zonnepanelen of een extra aanbouw, zeker zal blijven bestaan.’ De uitdaging voor de jonge generatie ‘Voor de jongeren op de woningmarkt gaat het vooralsnog helaas lastig blijven om een huis te kopen, zeker als je kijkt naar de gemiddelde huizenprijs die op dit moment zo rond de € 360.000 ligt. Gelukkig ontstaan er wel creatieve mogelijkheden in de markt, zoals een financieringsmogelijkheid die de overgang van huur naar koop faciliteert. Ik zie daar wel mogelijkheden in, ook voor woningcorporaties en projectontwikkelaars. Ook generatiehypotheken waar ouders of familie bijspringen kunnen een bijdrage leveren, maar de betaalbaarheid blijft zeker voor starters een forse uitdaging. Kortom, er zijn zeker mogelijkheden, maar we gaan er niet aan ontkomen dat onze generatie kinderen een rol gaat spelen om die overgang naar nieuwe financieringsmogelijkheden mee vorm te geven.’ Gezamenlijk belang in de keten noodzakelijk ‘Wat ik verder een hele belangrijke en bovendien gewenste ontwikkeling vind, is dat we de individuele belangen in de keten nog meer gaan overstijgen. In de ideale situatie gaan we vanuit een gezamenlijk belang acteren. Het is tijd dat we als partijen geen concurrerend onderscheid meer proberen te maken op het proces, maar dat we inzetten op een gezamenlijke digitale standaard waarmee we de klant ontzorgen en gemak leveren. ECH is daar een mooi voorbeeld van. Uiteindelijk is het de klant die erbij wint als de partijen in de keten het eigenbelang overschrijden, zodat ieder vanuit zijn eigen specialisme, samenwerkt. En daar dragen wij graag ons steentje aan bij’, besluit John. Meer informatie Wil je meer weten over de samenwerking tussen ECH en Quion? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:11:17Z",
  "source": "ech.nl"
}