{
  "id": "d10b84146688f206612f015f57979886ca925a44",
  "url": "https://www.ech.nl/steven-bartels-en-jean-paul-bolhaar/",
  "title": "Hoogleraar Steven Bartels en notaris Jean-Paul Bolhaar aan het woord over de voordelen van de uniforme hypotheekakte - ECH",
  "text": "Hoogleraar Steven Bartels en notaris Jean-Paul Bolhaar aan het woord over de voordelen van de uniforme hypotheekakte - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Hoogleraar Steven Bartels en notaris Jean-Paul Bolhaar aan het woord over de voordelen van de uniforme hypotheekakte / Bestuur , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Je ziet op meerdere vlakken dat wet- en regelgeving niet gemaakt is met digitalisering op het netvlies. Terwijl we inmiddels wél in een wereld leven waarin digitalisering een almaar grotere rol inneemt.’ Dat zegt Steven Bartels , hoogleraar burgerlijk recht aan de Radboud Universiteit én betrokken bij stichting ECH om vanuit de wetenschappelijke kant een bijdrage te leveren aan het proces van digitalisering en uniformering van de hypotheekakte. ‘Je ziet inderdaad dat de digitale snelweg op de innovatieve toer is’, vult Jean-Paul Bolhaar , notaris bij Hermans & Schuttevaer Notarissen aan. Hij is bovendien lid van de Raad van Advies van Stichting ECH en vervult vanuit die rol een stuk praktijkvertaling vanuit het notariaat naar de stichting. ‘ECH probeert uiteraard een belangrijke rol te spelen in de genoemde digitalisering, zodat het passeren van hypotheekaktes, zowel voor de consument als voor de betrokken notaris, zo snel, eenvoudig en foutloos mogelijk verloopt. Een van de focuspunten ligt op het zoveel mogelijk op elkaar aan laten sluiten van systemen. Zo is bijna 100% van de notariskantoren in Nederland aangesloten op het ECH-platform. Ook hypothecair financiers weten de weg steeds meer te vinden. Sowieso is er veel aandacht voor een meer uniforme manier van samenwerken, want uiteindelijk is de consument, waar we het toch allemaal voor doen, daar het beste mee geholpen tijdens zijn klantreis. Er zijn op dit moment nog veel verschillende werkwijzen. En dat betekent dat er relatief gemakkelijk efficiëntieslagen gemaakt kunnen worden en dat brengt weer voordelen met zich mee, zoals het verminderen van faalkosten.’ Steven Bartels, hoogleraar burgerlijk recht aan de Radboud Universiteit Van uitgebreid naar uniform Jean-Paul vervolgt: ‘Zoals het nu loopt kun je, kort samengevat, zeggen dat ECH een platform is waarop alle informatie voor het opstellen van een hypotheekakte tussen notaris en hypothecair financier wordt uitgewisseld. Denk aan reeds bestaande inschrijvingen, het onderpand, betrokken partijen et cetera. Wanneer deze informatie binnenkomt via ECH dan gaat de desbetreffende notarieel medewerker concreet met de informatie aan de slag. We nemen het juiste model erbij en toetsen of de opgegeven informatie correct is. Hierbij valt te denken aan het checken of het onderpand daadwerkelijk dat specifieke onderpand is, of er inderdaad een eerste hypotheekrecht wordt afgegeven, er wellicht wisselingen plaats moeten vinden in de rangorde en of er andere overige beperkingen zijn. En dat is een behoorlijke klus, want elke hypothecair financier heeft een eigen manier van gegevens aanleveren. Waar de één heel summier is, levert de andere ellenlange stukken tekst. Dat is niet alleen knap ingewikkeld, maar ook tijdrovend omdat je als notarieel medewerker geen grip op en geen routine in het verwerken van de inhoud krijgt. Deze is immers elke keer anders, zowel qua lengte als qua inhoud.’ Van tekst naar beeld ‘In de nieuwe situatie gaat er een duidelijke, uniforme tekstuele verwoording van de hypotheekakte ontstaan’, aldus Jean-Paul. ‘Dat is de eerste winst. En het proces? Dat wordt een stuk efficiënter, kijkend naar controlewerkzaamheden voor zowel hypothecair financiers als het notariaat. Door deze nieuwe werkwijze nemen de faalkosten bovendien af, omdat er meer uniformiteit is en dus minder kans op fouten. Het behalen van efficiëntie en het verlagen van faalkosten zijn winst twee en drie zou je kunnen zeggen. Of de consument daadwerkelijk veel van de tekstuele verandering gaat merken is overigens maar zeer de vraag. Zo worden een leveringsakte en een hypotheekakte al lang niet meer gedetailleerd voorgelezen. Sterker nog, het gros van de mensen denkt in beelden, dus ik teken de situatie vaak even uit of ik laat de kadastrale kaart met daarop hun aangekochte vastgoed zien. Dat spreekt voor veel mensen veel meer tot de verbeelding dan de tekstuele uitwerking van de akte die ze ondertekenen.’ Jean-Paul Bolhaar, notaris bij Hermans & Schuttevaer Notarissen Uiteindelijk gaat het over mensen Steven vult aan: ‘En uiteindelijk? Uiteindelijk gaat het vooral over mensen. Ik sta zelf buiten de directe keten en mijn onafhankelijke rol binnen ECH is scherp zijn op het voorkomen van al te veel efficiëntie binnen diezelfde keten. Want wanneer je spreekt over efficiëntie, dan gaat het inderdaad al gauw over het verminderen van fte’s en het verlagen van faalkosten. Daar is niets mis mee, maar het is wel prettig dat er iemand bij het proces betrokken is die specifiek kijkt of de rechten en de belangen van de consument voldoende beschermd blijven. Eigenlijk vraagt men mij om als een soort outsider, een kritische medestander feitelijk, mee te kijken naar de ontwikkelingen. Ik zit niet in het proces, maar aan het eind van het verhaal moet het wel zo zijn dat er een helder lees- en verwerkbaar product komt dat voldoet aan de eisen die we nodig hebben. Een document dat zowel formeel als inhoudelijk de bescherming biedt die we willen bieden. Zo zie je nu in de praktijk nog regelmatig gebeuren dat een document zoals een hypotheekakte pas tot in detail wordt nagelezen op het moment dat het fout gaat. En niet zelden staan er dan afspraken in waar de consument zich niet direct bewust van was. Denk aan afspraken met de hypothecair financier of met de huidige partner die grote gevolgen kunnen hebben. Er wordt dan al snel met een beschuldigende vinger gewezen, omdat de uitkomst anders is dan verwacht. Overigens is het mijn inziens zo dat de aanpassing die we binnen deze uniforme, digitale hypotheekakte door gaan voeren niet zo concreet is dat we kunnen beloven dat dit voor elke akte en voor elke partij verbetering biedt. Maar ik ben er zeker van overtuigd dat het een hele stap in de goede richting is voor alle betrokken partijen.’ Meer informatie Wil je meer weten over de de visie van Steven Bartels, Jean-Paul Bolhaar of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:12:44Z",
  "source": "ech.nl"
}