{
  "id": "d154f9245eb2ad0bf631adbfb90de31586766d12",
  "url": "https://www.ech.nl/nieuwe-website-en-huisstijl-voor-ech/",
  "title": "Nieuwe website en huisstijl voor ECH - ECH",
  "text": "Nieuwe website en huisstijl voor ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Nieuwe website en huisstijl voor ECH / Nieuws / Door echadmin Met trots presenteren Casper van Ginneken en Annemarie Verver vandaag de nieuwe look & feel van Stichting ECH! De afgelopen maanden is er hard gewerkt aan de ontwikkeling van een nieuw logo, een nieuwe huisstijl en nieuwe website van ECH. Steeds meer maatschappijen en hypothecaire serviceorganisaties sluiten aan op ECH. 99% van het notariaat in Nederland is reeds aangesloten. Mede door de professionalisering en modernisering van de stichting is er de afgelopen jaren veel veranderd. Echter de huisstijl van ECH is al 17 jaar ongewijzigd. Het moment leek dan ook daar om een en ander te updaten en met elkaar in sync te brengen. ‘Het uiterlijk waarmee Stichting ECH naar buiten treedt, wilden we beter laten aansluiten bij alle ontwikkelingen die ECH de afgelopen periode heeft doorgemaakt. Met de nieuwe huisstijl en website markeert ECH een nieuw tijdperk waarmee wij de markt op een professionele en moderne, maar toch authentieke manier willen blijven bedienen. Met het nieuwe imago en in samenwerking met en voor alle op ECH aangesloten partijen, zijn wij klaar voor de toekomst!’ aldus Casper en Annemarie, consultants bij ECH. Kleurgebruik en beeldmerk De nieuwe kleuren van ECH zijn rustige blauwgrijzen, met geel als ondersteunende tint. Professioneel en authentiek in een modern jasje. Met de introductie van de nieuwe huisstijl en website presenteren wij eveneens het nieuwe beeldmerk van ECH, namelijk de asterisk. Het beeldmerk is een combinatie van twee pijlen met de punt naar elkaar gekeerd. De asterisk vormt de link met berichtgeving waarbij data uitgewisseld wordt en zorgvuldigheid en oog voor detail centraal staan. Op de nieuwe website is informatie te vinden voor de deelnemers van ECH (geldverstrekkers en notariskantoren), daarnaast is terug te vinden hoe ECH is georganiseerd en hoe er het beste contact kan worden opgenomen ingeval van vragen en of opmerkingen. Ook de veelgestelde vragen zijn er terug te vinden. Het team van ECH is benieuwd naar uw reactie en staat uiteraard open voor suggesties. Wij danken GoldfiZh en Moonen Media voor hen  deskundige advies en de plezierige samenwerking! Wil je meer weten over de professionalisering en modernisering van Stichting ECH of heb je feedback op de website en of huisstijl? Neem dan contact met ons op via info@ech.nl Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T04:01:37Z",
  "source": "ech.nl"
}