{
  "id": "d2cd21fda01e4ec7f4076331f48e7caed577a3d7",
  "url": "https://www.ech.nl/vanbrug-ech-het-nieuwe-goud/",
  "title": "Aandacht is het nieuwe goud - ECH",
  "text": "Aandacht is het nieuwe goud - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Aandacht is het nieuwe goud / Nieuws , notarieel software leverancier , Referenties notariaat / Door echadmin ‘Je ziet op dit moment nogal wat gebeuren in de markt rondom zakelijke dienstverlening. Ik denk dat aandacht het nieuwe goud is en dat geldt zowel voor ons, kijkend richting de notariskantoren, als voor de notaris, kijkend naar zijn cliënten.’ Dat zegt Dorien Bartels, Manager Customer Care bij Van Brug Software. ‘Het gaat wat mij betreft anno nu vooral om het luisteren en om het verhaal van de klant. Dus om écht het gesprek aangaan. Wij zijn daar vanuit Van Brug Software ruim twee jaar geleden mee gestart door inzet van een 100-dagen challenge. Hierbij zijn we actief onze notariskantoren gaan bezoeken om te luisteren naar de wensen uit deze hoek. En nu ik dit zo zeg denk ik aan auteur en spreker Simon Sinek die het prachtig verwoordt door te zeggen: ‘ Hearing is listening to what is said. Listening is hearing what isn’t said. ’ En dat is wat mij betreft precies waar het om gaat. Want waarom wil iemand wat? En wat is het doel achter een bepaalde vraag? Vaak horen we een vraag en gaan we als vanzelf invullen wat er bedoeld wordt zonder écht te luisteren. Beter is natuurlijk om dóór te vragen en dan in te spelen op het antwoord dat gegeven wordt. Of op de stiltes tussen de antwoorden in, die vaak ook zo veelzeggend zijn.’ Dorien Bartels, Manager Customer Care bij van Brug Software. Verandering binnen het notariaat ‘Ook voor de notariskantoren zelf is er veel veranderd. Wat ik onder andere merk is dat ze echt betrokken willen worden bij de ontwikkeling van onder meer de software die ze gebruiken. Vandaar dat wij co-creaties gestart zijn met onze kantoren. En ik denk persoonlijk ook dat dat dit de enige manier is om te komen tot dat wat het beste werkt. Daarom vind ik het bijvoorbeeld ook sterk dat stichting ECH gebruikersdagen organiseert. Ook ben ik met Lisa (directeur van de stichting) een keer bij een gezamenlijk notariskantoor geweest. En dat werd als heel positief ervaren. Persoonlijke aandacht werkt in deze setting gewoon goed voor alle partijen. Onlangs nog zei een klant tegen één van onze supportmedewerkers dat ze het gevoel hebben de enige klant te zijn, omdat we écht de tijd voor ze nemen. Dat is natuurlijk een prachtig compliment. Daarnaast blijkt ook dat notariskantoren niet het idee te hebben contact op te nemen met support, maar met collega Tim of met Manon. En dat is wat mij betreft een van de belangrijkste dingen rondom customer care: kén je klant en weet wat hij/zij belangrijk vindt.’ Klanttevredenheid: meten is weten ‘Maar hoe zorg je er nu voor dat die klant met zo min mogelijk tijd, geld en energie contact met ons heeft en de aandacht krijgt die hij verdient? Ik geloof erg in het meten van resultaten, bijvoorbeeld door te vragen hoe gemakkelijk iemand uiteindelijk met ons in gesprek kwam. Of door te informeren naar hoe vaak iemand zijn vraag moest herhalen voor het juiste antwoord er was. Daarnaast is het, als leverancier, ook van belang om steeds bewust na te denken over wat je vervolgvraag kan zijn, waardoor je in zo min mogelijk tijd alle informatie boven tafel krijgt’, zegt Dorien. ‘Kijkend naar de notarissen zie ik daar overigens ook wel verschillen. Zo heb je de groep die vooroploopt, kijkend naar digitalisering. Zij willen bijvoorbeeld al volledig papierloos werken. Dan heb je de grote middenpartij die misschien wat afwachtend is maar wel degelijk anticipeert in de transitie naar digitaal. En tot slot heb je de groep traditionele notarissen die denkt dat digitalisering juist de charme uit het vak weggehaald. Het is onze uitdaging als softwareleverancier, om alle drie deze groepen mee te krijgen. Zo hebben we ons team nu bijvoorbeeld ook uitgebreid met een Customer Succes manager die zich vooral richt op het in gesprek zijn met de notariskantoren: wat kunnen we verbeteren om hun werkprocessen nóg beter te ondersteunen? Al moet ik tegelijkertijd zeggen dat binnen ons bedrijf iederéén bezig is met customer care. Elke schakel is daarbij even belangrijk. Of je nu op de financiële administratie werkt, op de supportafdeling of als developer actief bent, maakt daarbij niet uit. Je hebt in het hele ketenproces de verantwoordelijkheid om het zo gemakkelijk, gebruiksvriendelijk en tegelijkertijd efficiënt te maken voor de eindgebruiker. Customer care zou wat mij betreft bij élk bedrijf het hart van de organisatie moeten zijn.’ Data-driven werken op kop ‘Tegelijkertijd zie je dus ook dat we steeds meer data-driven gaan werken. En ik denk dat juist het slim analyseren van deze data actief bijdraagt aan het verhogen van klanttevredenheid. Meten is weten zeggen ze wel eens, en dat is natuurlijk waar. Waar we over drie jaar staan met ons softwarebedrijf? Ik hoop dat we dan zo ver zijn dat wij proactief richting het notariskantoor kunnen communiceren over een bepaald issue dat we voorbij zien komen, nog vóórdat de notaris het in zelf in de gaten heeft.  Uiteraard leveren we dan meteen de oplossing erbij. Kortom, we constateren het mogelijke probleem nog voor het zich voordoet en lossen het direct op. Daarnaast gaan we ook steeds meer in gesprek met de kandidaat-notarissen, omdat zij de notaris van morgen zijn. Samenwerken en elkaar versterken: dát is wat we willen met deze groep.’ Moraal van het verhaal ‘Dus samenvattend, wat ik zie veranderen in de markt, is dat deze manier van werken ook voor de notariskantoren steeds belangrijker wordt. Het gesprek aan tafel, het adviseren, en eigenlijk er vooral voor zorgen dat mensen een goede nachtrust hebben. Het vak van notaris is geen copy/paste-verhaal uit de printer, maar gaat om diepgaand advies. Het is een ambacht. Je kunt immers veel automatiseren, maar het menselijke aspect blijft. En dat moet je ook niet willen automatiseren. Dat is juist het mooie van het vak, want je bent bij het belangrijkste moment uit een mensenleven aanwezig. Zoals bij het kopen van een huis, het oprichten van een bedrijf, rondom de geboorte van kinderen of bij het opmaken van een testament. Dus voor de cliënten van de notaris is het ook heel belangrijk om gehoord te worden, zodat ze de rust hebben dat het goed geregeld is. Tot slot zie ik dat steeds meer specialistische professionals, en daarmee ook de notarissen meer in gewone-mensen-taal met hun klanten communiceren. En ook dat vind ik een bijzonder goede ontwikkeling’, besluit Dorien. Meer informatie Wil je meer weten over de samenwerking tussen Stichting ECH en van Brug Software? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:30:24Z",
  "source": "ech.nl"
}