{
  "id": "d31d089a8e66eb14d17fd7bdecc5cc0bcff5f22b",
  "url": "https://www.ech.nl/meet-the-team-jacqueline-burger-bruin/",
  "title": "Meet the team - Jacqueline Burger - Bruin - ECH",
  "text": "Meet the team - Jacqueline Burger - Bruin - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Jacqueline Burger – Bruin / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Hard werken combineren met hard genieten, zorgt voor een mooie balans’ ‘Het is alweer even geleden dat ik mijn loopbaan startte, in 1979 om precies te zijn’, lacht Jacqueline Burger – Bruin , 61 jaar en sinds een klein jaar als Acceptant & Functioneel tester bij stichting ECH aan de slag. ‘En al die tijd ben ik bezig geweest met vernieuwing en proberen mee te gaan in wat er veranderde binnen de organisatie waar ik voor werkte.’ ‘En veranderingen? Die heb ik in mijn werkzame jaren al heel wat voorbij zien komen’, vervolgt ze. ‘Ik startte in het bankwezen op de afdeling sparen, waar ik uiteindelijk in aanraking kwam met het functioneel testen van software. Ik heb onder andere meegeholpen bij het opzetten van een nieuw aanvraagsysteem voor hypotheken en het uitvoeren van een datamigratie.’ Jacqueline Burger – Bruin, Acceptant & Tester ECH Onbezorgde kindertijd zonder mobiele telefoons Ik werk graag met jonge mensen samen, zij hebben vaak een aanstekelijke energie. Een energie die ik zelf ook nog altijd ervaar. Als kind speelde ik veel buiten in Diemen, waar ik opgroeide. Wanneer het mooi weer was gingen we met de rubberboot in de sloot varen en als er in de winter ijs lag, dan bonden we schaatsen onder. Het was zo’n onbezorgde kindertijd waarin we hinkelden, met een bal speelden en nog geen mobiele telefoons hadden.’ Continu leren en ontwikkelen ‘Door het volgen van cursussen en vooral te doen wat ik leuk vond zette ik steeds nieuwe stappen in mijn loopbaan. Destijds was ik, bij de Postbank, volop bezig met het premiesparen en het spaarloon dat toen nog bestond. Alles was uitgedacht, behalve de manier waarop de uitbetaling moest verlopen. Toen men iemand zocht om dat nieuwe systeem functioneel te testen meldde ik me meteen. Uiteindelijk maakte ik de overstap van sparen naar hypotheken en mocht ik een nieuw aanvraagsysteem functioneel testen en accepteren. Bij de integratie van Postbank in de ING leerde ik weer veel, want ál die hypotheken moesten samengevoegd worden. Het was wederom continu ontdekken, ontwikkelen, cursussen volgen en áán staan. Erg leuk allemaal’, aldus Jacqueline. Geen dág zonder werk ‘Toen, vanwege allerlei reorganisaties en samenvoegingen, mijn baan eindigde na ruim bijna 35 jaar, heb ik me eens goed georiënteerd. Ik was per slot van rekening pas 53 jaar. Ik heb werkelijk geen dág zonder werk gezeten en ben uiteindelijk bij ECH terechtgekomen. En dat is, zonder overdrijven, een waar feestje.’ Binnen het ECH-team heb ik de rol van acceptant en functioneel tester. Ik toets dat functionele en technische wijzigingen geen impact hebben op de eindgebruikers en dat gedane wijzigingen gecommuniceerd worden naar de eindgebruikers. ‘Het is erg fijn om hier te werken. Enerzijds omdat elke dag een uitdaging is en anderzijds omdat ik met veel plezier naar mijn werk ga. Dat heeft onder meer te maken met de vrijheid die ik ervaar. Ik kan mijn werk precies zo indelen als qua vorm bij me past en ik houd van organiseren dus dat is een goede match’, lacht Jacqueline. ‘Ontwikkelingen zijn er bovendien weer volop. Zo hadden we tot nu toe elke twee weken een productiemoment. Nu zijn we bezig dit proces te versnellen zodat we op ieder gewenst moment een productiemoment kunnen uitvoeren. We hebben recentelijk ‘Royeren 5.0’ afgerond. Daar ben ik, vanuit het team, best trots op, want bijna alle notarissen en maatschappijen zijn nu aangesloten en tot nu toe zijn er geen bevindingen. Dat betekent dat we ons werk goed gedaan hebben als team.’ ‘Nu gaan we, wederom onder de spreekwoordelijke motorkap, beginnen met het vernieuwen van de software rondom vestigen. Wat helpt bij dit soort projecten is dat we een goed team met fijne mensen hebben, we maken duidelijke afspraken, er is ruimte voor discussie en we leveren een goed eindproduct. Zoals gezegd: ik ben nogal van het plannen en het organiseren en ik weet precies wat ik moet doen op een dag. Het zit nu eenmaal in mijn aard dat ik het heel fijn vind als mijn lijstjes met taken zijn afgevinkt, omdat ik alles heb gedaan wat ik wilde. Dan klap ik aan het einde van de werkdag met een heel lekker gevoel mijn laptop dicht.’ Over honden, trialroutes en wijnboerderijen ‘In het weekend ben ik veel buiten, bijvoorbeeld om te wandelen met de hond. Ook reizen mijn man en ik graag. Dat gaat van Spanje tot Peru, van Italië tot Thailand en alles daartussen in. Hotelletjes, wijnboerderijen, borrelen, eten: het kan mij niet gezellig genoeg zijn. Maar we zijn ook sportief bezig. We maken lange wandelingen, soms over meerdaagse trail routes en gaan graag de bergen in. Door hard werken bewust te combineren met hard genieten, blijft het allemaal mooi in balans. En daar word ik heel gelukkig van’, besluit Jacqueline met een lach. Meer informatie Heb je vragen voor Jacqueline of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor iedereen klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:26:33Z",
  "source": "ech.nl"
}