{
  "id": "d3fc14f4b9832ed5994fc5c3f4b12c210c4e5395",
  "url": "https://www.ech.nl/kick-off-project-automatische-verificatie-hypotheekakten/",
  "title": "Kick-off project Automatische verificatie Hypotheekakten - ECH",
  "text": "Kick-off project Automatische verificatie Hypotheekakten - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Kick-off project Automatische verificatie Hypotheekakten / Hypotheekmarkt , KNB , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Op 11 januari jl. hebben Stichting ECH en de KNB samen het project ‘Automatische verificatie Hypotheekakten’ gelanceerd. Dit project is onderdeel van het ECH Change programma. Beide partijen werken samen aan de automatische verificatie van hypotheekakten. Dankzij innovatieve technologie worden gegevens van financiers van hypotheken, zoals banken en andere kredietverstrekkers, vergeleken met die in de opgestelde (concept) hypotheekakte. Zo kunnen fouten sneller worden ontdekt en gaan de kosten omlaag. Momenteel werken beide partijen aan de realisatie van een zogenoemd Proof of Concept (POC). De eerste resultaten hiervan worden dit voorjaar verwacht. Gedurende deze POC wordt met betrokken financiële instellingen en notarissen de resultaten afgestemd. Mocht de POC succesvol blijken, dan kan de KNB deze techniek beschikbaar stellen in het kader van de digitale notariële dienstverlening. Voordelen Dit project belooft grote voordelen voor de notariële sector en financiële instellingen. Door het automatiseren van de verificatieprocessen kunnen fouten sneller worden ontdekt en gecorrigeerd, wat leidt tot een hogere betrouwbaarheid en efficiëntie op elke moment in het proces. Bovendien kunnen hierdoor de kosten van het verwerkingsproces worden verminderd, terwijl de klanttevredenheid toeneemt door snellere en nauwkeurigere dienstverlening. Meer informatie Wil je meer weten over het project of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:08:59Z",
  "source": "ech.nl"
}