{
  "id": "d4a01d5287c0636553655890c1f47d71d9b2f3e3",
  "url": "https://www.ech.nl/notarissen/rnhb/",
  "title": "RNHB - ECH",
  "text": "RNHB - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: RNHB Proces: Passeren E-mail: – Telefoon: – 01 Nieuwsberichten 02 Passeren 03 Royeren Deelnemersinfo RNHB Algemene informatie/nieuwsberichten (kort) N.v.t. Notarisinstructie passeer proces Passeerproces PROCES VAN HYPOTHEEKVERSTREKKING VIA ECH Passeeropdracht: RNHB stuurt passeeropdracht aan notaris Via ECH krijgt u alle informatie die nodig is om het concept van de hypotheekakte op te stellen. Indien er bijzonderheden zijn waar u rekening mee moet houden, vermelden we dat in het passeeropdracht bericht. Passeergegevens: Notaris stuurt passeergegevens aan RNHB De passeergegevens dienen minimaal 3 werkdagen voor de passeerdatum aan RNHB te worden doorgegeven. Indien er binnen 3 werkdagen gepasseerd moet worden dan dient u met ons contact op te nemen. Voeg altijd de afrekening die u voor de klant opmaakt toe als bijlage in ECH. Sluitnota: RNHB stuurt sluitnota aan notaris In de bijlage van dit bericht vindt u de sluitnota. RNHB maakt het geld over op het door u opgegeven rekeningnummer. We willen u vragen contact met ons op te nemen als u 2 werkdagen voor de passeerdatum nog geen sluitnota van ons heeft ontvangen. Indien de gelden 1 werkdag van te voren worden overgemaakt, kan RNHB niet garanderen dat de gelden op tijd door u ontvangen zijn. RNHB zal tijdelijk nog geen uitsplitsing meesturen van eventuele inhoudingen. Eventuele afsluitkosten, taxatiekosten en bouwdepotkosten worden in mindering gebracht op het te verstrekken leningbedrag. Deze kosten kunt u vinden in de getekende offerte. Verbouwingsdepots zullen nooit uitgekeerd worden bij het passeren van de hypotheekakte. Passeerbevestiging: Notaris stuurt passeerbevestiging aan RNHB U stuurt ons de passeerbevestiging en als bijlage een notarisverklaring en een afschrift van de hypotheekakte. De notarisverklaring en het afschrift van de akte moet u in PDF/A formaat aanleveren. Daarnaast moet het afschrift ondertekend zijn met een geldig PKI-Overheid certificaat. Aandachtspunten Wijziging passeerdatum: Wij verzoeken u een wijziging van de passeerdatum uiterlijk drie werkdagen voor de al geplande passeerdatum via ECH door te geven. Dit zorgt ervoor dat wij de wijziging ook tijdig in onze systemen kunnen doorvoeren. Als de nieuwe passeerdatum binnen de huidige werkweek ligt, is het niet nodig om eventueel ontvangen gelden terug te storten. Indien u hiervan wilt afwijken, neemt u dan contact met ons op. Bijlagen: U kunt in ECH ook andere bijlagen toevoegen aan berichten (bij gebruik van een softwarepakket met geïntegreerde ECH functionaliteit) of een bijlage als apart bericht versturen (bij gebruik van de ECH webapplicatie). Wijzigingsverzoeken: RNHB kan een wijzigingsverzoek aan u toezenden. Het is belangrijk dat u deze wijzigingsverzoeken goed in de gaten houdt, omdat het mogelijk is dat uw bericht niet verwerkt kan worden. De betreffende fout in het bericht wordt in het wijzigingsverzoek omschreven. U dient een nieuw verzoek in te dienen. Wijziging passeeropdracht en ECH zaaknummer: Als uw klant een wijziging aan RNHB doorgeeft of als RNHB een wijziging doorvoert, dan wordt er een nieuwe passeeropdracht aangemaakt onder een nieuw ECH zaaknummer. U ontvangt hierover bericht via ECH. Vanaf dat moment dient u het nieuwe ECH zaaknummer te gebruiken. Het oude ECH zaaknummer komt te vervallen. Ondertekening: Met het sturen van de passeeropdracht verzoeken wij u om op de passeerdatum namens RNHB de hypotheekakte te ondertekenen. We zullen indien wenselijk vanuit RNHB de concept hypotheekakten vooraf controleren. We zullen in dat geval een aanvullende instructie geven dat goedkeuring nodig is op het concept van de hypotheekakte. Indien u vragen heeft over het opstellen van de hypotheekakte neemt u dan contact met ons op. Contact RNHB In de passeeropdracht staan onze contactgegevens voor als u vragen of opmerkingen heeft. Notarisinstructie r oyementenproces Royementenproces VERZOEKEN DIE (NOG) NIET VIA ECH VERLOPEN Royementsverzoeken RNHB: De aflosnota’s voor RNHB kunt u opvragen via RNHBbeheer@vestingfinance.nl . Vesting Finance Services B.V. zal deze verzoeken voor u afhandelen. Het kan zijn dat in het Kadaster nog de hypotheek ingeschreven staat onder de naam: FGH Bank, Rijnlandse Hypotheekbank of SNS Propertize. Ook aflosverzoeken voor deze hypotheken kunnen gedaan worden aan RNHBbeheer@vestingfinance.nl . Royementsverzoeken Roparco Hypotheken: Dit betreft hypotheken die bij Roparco Hypotheken lopen. De aflosnota’s hiervoor vraagt u op bij Stater. Stater zal deze verzoeken verder voor u afhandelen via E-notaris of via aflossen@stater.nl . Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:29:09Z",
  "source": "ech.nl"
}