{
  "id": "d659a7aaf16418388334bfc8721c2b13ddae36d6",
  "url": "https://www.ech.nl/bewijs-bewaaradvies/",
  "title": "Bewijs & bewaaradvies - ECH",
  "text": "Bewijs & bewaaradvies - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Terug naar 'Zo werkt ECH' Bewijsvoering en bewaaradvies Door het aangaan van een schriftelijke toetredingsovereenkomst is elke deelnemer gebonden aan de algemene voorwaarden van ECH. In de algemene voorwaarden is het volgende opgenomen over de bewijskracht van berichten: De schriftelijke vastlegging of reproductie door deelnemers van de binnen ECH ontvangen berichten, dan wel overige binnen ECH vastgelegde gegevens, levert tussen deelnemers dwingend bewijs op, behoudens tegenbewijs. Stichting ECH draagt zorg voor logging en registratie van verkeersgegevens. Bewaartermijn ECH berichten Via ECH uitgewisselde berichten en bijlagen worden door ECH, met het oog op privacy, niet langer bewaard dan nodig.  Berichten en eventuele bijlagen: Worden daarom niet langer dan nodig is bewaard. Alle zaken die zes maanden of langer geleden zijn afgerond worden na het versturen van het laatste bericht automatisch verwijderd. Onder laatste bericht wordt verstaan: akkoord royement, passeerbevestiging (voorheen bewaardersverklaring) en stoppenbericht. Alle inactieve zaken waar al langer dan een jaar geen activiteit op is uitgevoerd, worden automatisch verwijderd. Onder activiteit wordt verstaan: het versturen van een bericht en/of het lezen van een ongeopend bericht. Gedurende 6 maanden na de verwijdering van berichten kunnen de verkeersgegevens (logging) tegen kostprijs door deelnemers worden opgevraagd; na die periode worden ook deze gegevens verwijderd. Eigen verantwoordelijkheid en bewaaradvies Deelnemers zijn zelf verantwoordelijk voor een duurzame opslag van gegevens voor het leveren van bewijs of het vervullen van wettelijke bewaarplichten. Als je via een softwarepakket met ECH werkt, kun je bij de softwareleverancier navragen of en op welke manier automatische opslag van gegevens in ECH geregeld is. Als je met de ECH webcliënt werkt, dien je zélf zorg te dragen voor opslag. Om dit te vereenvoudigen, is een aantal voorzieningen in de ECH  webcliënt gecreëerd: Na het versturen van het bericht ‘passeerbevestiging’ of na het ‘stoppen’ bericht verschijnt er een pop-up, waarbij je ervoor kunt kiezen om de zaak te downloaden. In het menu ‘extra’ kun je te allen tijde, zowel tijdens de looptijd van een zaak als na afronding van een zaak, een zaak downloaden. Als je op “download ECH-zaak” klikt, ontvang je vervolgens een zip-bestand met alle berichten en bijlagen uit de betreffende zaak. Deze dien je vervolgens zelf lokaal te archiveren. Bewaaradvies Stichting ECH adviseert om alle in een ECH-zaak uitgewisselde berichten en bijlagen te bewaren. Notarissen kunnen er voor kiezen om hun dossiers in papieren vorm of digitaal te archiveren. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:31:53Z",
  "source": "ech.nl"
}