{
  "id": "da68b726cb0b1c8622084da2abec42a83ae0e498",
  "url": "https://www.ech.nl/klant-centraal-stellen-blijft-het-belangrijkste-nick-van-buitenen-van-grafhorst-notarissen/",
  "title": "‘Klant centraal stellen blijft het belangrijkste’, Nick van Buitenen, Van Grafhorst Notarissen - ECH",
  "text": "‘Klant centraal stellen blijft het belangrijkste’, Nick van Buitenen, Van Grafhorst Notarissen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Klant centraal stellen blijft het belangrijkste’, Nick van Buitenen, Van Grafhorst Notarissen / Bestuur , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door Raymond Bloot ‘Het centraal stellen van de klant blijft wat mij betreft het belangrijkste in het hele proces. Dat geldt bijvoorbeeld ook voor hoe de output uit het ECH-systeem oogt.’ Dat zegt Nick van Buitenen, notaris bij Van Grafhorst Notarissen én oud-voorzitter van de KNB. ‘Daar is tot nu toe nog niet zoveel aandacht aan gegeven. Dat maakt dat wij als notariskantoor nog gebruik maken van andere softwaresystemen waarvan de output qua vormgeving beter geschikt is om als communicatiekanaal naar de klant te dienen. In de ideale wereld doe je dat geïntegreerd vanuit één kanaal. En dan liefst ook nog zo dat de klant direct mee kan kijken, bijvoorbeeld om te zien of de notaris de gelden voor de aankoop van een woning al opgevraagd heeft bij de bank.’ Nick van Buitenen, notaris bij Van Grafhorst Notarissen Beperkte Ketenintegratie kan veel verder uitgebreid worden ‘Andersom kan de notaris dan de status zien vanuit de stappen die de klant moet zetten om de woning tijdig te laten passeren. Zoals het nu gaat heb ik als notaris bijvoorbeeld onvoldoende in beeld wat de klant doet. Dat ligt overigens niet aan ECH, maar aan de manier waarop het tot nu toe gaat binnen de keten. Daar liggen nog zoveel kansen voor zowel notarissen als banken. Denk alleen al aan de nazorg die achteraf plaats kan vinden. We merken in de praktijk op dat mensen na het passeren van hun woning nog best vaak vragen hebben. Bijvoorbeeld over de hoogte van de rente of over de manier waarop het bouwdepot ook alweer werkt. Daar is een slag in te maken, kijkend naar ketenintegratie.’ ‘Feitelijk zou de klant de mogelijkheid moeten hebben om als een spin in het web te kunnen fungeren’, aldus Nick van Buitenen Samenwerken in hetzelfde klantdossier ‘Zo zou het mooi zijn als alle betrokken partijen, waaronder ook de financieel adviseur en de makelaar, mee kunnen kijken in hetzelfde dossier. In de transitie naar verregaande digitalisering wil je idealiter steeds dat de klant het als gemakkelijk ervaart. Daarmee geef je de klant een stuk regie en verantwoording over zijn eigen dossier. Deze heeft nu vaak het gevoel diverse keren dezelfde stukken aan verschillende partijen aan te moeten leveren. En regelmatig is dat ook zo. Voor de consument is dat iets merkwaardigs. Het roept de vraag op waarom de handen binnen de keten niet nóg meer in een geslagen worden. Feitelijk zou de klant de mogelijkheid moeten hebben om als een spin in het web te kunnen fungeren. ECH is wat dat betreft een mooi voorbeeld van hoe je vanuit één uniform platform samen kunt werken.’ Meer informatie Wil je meer weten over de visie van Nick van Buitenen of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:25:54Z",
  "source": "ech.nl"
}