{
  "id": "dc93921bf52aa80e9e53c828e36a02bfd7c309c7",
  "url": "https://www.ech.nl/nationale-nederlanden-over-op-ech-4-0/",
  "title": "Nationale-nederlanden over op ECH 4.0 - ECH",
  "text": "Nationale-nederlanden over op ECH 4.0 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Nationale-nederlanden over op ECH 4.0 / Nieuws / Door Ruby Nationale-nederlanden maakt met ingang van 5 december 2018 gebruik van ECH 4.0. Voor u als notaris betekent dit dat er een aantal zaken verandert bij het passeren van nationale-nederlanden hypotheken. Zo stuurt nationale-nederlanden u voortaan een gestructureerde invulinstructie bij de passeeropdracht en wordt u gevraagd een digitaal ondertekend akteafschrift retour te zenden via ECH (binnen 3 werkdagen). Daarnaast dient u op een andere manier door te geven dat u gelden gaat specificeren. Wat er voor u verandert, leest u op https://www.ECH.nl/hypothecair-financiers/nationale-nederlanden-bank/ . Daar wordt stap voor stap beschreven hoe het passeerproces van nationale-nederlanden via ECH werkt. Bovendien staat daar een aantal aandachtspunten om rekening mee te houden. Overgangsfase ECH 4.0 Gebruikt u nog een andere versie van ECH? Tot en met 31 december 2018 hanteert ECH een overgangsfase. Uw berichten aan nationale-nederlanden via ECH worden dan automatisch omgezet naar ECH 4.0. Bovengenoemde gestructureerde invulinstructie ontvangt u in pdf formaat als u nog geen gebruik maakt van ECH 4.0 of als uw softwarepakket met geïntegreerde ECH functionaliteit dit nog niet ondersteunt. Heeft u nog vragen? Als u nog vragen heeft over ECH 4.0 neemt u dan contact op met de servicedesk van ECH via het telefoonnummer 070 330 71 35 of via servicedesk@KNB.nl. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:27:08Z",
  "source": "ech.nl"
}