{
  "id": "dd5b016c08155afab43a60fa061118cb20f1d95e",
  "url": "https://www.ech.nl/meet-the-team-romano-denneboom/",
  "title": "Meet the team - Romano Denneboom - ECH",
  "text": "Meet the team - Romano Denneboom - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Romano Denneboom / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Van voetbalkind naar gestructureerde IT’er ‘Ik ben van kinds af aan al een enorme sportliefhebber: ik heb jarenlang tennis en voetbal gespeeld. Nog altijd sport ik graag, tegenwoordig is dat alleen nog voetbal en de sportschool. Het liefst zou ik ook nog tennissen of padellen, maar dat valt niet meer goed te combineren met mijn werk en mijn gezin’, aldus Romano Denneboom , sinds 2023 aan de slag voor stichting ECH als functioneel beheerder. Romano Denneboom, Functioneel Beheerder ECH Voetballen-voetballen-voetballen ‘Dat ik voor ECH werk is eigenlijk best bijzonder als ik zo terugdenk aan mijn jeugd. Want ik kan me nog levendig herinneren dat ik in die tijd dacht dat een kantoorbaan niks voor mij was. Wie wil er nu de hele dag stil zitten, redeneerde ik. Als kind was ik veel buiten, na school ging ik metéén voetballen op het pleintje. Dan om zes uur even snel thuis eten en meteen weer naar buiten. Ik hoorde mijn moeder nog net roepen dat ik voor het donker thuis moest zijn.’ Voorkeur voor cijfers en economie ‘En toch, dan groei je op, merk je dat je goed met cijfers bent, economische vakken je liggen en kies je voor een studie bedrijfskunde. Al snel kwam ik in banen terecht waar ik met het hypothekenvak te maken kreeg. En dat lag me wel. Toen ik op gegeven moment als acceptant werkte werd me gevraagd om aan een software- implementatieproject deel te nemen. Het oude hypotheekaanvraag-systeem werd namelijk uitgefaseerd en men zocht mensen om het nieuwe systeem te testen. Vervolgens werd ik functioneel beheerder van dit systeem. Dit betekende dat ik meer met IT te maken kreeg, met softwareleveranciers ging schakelen en dat ik verantwoordelijk werd voor het draaiende houden van verschillende applicaties. Dat was ook het moment dat ik de hbo-opleiding Functioneel Beheer van NCOI ben gaan volgen om mijn basiskennis van IT te verbeteren. Toen de portefeuille waar ik verantwoordelijk voor was na enkele jaren naar een andere partij werd gemigreerd, brak voor mij het moment aan om verder te kijken. Sinds 2023 ben ik voor ECH aan de slag als functioneel beheerder.’ ECH, een compleet pakket ‘ECH bestaat uit een enthousiaste club van professionals die samen hoogwaardige kwaliteit van dienstverlening nastreven. Ik heb het gevoel dat dit team echt in control is. Erg fijn, want dat kan ook anders’, lacht Romano. ‘De werksfeer is lekker informeel, waarbij er niet alleen hard wordt gewerkt, maar ook genoeg wordt gelachen. Daarnaast wordt er binnen ECH vrij snel van je verwacht dat je zelfstandig aan de slag gaat. Persoonlijk vind ik dat pakken van die rol heel prettig omdat ik houd van vrijheid en een bepaalde mate van verantwoordelijkheid in mijn werk. Kortom, het voelt heel goed allemaal en dit complete pakket motiveert mij om mezelf voor de volle 100% in te zetten binnen het team.’ Rust door structuur ‘Dat opgeruimde, gestructureerde dat mijn werk van me vraagt past goed bij me. Ik probeer elke dag te beginnen met het bijwerken van mijn e-mails, want als ik veel e-mails open heb staan, dan heb ik geen rust in mijn hoofd. Verder variëren mijn werkweken nogal, want als consultant ben je veel onderweg. Soms is dat naar ons ontwikkelteam in Arnhem om afstemming te hebben over ons product, dan weer is het naar klanten door het hele land om ze te begeleiden bij het gebruik van ons product. Of ik rijd naar het eigen hoofdkantoor in Naarden om een dagje met mijn collega’s door te brengen’, vervolgt Romano. ‘Daarnaast word ik vaak geleid door de waan van de dag. Als beheerder van een applicatie kan er op elk moment iets gebeuren, waarop je meteen moet reageren. Dit leidt er vaak toe dat je op een dag niets doet van wat je van tevoren had bedacht. En dat kan, kijkend naar mijn hang naar structuur, soms best frustrerend zijn. Aan de andere kant maakt dit je werk ook weer dynamisch en minder voorspelbaar, wat wel weer fijn is. Bovendien geeft het een voldaan gevoel als je een belangrijk probleem weet op te lossen.’ Drukke maanden achter de rug ‘In de afgelopen maanden zijn we ontzettend druk geweest met de certificering van Royeren 5.0. Vanuit ECH gaan we dan bij alle aangesloten banken en notarieel softwareleveranciers langs. Wij controleren dan of de implementatie op een juiste wijze, passend bij de afspraken is gedaan en of er op een correcte, uniforme manier berichten worden uitgewisseld. Het is belangrijk dat iedereen zich aan deze afspraken houdt, omdat dit de kwaliteit van ons platform hooghoudt. Wanneer dat allemaal goed gaat dan kan men live gaan op de productieomgeving van ons platform. We zijn het hele land doorgereisd om bij alle aangesloten partijen op bezoek te gaan.’ Gepaste trots ‘De manier waarop het nu loopt, daar ben ik best trots op: dat het lukt om deze baan te combineren met een gezin, mijn sport en andere activiteiten. Zo ben ik nogal een sociaal dier: ik besteed graag tijd aan vrienden en familie. Dat vraagt, hoe niet-spontaan het ook klinkt, om goed plannen van je tijd. Ook in privé. Juist daardoor lukt het me om alle ballen hoog te houden, zonder dat ik daarbij al te veel stress ervaar’, besluit Romano. Meer informatie Heb je vragen voor Romano of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor iedereen klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:06:44Z",
  "source": "ech.nl"
}