{
  "id": "de4f95e04049694c040d9a2d391b7da91d81d81f",
  "url": "https://www.ech.nl/ik-kan-me-niet-voorstellen-waarom-je-als-notaris-niet-voor-ech-zou-kiezen-bob-van-elst-notaris-bij-lingewaerd-notarissen/",
  "title": "‘Ik kan me niet voorstellen waarom je als notaris niet voor ECH zou kiezen’, Bob van Elst, notaris bij Lingewaerd Notarissen - ECH",
  "text": "‘Ik kan me niet voorstellen waarom je als notaris niet voor ECH zou kiezen’, Bob van Elst, notaris bij Lingewaerd Notarissen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Ik kan me niet voorstellen waarom je als notaris niet voor ECH zou kiezen’,  Bob van Elst, notaris bij Lingewaerd Notarissen / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door Raymond Bloot ‘De reden waarom wij in eerste instantie voor samenwerking met ECH hebben gekozen heeft te maken met de koppeling vanuit onze softwareleverancier Van Brug Software. En daarnaast kan ik me overigens bijna niet voorstellen dat er nog notarissen zijn die niet met ECH werken. Het aanvragen van stukken en gelden verloopt immers volledig via hen.’ Aan het woord is Bob van Elst, notaris bij Lingewaerd Notarissen: een all-round notariskantoor tussen Arnhem en Nijmegen. Het kantoor is gespecialiseerd in het begeleiden van de mkb-ondernemer en richt zich op vermogensplanning en (commercieel) vastgoed. Korte lijnen, snelheid, service en geen poespas: daar staat men voor. Bob van Elst, notaris bij Lingewaerd Notarissen Werken met ECH: praktisch en gebruiksvriendelijk Bob: ‘Werken met het platform van ECH is, ook vanwege de mooie integratie, erg praktisch. Opdrachten komen meteen binnen en worden gekoppeld aan het online dossier. Je ziet, helemaal sinds de coronatijd, dat er qua papierwerk veel uit handen is genomen en digitaal verloopt. Er zijn ook wel hypothecair financiers die andere platformen gebruiken, maar ECH steekt er toch wel bovenuit qua gebruiksvriendelijkheid van het digitale platform. Het maakt daarbij niet uit of ik vanuit kantoor of vanuit huis werk, alles loopt even soepel. Voorheen moest ik toch altijd even naar kantoor toe om te horen of er nog opdrachten waren binnengekomen, of om de meest actuele stand te beluisteren. Dat is gelukkig verleden tijd.’ Twijfels vooraf? Viel mee ‘Ik had eigenlijk geen twijfels vooraf. In de praktijk merk ik overigens dat het verwerken van stukken van zakelijke cliënten nog niet helemaal optimaal gaat. Maar dat is meer een technisch verhaal. Dat heeft ook wel te maken met de veranderde manier waarop hypothecair financiers zijn gaan werken. Voorheen kon je nog wel contact opnemen met het lokale kantoor om snel te schakelen. Maar de tijden zijn veranderd. Nu moet veelal alles via de officiële kanalen gaan, omdat veel hypothecair financiers niet meer rechtstreeks benaderbaar zijn.’ ‘Het werkplezier is toegenomen doordat er veel handmatig werk vervallen is. Die tijd kunnen we nu aan andere zaken besteden’, aldus Bob van Elst De ervaring met ECH in drie kernwoorden ‘Het eerste dat in me opkomt als ik aan de samenwerking met ECH denk is snelheid: ik vind het voor de particuliere hypotheken bijvoorbeeld erg prettig dat ik snel en accuraat terugkoppeling krijg. Wanneer je als notaris een bepaalde opdracht geeft dan hoef je niet meer na te bellen of het allemaal wel goed loopt. Het proces wat daarachter zit is volledig, veilig en optimaal geautomatiseerd. Het tweede woord waar ik aan denk is accuraat. En daarnaast kreeg ik van mijn collega nog als pluspunt de informatievoorziening vanuit ECH door. Ik ben daar zelf wat minder mee bezig maar ik heb begrepen dat er veel duidelijke uitleg, compleet met handleidingen, op de website van ECH beschikbaar is en dat er tijdens kantooruren een servicedesk bereikbaar is’, aldus Bob. Werkelijkheid komt overeen met belofte ‘Inmiddels komt de werkelijkheid wel overeen met de verwachtingen die ik had, want er zijn enorme slagen gemaakt. Een paar jaar geleden liep het nog niet zo gestroomlijnd allemaal. Nu is alles geïntegreerd in Codex en dat is fantastisch. Ik denk overigens dat het werken met ECH staat of valt met de integratie die je softwareleverancier je biedt. Voorheen was er nog zo’n ouderwetse kaartenbak en daarin misten echt wel functionaliteiten. Nu worden veel velden automatisch gevuld waardoor er veel minder fouten worden gemaakt. Het werkplezier is toegenomen doordat er veel handmatig werk vervallen is. Die tijd kunnen we nu aan andere zaken besteden.’ ECH staat voor duidelijkheid ‘ECH geeft, als je het kort samenvat, vooral veel duidelijkheid door de uniforme werkwijze. Waar het vroeger nog weleens spannend was of de gelden op tijd waren, hoef je daar nu niet eens meer over na te denken. Tot slot wil ik nog wel opmerken dat de samenwerking van mens tot mens ook erg prettig is met stichting ECH. De lijnen zijn kort, en de manier van informeren is persoonlijk. Je kunt gemakkelijk en snel even bellen en als er iets speelt, wordt het ook concreet opgepakt.’ ‘Aan wie ik ECH zou aanbevelen? Aan wie niet eerlijk gezegd! Ik kan me vanuit mijn rol als notaris echt niet voorstellen waarom je het platform van ECH niet zou gebruiken’, besluit Bob. Meer informatie Wil je meer weten over de visie van Bob van Elst of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:34:43Z",
  "source": "ech.nl"
}