{
  "id": "de60ddc159e646ff8311298fff792ab86c683c2a",
  "url": "https://www.ech.nl/het-notarieel-samenwerking-ech/",
  "title": "Het Notarieel enthousiast over samenwerking met ECH - ECH",
  "text": "Het Notarieel enthousiast over samenwerking met ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Het Notarieel enthousiast over samenwerking met ECH / KNB , Nieuws , Notaris , Referenties notariaat / Door echadmin ‘Ik denk dat wij als kantoor tevreden kunnen zijn over de samenwerking met ECH. Daar ben ik heel positief over. En dan heb ik het over het gebruik voor ons als notaris naar de bank. Maar zeker ook over de informatieverstrekking richting de cliënt. Dankzij de software en de uniforme documentendeling werkt het allemaal erg efficiënt samen.’ Dat zegt Edgar van der Kamp, register-notarisklerk bij Het Notarieel, het grootste onafhankelijke notariskantoor van Nederland. Het kantoor beschikt over zes locaties in Midden- en Oost-Nederland en er werken dagelijks zo’n 160 vakmensen aan verschillende dossiers. Dossiers die veelal over juridische zaken gaan rondom de belangrijke levensmomenten van hun cliënten. Hans-Willem Heetebrij, notaris bij Het Notarieel Steeds meer partijen sluiten aan ‘Laatst nog heb ik met een aantal collega’s over de software gesproken. Het zit goed in elkaar. Daarom maakt 99% van de Nederlandse notariskantoren ook gebruik van ECH. De software biedt namelijk een snelle en gebruiksvriendelijke manier om trajecten te doorlopen. Werken met het platform is volledig digitaal en je hebt niet, zoals vroeger wel het geval was, te maken met allerlei papieren administratieve toestanden. Door vereenvoudiging en digitalisering van dit traject kunnen we snel schakelen, op een veilige manier, en dat geeft rust, grip en controle’, aldus Edgar. ‘Het is bovendien erg prettig om te merken dat ECH bezig is met het toevoegen van meerdere partijen. Zo is kortgeleden bijvoorbeeld ook Quion aangehaakt. Het aansluiten van andere partijen betekent dat steeds meer aflos- en passeertrajecten via deze digitale snelweg geregeld kunnen worden. En dat is een groot pluspunt voor onze klanten. Enerzijds omdat we daardoor snel en efficiënt ons werk kunnen doen en anderzijds omdat we door deze tijdsbesparing eenvoudigweg meer klanten kunnen bedienen.’ Hans-Willem Heetebrij, partner en notaris op de vestiging in Emmeloord vult aan: ‘Ik kan het verhaal van Edgar onderschrijven. Wanneer ik zo nu en dan met een bank samenwerk die niet is aangesloten bij ECH, dan merk je meteen dat een en ander een stuk lastiger gaat. Juist door de software ben je in staat om met elkaar uniforme werkafspraken te maken. Bijvoorbeeld over processen en termijnen waarbinnen je naar elkaar geacht wordt te reageren. Wij werken overigens bewust met de integratie via ons softwarepakket. En dus niet met de webcliëntversie. Deze keuze hebben wij gemaakt uit het oogpunt van efficiëntie, omdat we op deze manier het handmatig ingeven van gegevens zoveel mogelijk vermijden. De integratie zorgt namelijk voor een naadloze koppeling met onze virtuele kaartenbak.’ De samenwerking in drie woorden ‘Wanneer ik de samenwerking in drie kernwoorden zou moeten beschrijven dan denk ik allereerst aan snelheid en integratie’, zegt Edgar, ‘en direct daarna aan het woord toekomst. Het is, precies zoals Hans-Willem al aangeeft, belangrijk om uniform en efficiënt samen te werken met andere partijen. Waarom zou je data steeds los ingeven terwijl er een prima mogelijkheid is om geautomatiseerd met elkaar te communiceren? Een manier waarbij bovendien iedereen dezelfde gegevens als uitgangspunt gebruikt. Persoonlijk zie ik in bredere zin nog wel een uitdaging voor de keten om nóg verder met elkaar te integreren en uit te breiden. Zo zijn sommige partijen bijvoorbeeld wel aangesloten voor het passeertraject, maar nog niet voor het aflostraject. En dan grijp je met elkaar al snel weer terug op papieren formulieren. Iets wat gewoon niet meer van deze tijd is. Als alle banken zijn aangesloten bij ECH, dan maakt dat  de samenwerking binnen de keten een stuk gemakkelijker. Daar vaart de cliënt uiteindelijk wel bij. En daar doen we het met elkaar uiteindelijk allemaal voor.’ Focus op ontwikkeling Edgar: ‘Je merkt ook aan alles dat er focus op ontwikkeling is binnen ECH. Zo kun je gemakkelijk wijzigingsverzoeken indienen of even snel een vraag stellen. Ook het uploaden van documenten gaat heel gemakkelijk. En de output ervan wordt bovendien prima afgehandeld. Ik heb echt vertrouwen in ECH. De tijd waarin we via e-mail werkten ligt inmiddels ver achter ons. De digitale documentenuitwisseling via het platform van ECH is vele malen veiliger.’ ‘Ruimte voor verbetering is er uiteraard ook nog’, vult Hans-Willem aan. ‘Zo kan de betrokken bank bijvoorbeeld niet alle opmerkingen zien die ik plaats over een bepaald dossier. En dat zou wel heel gemakkelijk zijn. Maar daar wordt aan gewerkt door ECH. En dat past in de positieve lijn waarin de stichting zich richt op vooruitgang en de toekomst. Het menselijke aspect valt me sowieso op binnen de ECH-organisatie. De sfeer is er gezellig, iedereen wil meedenken. De mensen binnen de stichting zijn welwillend en staan open voor feedback.’ Meer informatie Wil je meer weten over de samenwerking tussen Het Notarieel en Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:23:34Z",
  "source": "ech.nl"
}