{
  "id": "e15a16a26318dfd4d35895eae2141f717e44b55c",
  "url": "https://www.ech.nl/verbeterde-werkwijze-spoedroyement-bij-rabobank2023/",
  "title": "Verbeterde werkwijze spoedroyement bij Rabobank - ECH",
  "text": "Verbeterde werkwijze spoedroyement bij Rabobank - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Verbeterde werkwijze spoedroyement bij Rabobank / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Er kunnen zich situaties voordoen dat een royement eerder dient te passeren dan de reguliere aanlevertermijn van 15 werkdagen die Rabobank nu hanteert. Rabobank wil de notaris en de gezamenlijke klant hierin blijven faciliteren op een efficiëntere manier. Per 1 september 2023 is het spoedroyeren proces binnen Rabobank daardoor gewijzigd. Wanneer er sprake is van een spoedroyement wordt per 1 september van de notaris gevraagd om, na het indienen van het royementsverzoek via ECH, contact op te nemen met Service Centrum Wonen (SCW) Royeren (088 7288728, keuze 1.2). Deze afdeling staat specifiek opgesteld voor royeren, waardoor het spoedverzoek direct op de juiste plek terechtkomt. De medewerker van SCW Royeren gaat in het gesprek met de notaris na of het spoedroyement voldoet aan de voorwaarden. De medewerker zal daarna op basis van de beschikbare capaciteit bepalen of het dossier als spoedroyement in behandeling genomen kan worden. Het vervolgproces blijft ongewijzigd en we zullen ons best doen om de gewenste passeerdatum te halen. Door de wijzigingen die per 1 september zijn doorgevoerd is het spoedroyeren proces efficiënter geworden voor de notaris. Er is een snellere afstemming mogelijk met SCW Royeren en de medewerker van SCW Royeren is direct in staat om een spoedverzoek te beoordelen. Meer informatie Wil je meer weten over de verbeterde werkwijze van de Rabobank of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:32:10Z",
  "source": "ech.nl"
}