{
  "id": "e28f24927d98476c0d500c67d413093f5332ce12",
  "url": "https://www.ech.nl/wijzigingen-aan-ech/",
  "title": "Wijzigingen aan ECH - ECH",
  "text": "Wijzigingen aan ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Wijzigingen aan ECH / Nieuws / Door Ruby Met ingang van vrijdag 7 april is er een aantal wijzigingen doorgevoerd aan ECH. Middels dit nieuwsbericht willen we u op de hoogte brengen van deze wijzigingen. Uitbreiding lijst kadastervestigingen Bij het aanmaken van een afloszaak dient u de inschrijvingsgegevens van de door te halen hypotheek op te geven. Onderdeel van deze gegevens is onder meer de kadastervestiging waar de hypotheek (destijds) is ingeschreven. Met enige regelmaat kreeg ECH vanuit het notariaat de opmerking dat niet de volledige lijst met historische kadastervestigingen beschikbaar was bij het aanmaken van een afloszaak. Om een hypotheek te allen tijde juist te kunnen duiden heeft ECH de lijst uitgebreid  Met ingang van vrijdag 7 april is de keuzelijst van kadastervestigingen uitgebreid met alle historische kadastervestigingen. Omdat ook de aangesloten maatschappijen deze wijziging hebben moeten doorvoeren heeft het enige tijd geduurd voordat ECH deze nieuwe lijst ter beschikking kon stellen. De nieuwe lijst is na de wijziging direct beschikbaar in de webapplicatie van ECH. Indien u gebruik maakt van een notarieel softwarepakket met ECH-integratie dan kunt u bij uw notariële softwareleverancier informeren in welke update de wijziging zal worden meegenomen. Notificatiemail op rappeldatum taak Vanuit de hypothecair financiers heeft ECH begrepen dat het af en toe voorkomt dat een taak in het passeerproces ten onrechte over het hoofd wordt gezien. Voorbeeld hiervan is de taak “melden gelden” waarvan soms op de dag van passeren blijkt dat deze niet is uitgevoerd, waardoor de gelden niet zijn uitbetaald. Dit leidt uiteraard tot vervelende situaties. Uiteraard werkt ECH nauw samen met de notariële softwareleveranciers om het proces zo duidelijk mogelijk te maken. Om notariskantoren te herinneren aan eventuele openstaande taken zal ECH vanaf vrijdag 7 april notificatiemails versturen indien een taak op de dag van de deadline nog niet is afgehandeld. Deze notificatiemail geldt uitsluitend voor de taken “Melden gelden” en “Bewaardersverklaring” binnen het passeerproces. Als u via de ECH Beheeromgeving (KNB Portal) heeft aangegeven dat u deze notificatiemails wilt ontvangen, dan hoeft u verder niks te doen. Wilt u helemaal geen notificatiemails ontvangen? Dan kunt u dit via dezelfde beheeromgeving uitvinken. Wat is de deadline van deze taken binnen ECH? Melden gelden: 3 werkdagen vóór passeerdatum Bewaardersverklaring: 10 werkdagen ná passeerdatum Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:09:29Z",
  "source": "ech.nl"
}