{
  "id": "e2f1b22bad655fc6707bd44a4e880ed1957317ad",
  "url": "https://www.ech.nl/ech-transformeert-berichtenverkeer-met-royeren-5-0-een-grote-stap-vooruit/",
  "title": "ECH transformeert berichtenverkeer met Royeren 5.0: een grote stap vooruit - ECH",
  "text": "ECH transformeert berichtenverkeer met Royeren 5.0: een grote stap vooruit - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH transformeert berichtenverkeer met Royeren 5.0: een grote stap vooruit / ECH medewerkers , Hypotheekmarkt , KNB , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door Raymond Bloot In een recent interview spraken we met Romano Denneboom, functioneel beheerder en consultant bij Stichting ECH, over de overgang naar Royeren 5.0 en de bijbehorende uitdagingen. De overgang naar een nieuwe versie van het ECH-aflosproces was een belangrijke mijlpaal, waarbij alle betrokken partijen moesten overstappen op de nieuwste versie. Speerpunten binnen dit proces waren met name verbetering van de workflow, uitbreiding van de keuzelijsten, optimaliseren van berichtschema’s, een verbeterde service voor procesberichten en de naamswijziging naar Royeren. Een ander bijkomend punt was de technische loskoppeling van het passeerproces, waardoor de processen in de toekomst separaat van elkaar gereleaset kunnen worden. Een perfecte start bij ECH Romano: “In augustus 2023 begon ik bij ECH, precies toen de eerste aangesloten partijen startten met het integreren van Royeren 5.0. Hierdoor kwam ik direct in contact met de hypothecair financiers en notarieel softwareleveranciers over het Royeren proces. Dit bood mij de perfecte gelegenheid om meteen diep in dit project te duiken en nieuwe kennis op te doen en de partijen beter te leren kennen.” Romano Denneboom functioneel beheerder & consultant ECH Implementatie en certificering “Vanaf begin 2024 waren we bij ECH intensief bezig met de certificering van Royeren 5.0. Vanuit ECH bezoeken we dan alle aangesloten hypothecair financiers en notarieel softwareleveranciers voor een certificering. We controleren of de implementatie voldoet aan de certificeringseisen die ECH stelt. Het is cruciaal dat iedereen zich aan deze afspraken houdt om de kwaliteit van ons platform te waarborgen. Als alles goed verloopt, kunnen ze live gaan op de productieomgeving van ons platform. We hebben het hele land doorkruist om bij alle aangesloten partijen op bezoek te gaan”, legt Romano uit. “Het is natuurlijk altijd een spannend moment als je een nieuwe versie van een proces implementeert want het moet wel allemaal goed gaan.” Samen aan de slag In tegenstelling tot veel moderne software-updates, is het voor het ECH-team niet mogelijk om bij uitrol van nieuwe versies van een proces, zomaar de software van klanten op afstand te updaten. Romano: “Wij delen vooraf specificaties met hen over hoe het nieuwe proces werkt. Vervolgens gaan de notariële softwareleveranciers en hypothecair financiers aan hun kant wel met software developers aan de slag om alles in te bouwen, zodat het uiteindelijk gaat werken met de nieuwe berichtenstructuur,” legt Denneboom uit. “Het is niet zoals met je iPhone dat je zegt ‘update aanvaarden’ en dat het vanzelf gebeurt. Nee, iedereen moet zich houden aan dezelfde specificaties voor de inhoud van de berichten, en daarom moet elke partij zelf inregelen hoe de informatie vanuit hun applicaties in de berichten komt. Het is dus echt anders dan een reguliere update.” Voordelen van Royeren 5.0 De nieuwe versie van het royerenproces biedt voordelen die zijn afgestemd op de wensen en behoeften van de gebruikers. “We zijn doorlopend met hypothecair financiers en notariskantoren in gesprek over efficiëntie en wat hun wensen en behoeften zijn. En als er dan een nieuwe versie wordt uitgerold, dan worden daar nieuwe functionaliteiten of optimalisaties ingestopt waarvan de markt heeft aangegeven dat men daarop wacht”, zegt Romano. Het hele land door Tijdens het certificeringsproces reisde Romano het hele land door. “Ik genoot ervan om fysiek bij al deze partijen langs te gaan. Ik houd van een goede balans tussen thuis of op kantoor werken en onderweg zijn. Het bezoeken en ontmoeten van klanten past hier perfect bij. Door persoonlijk contact leer je de gezichten kennen achter de namen die je in e-mails ziet. Het was ook een uitstekende gelegenheid voor mij om mezelf als nieuw gezicht van ECH voor te stellen aan al onze klanten. Na een goede kennismaking en een gesprek vind je elkaar in de toekomst makkelijker.” Het was leerzaam voor Romano om te zien hoe verschillende partijen een ECH-proces in hun software implementeren. “Elke afnemer heeft zijn eigen IT-infrastructuur waar ECH op moet worden aangesloten, wat betekent dat het bij elke klant net iets anders werkt. Het was interessant om te zien hoe iedereen dit op zijn eigen manier oplost. Hierdoor kreeg ik een beter beeld van het gebruik van ECH in de markt,” vertelt hij. Hoewel Royeren 5.0 nu succesvol is geïmplementeerd, kijkt ECH al naar toekomstige verbeteringen. “In de toekomst volgt er wellicht nog een nieuwe versie van het Royeren proces, al is dat zeker niet op de korte termijn. Het is belangrijk om te leren van de huidige implementatie en sommige zaken korter op de bal te spelen qua afspraken. Maar over het algemeen is alles heel goed gegaan en vrij vlot allemaal,” concludeert Romano. Op naar het volgende project Met deze ervaringen en inzichten op zak kijkt Romano alweer vooruit naar toekomstige projecten bij ECH, waarbij hij zijn kennis en connecties verder zal benutten om bij te dragen aan de voortdurende verbetering van de ECH-diensten. “Al met al was het Royeren 5.0-traject voor mij de ideale start bij ECH. Ik werd, uiteraard wel met goede interne begeleiding, toch zo’n beetje in het diepe gegooid. Dat vind ik persoonlijk erg fijn: gewoon de mouwen opstropen en gáán. De connecties, kennis en ervaring die ik tijdens dit traject heb opgedaan, zorgen ervoor dat ik meer waarde kan toevoegen aan ECH. Mede hierdoor kijk ik uit naar de toekomst en de projecten die nog komen gaan.” Meer informatie Heb je vragen over Royeren 5.0 of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor iedereen klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:04:49Z",
  "source": "ech.nl"
}