{
  "id": "e306d846117d763a83a502c0fe032c2b0cdadf93",
  "url": "https://www.ech.nl/rabobank-sluit-per-13-december-aan-op-ech-4-0/",
  "title": "Rabobank sluit per 13 december aan op ECH 4.0 - ECH",
  "text": "Rabobank sluit per 13 december aan op ECH 4.0 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Rabobank sluit per 13 december aan op ECH 4.0 / Nieuws / Door Ruby Vanaf donderdag 13 december werkt service centrum financieren (scf) van de Rabobank met ECH versie 4.0. Met deze versie ondertekent u digitaal de hypotheekakte en notarisverklaring, vervalt het versturen van documenten per post en is de rappellering vereenvoudigd in het proces passeren – vestigen hypotheek. Via uw softwareleverancier bent of wordt u geïnformeerd over nieuwe of gewijzigde functies. Voor het aanleveren van een hypotheekakte en inschrijfgegevens vragen wij uw aandacht: Als notaris maak ik al gebruik van ECH 4.0? Dan biedt u de hypotheekakte inclusief notarisverklaring digitaal ter ondertekening aan via het bericht ‘passeerbevestiging’. Hiermee komt de door scf gehanteerde werkwijze voor het versturen van deze documenten per post te vervallen. Ontvangt scf het bericht ‘passeerbevestiging’ niet op tijd? Dan ontvangt u van ons, zoals u nu ook al gewend bent, een rappelbericht met het verzoek de getekende hypotheekakte inclusief notarisverklaring en inschrijfgegevens via ECH in te sturen. Dit rappelbericht is naar aanleiding van ECH 4.0 vereenvoudigd. Als notaris maak ik nog gebruik van ECH 3.1? Dan verstuurt u deze documenten gewoon per post naar het scf. Aangezien scf geen digitaal aangeleverde hypotheekakte inclusief notarisverklaring kan verwerken. Daarnaast heeft Rabobank het rappelbericht voor het ontbreken van een getekende hypotheekakte inclusief notarisverklaring en inschrijfgegevens aangepast. In het gewijzigde bericht staat dat u deze documenten moet aanleveren via ECH. Zolang u nog geen gebruik maakt van ECH 4.0 verstuurt u deze documenten per post naar het scf. Ons postadres is: Rabobank nederland Service centrum financieren, team zekerheden Postbus 221 5600 ma eindhoven Aandachtspunt inschrijfgegevens: Regelmatig constateert het scf dat ontvangen inschrijfgegevens (datum/deel/nummer) in het bericht ‘passeerbevestiging’ niet juist zijn. Wij vragen u digitaal de inschrijfgegevens juist aan te leveren, zodat de uitvoering van het toekomstig royeerproces geen problemen oplevert. Vragen? Heeft u vragen over het werken met ECH 4.0? Raadpleeg dan het overzicht veelgestelde vragen op de website van ECH. Voor inhoudelijke vragen over een zaak kunt u contact opnemen met de Rabobank via telefoonnummer 088-7288728. Het nummer is bereikbaar op werkdagen tussen 10.00 uur en 12.00 uur en van 14.00 uur tot 16.00 uur. Voor vragen over het gebruik van ECH vanuit uw softwarepakket kunt u contact opnemen met de servicedesk van uw eigen leverancier. Voor vragen over het gebruik van de ECH applicatie op notarisnet en tECHnische vragen kunt u contact opnemen met de servicedesk van ECH via het telefoonnummer 070 330 71 35 of via servicedesk@KNB.nl. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:30:28Z",
  "source": "ech.nl"
}