{
  "id": "ea313cf91c8056cad07debeb8085b4f173c42570",
  "url": "https://www.ech.nl/ech-en-topicus-digtitaliseren-bankgaranties/",
  "title": "Digitalisering bankgaranties - ECH",
  "text": "Digitalisering bankgaranties - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Digitalisering bankgaranties / Hypotheekmarkt , livegang , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat , Wijzigingen / Door echadmin Bankgarantie gedigitaliseerd: ECH en Topicus maken het mogelijk Wie ooit een huis kocht, weet het: de bankgarantie is zo’n formaliteit die vooral als administratieve last wordt ervaren. Toch is het document een belangrijk onderdeel bij de aankoop van een woning en het aanvragen van een hypothecaire financiering. Voor notarissen, banken en klanten was het jarenlang een handmatig, nogal tijdrovend en soms wat frustrerend proces. Tot nu. Want dankzij een intensieve samenwerking tussen Stichting ECH en Topicus kunnen hypotheekverstrekkers de bankgarantie nu digitaal regelen: veilig, snel én foutloos. “Met één druk op de knop is de bankgarantie bij de notaris,” vertelt Jacqueline van het Erve, Senior Product Owner bij Topicus. “Dat klinkt simpel, maar daar ging een krachtige samenwerking aan vooraf.” Jacqueline van het Erve en Clyde in ’t Zand, Product Owners bij Topicus. Topicus: slimme software voor elk life event Topicus ontwikkelt software die impact maakt op alle belangrijke momenten in een mensenleven: van geboorte tot overlijden. De divisie Finance richt zich op hypotheken, zakelijke financieringen en pensioenen. Samen met ECH, belangrijke ketenregisseur in de hypothecaire markt, werkt Topicus aan de digitalisering van cruciale processen. “We werken al jaren met ECH voor het passeren en royeren van hypotheken,” legt Jacqueline uit. “Die relatie is de afgelopen jaren steeds intensiever geworden. We spreken elkaar regelmatig en werken samen aan innovaties voor de hele keten.” Van papierwerk naar platform De introductie van digitale bankgaranties is zo’n innovatie. Voorheen gingen bankgaranties per post. Nu is er in de applicatie van Topicus een button: ‘genereer bankgarantie’. Daarmee wordt de bankgarantie direct via ECH naar de notaris gestuurd. In één handeling wordt daarmee een proces afgerond dat voorheen bestond uit meerdere stappen, handmatige controles en veel schakelmomenten tussen verschillende partijen. “Voorheen had je te maken met stapels papieren, telefoontjes van notarissen die vroegen waar een document bleef, of stukken die ergens in de post waren blijven hangen,” vult Clyde ’t Zand, eveneens Product Owner bij Topicus, aan. “Nu is het met een druk op de knop geregeld.” Volgens Jacqueline is de uniforme werkwijze ook een belangrijk voordeel voor het notariaat: “Voorheen werkte elke bank met een eigen format voor de bankgarantie. Dat betekende dat notarissen steeds opnieuw moesten kijken wat er precies bedoeld werd of hoe een bepaald document gelezen moest worden. Nu ontvangen ze vanuit iedere aangesloten bank hetzelfde format. Dat is overzichtelijker, scheelt tijd en voorkomt ruis of misverstanden.” De voordelen voor iedere schakel De digitalisering van de bankgarantie raakt de hele keten. Niet alleen notarissen en banken profiteren van het gemak, ook consumenten én de sector als geheel merken het verschil. Wat levert het precies op? Voor notarissen : uniformiteit, minder fouten, sneller werken. Voor banken : minder handwerk, minder risico, meer grip. Voor consumenten : rust in het koopproces, minder onzekerheid. Voor de keten : veilige gegevensuitwisseling, minder datarisico’s, betere compliance. Clyde: “Voor kopers is het hypotheekproces al spannend genoeg. Iedere stap die je daarin automatiseert, vereenvoudigt en versnelt, draagt bij aan meer rust en vertrouwen.” Ook het gegeven dat de bankgaranties nu veilig en centraal via ECH beschikbaar zijn, levert winst op. “Vroeger werden bankgaranties nog fysiek verwerkt. Documenten gingen van afdeling naar afdeling, en vervolgens met de post naar de notaris. Dan kon het zomaar gebeuren dat een bankgarantie ergens bleef hangen of zelfs kwijtraakte,” vertelt Jacqueline. “Nu is alles terug te vinden op één centrale plek. Dat is niet alleen praktisch, maar ook veiliger, want je vermindert risico’s op datalekken of fouten.” Warme verstandhouding De samenwerking tussen ECH en Topicus gaat overigens een stuk verder dan techniek. “We vinden elkaar gemakkelijk. De collega’s van functioneel beheer, development, product owners: iedereen kan snel schakelen,” zegt Jacqueline. “Dat werkt, zeker omdat we elkaar kennen uit de sector. Je spreekt dezelfde taal.” Clyde benadrukt hoe belangrijk het is dat beide partijen elkaar goed begrijpen: “De hypotheekwereld is complex. Het helpt als je samenwerkt met mensen die uit het veld komen. Daardoor kun je sneller schakelen en elkaars uitdagingen beter plaatsen.” Ook de gezamenlijke testaanpak leverde waardevolle inzichten op. “Doordat we testten met productie-lijkende data, kwamen we scenario’s tegen die je in gescripte tests soms mist,” aldus Clyde. “ECH stond open voor aanpassingen, wat de kwaliteit ten goede kwam.” Blijven verbeteren De eerste livegangen bij ING en Rabobank zijn inmiddels gerealiseerd, en die van de Volksbank volgt spoedig. Maar de ontwikkeling staat niet stil. Clyde: “We willen het proces nog gebruiksvriendelijker maken. Bijvoorbeeld door foutmeldingen in de applicatie te versimpelen. Gebruikers moeten direct begrijpen wat ze kunnen doen.” Jacqueline vult aan: “We sturen continu op procesoptimalisatie. De samenwerking met ECH is daarin essentieel. Door korte lijnen kunnen we snel bijsturen en verbeteren.” Impact, korte lijnen, vertrouwen Als Jacqueline de samenwerking in drie woorden moet vatten, zegt ze: impact, korte lijnen en een warme verstandhouding. Clyde voegt toe: “En pragmatisme. Je merkt dat iedereen gericht is op een werkende oplossing. Geen overbodige complexiteit.” “Digitalisering werkt alleen als je elkaar vindt en begrijpt,” besluit Jacqueline. “En dat is, naast de inhoud, precies wat deze samenwerking zo sterk maakt.” Meer informatie Wil je meer weten over bankgaranties of heb je algemene vragen over (aansluiten op) ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:23:12Z",
  "source": "ech.nl"
}