{
  "id": "ea3ee471f65709960749197043ae913db4d21c2a",
  "url": "https://www.ech.nl/crisis/",
  "title": "Crisispagina - ECH",
  "text": "Crisispagina - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Crisispagina ECH Status Er is op dit moment geen incident. Noodprocedures In geval van een incident waarbij het ECH-platform langere tijd onbeschikbaar is zullen notarissen en hypothecair financiers via alternatieve kanalen moeten afstemmen over hypotheekdossiers. Voor lopende dossiers geldt dat contactpersonen en telefoonnummers opgenomen zijn in het ECH-dossier onder de rubriek ‘contactgegevens’. Voor (nieuwe) spoedverzoeken heeft ECH templates opgesteld die notariskantoren tijdelijk kunnen gebruiken: – Verzoek royement & royementsvolmacht Contactgegevens hypothecair financiers De op ECH aangesloten hypothecar financiers / serviceorganisaties kunnen op de volgende manier worden bereikt: Naam Passeren Royeren Aegon e-mail 058 244 3400 e-mail 058 244 3400 BCMGlobal* Passeren Royeren de Volksbank** Passeren Royeren ING Bank Passeren Royeren Ingage Servicing*** Passeren Royeren Nationale-Nederlanden Passeren Royeren Rabobank Passeren Royeren RNHB Passeren Royeren Quion**** Passeren Royeren * BCMGlobal : Brug Financieringen, Build, Casarion, Dutch Commercial Mortgage Finance, De Nederlandse, NESTR, SolidBriQ. ** de Volksbank : BLG Wonen, SNS Bank, RegioBank, ASN Bank. *** Ingage Servicing : Merius Hypotheken, Impact Hypotheken. **** Quion : Allianz, Argenta, Attens Hypotheken, Centraal Beheer, Clarian Wonen, HollandWoont, Hypotrust, IQWOON, Robuust Hypotheken, Syntrus Achmea, Tellius Hypotheken, Vista Hypotheken, Vitru, Woonfonds, Woonnu. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T03:57:19Z",
  "source": "ech.nl"
}