{
  "id": "ea4000317042f05f1a07953f9b47e9160bbd7918",
  "url": "https://www.ech.nl/ech-de-communicatiestandaard-voor-bcm-global/",
  "title": "‘ECH is voor ons dé communicatiestandaard’, Carin Pronk, Product Owner BCM Global  - ECH",
  "text": "‘ECH is voor ons dé communicatiestandaard’, Carin Pronk, Product Owner BCM Global  - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘ECH is voor ons dé communicatiestandaard’, Carin Pronk, Product Owner BCM Global / Bestuur , Directie ECH , ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door masselbergs@ech.nl ‘Wij geloven in de kracht van best practices en daarom nemen we het passeerproces af bij ECH. Ik ben vanuit mijn rol verantwoordelijk voor de IT-zijde van ons servicing platform. Dat betekent dat mijn ervaring met ECH zich vooral richt op de techniek en dan specifiek op het aansluiten van nieuwe klanten. Binnen deze onboarding maken we afspraken over het automatiseren van het totale hypothekenproces.’ Aan het woord is Carin Pronk, Product Owner bij BCMGlobal, een toonaangevende Europese onafhankelijke dienstverlener op het gebied van krediet- en vermogensbeheer. ECH neemt stress weg Collega Mariska Vernooij, Proces Manager bij het bedrijf vult aan: ‘We zijn sinds medio 2019 aangesloten op het ECH-platform voor het proces rondom het vestigen van een hypotheek. Die aansluiting helpt ons bij het beheren van hypotheekportefeuilles van een behoorlijk aantal hypothecair financiers. Ik heb vooral ervaring met ECH vanuit de operationele kant. Er was een tijd waarin we nog niet met ECH werkten. Je kunt je dus voorstellen hoe blij ik ben dat dit platform bestaat. In de maanden dat we het zelf deden maakten we handmatig de passeeropdrachten op, verstuurden deze naar de betrokken notaris, voerden we handmatig notaris en rekeningnummers op ten behoeve van uitbetaling et cetera. Kortom, we weten als geen ánder hoe groot de toegevoegde waarde is, want het neemt veel tijdrovende taken, een verhoogde foutgevoeligheid, risico’s, alles driedúbbel checken en daarmee stress weg. Samenvattend kan ik stellen dat de periode zonder ECH enorm intensief was. Bovendien werkt het systeem heel soepel, stabiel en heel eenvoudig. Dat is goud waard. Wanneer iets onverhoopt niet goed verloopt dan ontvangen zowel wij als de notaris duidelijke meldingen zodat we weer verder kunnen. Ik ervaar de totale ondersteuning in het passeerproces, zowel qua acties en taken alsmede de veiligheid die het biedt in betaalstromen, als uitmuntend. Het geeft veel rust en vertrouwen.’ Mariska Vernooij (l) en Carin Pronk (r) Onboardingsproces via ECH voelt zorgeloos Carin: ‘Ik kan niet anders dan zeggen dat het inderdaad erg soepel en plezierig verloopt tijdens het onboarden van nieuwe labels. Wanneer ik een mailtje stuur krijg ik direct reactie, bijvoorbeeld bij het voorleggen van de concept-modelakte. Of wanneer er sprake is van een maatwerkinstructie die bij een bepaalde modelakte hoort, dan krijg ik snel antwoord op mijn vragen. Het is bijzonder fijn samenwerken. De mensen van ECH zijn zonder uitzondering professioneel, hulpvaardig, praktisch en lekker snel. En daarnaast zijn de mensen gewoon heel vriendelijk en dat maakt het werken met ze plezierig. Hun professionaliteit blijkt uit de antwoorden die ze geven, want ze weten tot in detail waar ze mee bezig zijn. Samenvattend durf ik te stellen dat het gedeelte via ECH één van de minste zorgen geeft in het totale onboardingsproces van een nieuwe klant. Het is zeker niet ondenkbaar dat we in de toekomst meer processen via ECH laten verlopen.’ ECH luistert en is klantgericht Mariska: ‘Ik sluit me aan bij Carin en wil graag toevoegen dat ECH enorm klantgericht is. Er wordt écht naar je geluisterd en daar waar mogelijk actief gewerkt aan het oplossen van zaken die door ons, en anderen uit de markt, aangegeven worden. Ook ontwikkelen ze hun product continu door en stellen ze zich heel flexibel en open op. Zo hebben we (en ook andere partijen in de markt) grote behoefte aan een oplossing die ondersteunt bij het controleren van aktes. ECH is, als antwoord daarop, bezig met het onderzoeken van een gerichte oplossing die deze aktecontroles voor ons kan versimpelen of zelfs kan gaan uitvoeren. Het staat nog in de kinderschoenen, en hoe het vorm krijgt weten we nog niet, maar dat het goed komt wel. Dat zijn hele gave dingen die ons serieus vooruithelpen.’ Carin: ‘Wat mij betreft is ECH dé communicatiestandaard waardoor de zaken veel efficiënter verlopen. Uiteindelijk gaat het erom dat je je onderscheidt op de punten waarin je het verschil kunt maken. Binnen BCMGlobal geeft daar invulling aan middels customer intimacy wat wil zeggen dat je de klant van A tot Z helpt en zoveel mogelijk ontzorgt. Soms betekent dat het leveren van maatwerk. Dáár liggen de kansen om je te onderscheiden. En een passeerproces bij de notaris is niet iets dat zich hiervoor leent. Daarin zul je je niet onderscheiden, juist omdat het een zo gestandaardiseerd proces is. Wanneer dit eenmaal goed is ingeregeld zul je op dat vlak niet sneller of beter zijn dan een ander. Daarom is ECH ook zo perfect: het platform doet precies wat het doen moet. Altijd, overal en zonder problemen. Met ECH stáát die basis.’ ‘Precies’, zegt Mariska’, ‘het proces van ECH hoeft niet fancy te zijn, als het maar gewoon werkt. En dat doet het.’ Meer informatie Wil je meer weten over de visie van Mariska en Carin of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:23:07Z",
  "source": "ech.nl"
}