{
  "id": "ecc84caf0d897ec626f6673bb5dcad0813d24db2",
  "url": "https://www.ech.nl/rabobank-tijdslijnen-rondom-feestdagen/",
  "title": "Rabobank: Tijdslijnen rondom feestdagen - ECH",
  "text": "Rabobank: Tijdslijnen rondom feestdagen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Rabobank: Tijdslijnen rondom feestdagen / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Faheem Malhi Inleiding Rabobank hanteert rondom de komende feestdagen de reguliere aanlevertermijnen voor passeren en royeren. Om te waarborgen dat alle zaken tijdig kunnen worden verwerkt, vragen we nadrukkelijk om zaken waarvan de (passeer)datum bekend is zo snel mogelijk door te geven. Op die manier kunnen de werkzaamheden zo goed mogelijk gepland worden zodat zaken met een kortere doorlooptijd ook tijdig kunnen worden afgewikkeld. Om alle verzoeken tijdig af te kunnen wikkelen, wordt zéér terughoudend om gegaan met het in behandeling nemen van spoeddossiers. Tijdslijnen Royeren Royementsverzoeken dienen, conform de reguliere termijn, ten minste 15 werkdagen voor royementsdatum te worden doorgegeven. Op een aantal feestdagen is Rabobank gesloten, hier moet rekening mee worden gehouden bij het tijdig aanleveren van de verzoeken. Hieronder staan voorbeelden waarin rekening is gehouden met de feestdagen waarop de Rabobank gesloten is (1e en 2e Paasdag, Koningsdag, Hemelvaartsdag, 1e en 2e Pinksterdag): Stuurt de notaris het royementsverzoek met aflosdatum dinsdag 2 april? Dan moet het verzoek uiterlijk maandag 11 maart bij ons binnen zijn; Stuurt de notaris het royementsverzoek met aflosdatum woensdag 22 mei? Dan moet het verzoek uiterlijk maandag 29 april bij ons binnen zijn; Indien u onderstaande bericht ontvangt via ECH naar aanleiding van een aangeleverd royementsverzoek, dan is er sprake van een zakelijk royement: “Het verzoek betreft een zakelijk royement en wordt verder op papier afgehandeld. Voor meer informatie kunt u contact opnemen met ons zakelijk team Klantenservice op telefoonnummer 088 722 6666” . Voor zakelijke royementsdossiers wordt het ECH dossier gesloten en vindt de verdere afhandeling van het royement niet via ECH plaats. U ontvangt van de afdeling Bedrijven een aflosnota of een brief waarin royement om niet verleend wordt. Tijdslijnen passeren Passeerverzoeken dienen ten minste 2 werkdagen voor passeren te worden doorgegeven: In verband met Goede Vrijdag/Pasen: Passeert de klant op dinsdag 2 april? Dan dient de notaris uiterlijk woensdag 27 maart 12:00 uur de passeerdatum door te geven. Passeert de klant op woensdag 3 april? Dan dient de notaris uiterlijk donderdag 28 maart 12:00 uur de passeerdatum door te geven. In verband met Koningsdag/Dag van de Arbeid: Passeert de klant op donderdag 2 mei? Dan dient de notaris uiterlijk maandag 29 april 12:00 uur de passeerdatum door te geven. Passeert de klant op vrijdag 3 mei? Dan dient de notaris uiterlijk dinsdag 30 april 12:00 uur de passeerdatum door te geven. In verband met Hemelvaart: Passeert de klant maandag 13 mei? Dan dient de notaris uiterlijk woensdag 8 mei 12:00 uur de passeerdatum door te geven. In verband met 2 e Pinksterdag: Passeert de klant dinsdag 21 mei? Dan dient de notaris uiterlijk donderdag 16 mei 12:00 uur de passeerdatum door te geven. Passeert de klant woensdag 22 mei? Dan dient de notaris uiterlijk vrijdag 17 mei 12:00 uur de passeerdatum door te geven. Bereikbaarheid Service Centrum Wonen Het Service Centrum Wonen is op Goede Vrijdag (vrijdag 29 maart) en Dag van de Arbeid (woensdag 1 mei) regulier bereikbaar. Op alle andere feestdagen zijn wij gesloten. Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:07:52Z",
  "source": "ech.nl"
}