{
  "id": "ed0f3e87161220a83e4ad00c306c2928edd03e66",
  "url": "https://www.ech.nl/passeerproces-quion-efficienter-en-eenduidiger/",
  "title": "Passeerproces Quion efficiënter en eenduidiger - ECH",
  "text": "Passeerproces Quion efficiënter en eenduidiger - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Passeerproces Quion efficiënter en eenduidiger / Nieuws / Door echadmin Serviceorganisatie Quion sluit binnenkort aan op het passeerproces van Stichting Elektronische Communicatie Hypotheken (ECH). De klanten van Quion zullen gefaseerd live gaan. Op 24 maart 2020 werd Quion succesvol gecertificeerd voor het ECH passeerproces. Quion zet hiermee een mooie stap richting een meer efficiënt proces. Begin tweede kwartaal van 2020 zal Quion naar verwachting van start gaan met het eerste hypotheeklabel Allianz. Quion zal in eerste instantie aansluiten voor wat betreft het vestigen van hypotheken. Later zullen zij ook aansluiten op ECH met het royementenproces. Communicatie met het notariaat middels de berichtenstandaard van ECH is niet alleen sneller en kwalitatief hoogwaardiger, maar vooral ook veiliger. ECH zet zich in voor een volledig digitale, uniforme en betrouwbare samenwerking tussen het notariaat en de hypothecair financiers. Vanuit ECH wordt continu gewerkt aan een verbetering van de processen en het voldoen aan de Europese wet- en regelgeving op het gebied van veiligheid en privacy. Door de samenwerking tussen ECH en Quion profiteert de klant uiteindelijk ook van al deze voordelen. John Smulders, Chief Operating Officer bij Quion geeft het volgende aan over de samenwerking met Stichting ECH: “ In het verlengde van de ambitie van Quion om een nieuwe norm in servicing neer te zetten, zijn het vol inzetten op customer expericience, verdere digitalisatie en het STP maken van processen belangrijke speerpunten voor ons. Daarbij hanteren we de klantreis en een en end tot end ketenbenadering als vertrekpunt. Door gebruik te gaan maken van de digitale ECH berichten worden de processen passeren en aflossen optimaal ondersteund en maken we een belangrijke kwaliteitsslag op die onderdelen van de keten. Daarmee levert de keuze voor ECH een prima bijdrage aan onze doelstelling een uitstekend klantproduct (sneller, efficiënter met minimalisatie van fouten) neer te zetten met een dito klantbeleving .” Lisa Huisman, Directeur Stichting ECH, is blij met de aansluiting: “ We zijn er trots op Quion te mogen verwelkomen bij ECH. Deze samenwerking helpt ons om samen een flinke stap voorwaarts te zetten, kortom een geweldige mijlpaal voor Quion en Stichting ECH! ” Meer informatie Voor het notariaat worden notarisinstructies opgesteld die nog worden gepubliceerd op de website van ECH. Bij vragen over dit nieuwsbericht kunnen notariskantoren zich wenden tot de Servicedesk van Stichting ECH . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:27:35Z",
  "source": "ech.nl"
}