{
  "id": "eede758c4188f26fc619a76a0a4cf220c3a88eff",
  "url": "https://www.ech.nl/rabobank-tijdslijnen-rondom-feestdagen-2023-2/",
  "title": "Rabobank: Tijdslijnen rondom feestdagen - ECH",
  "text": "Rabobank: Tijdslijnen rondom feestdagen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Rabobank: Tijdslijnen rondom feestdagen / Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot Inleiding Rabobank hanteert rondom de komende feestdagen de reguliere aanlevertermijnen voor passeren en royeren. Om te waarborgen dat alle zaken tijdig kunnen worden verwerkt, vragen we nadrukkelijk om zaken waarvan de (passeer)datum bekend is zo snel mogelijk door te geven. Op die manier kunnen de werkzaamheden zo goed mogelijk gepland worden zodat zaken met een kortere doorlooptijd ook tijdig kunnen worden afgewikkeld. Om dit jaar nog alle verzoeken tijdig af te kunnen wikkelen, wordt zéér terughoudend om gegaan met het in behandeling nemen van spoeddossiers. Tijdslijnen Royeren Royementsverzoeken dienen, conform de reguliere termijn, ten minste 15 werkdagen voor royementsdatum te worden doorgegeven: Stuurt de notaris het royementsverzoek met aflosdatum vrijdag 29 december? Dan moet het verzoek uiterlijk woensdag 6 december bij ons binnen zijn; Stuurt de notaris het royementsverzoek op of na donderdag 7 december? Dan kan niet eerder dan in 2024 worden geroyeerd. Is sprake van een lening met een opbouwproduct? En wordt dit opbouwproduct afgelost op de lening? Om de aflossing van het opbouwproduct op de lening in 2023 te garanderen, gelden de volgende termijnen: Banksparen (Rabo OpbouwSpaarrekening): Royementsdatum is uiterlijk woensdag 13 december om de aflossing met de afkoop van het opbouwproduct dit jaar nog te garanderen. Het royementsverzoek dient dan uiterlijk woensdag 22 november bij ons binnen te zijn. Verzekerde producten (Interpolis opbouwproducten): Royementsdatum is uiterlijk vrijdag 1 december om de aflossing met de afkoop van het opbouwproduct dit jaar nog te garanderen. Het royementsverzoek dient dan uiterlijk vrijdag 10 november bij ons binnen te zijn. Tijdslijnen passeren Passeerverzoeken dienen ten minste 2 werkdagen voor passeren te worden doorgegeven: Passeert de klant op vrijdag 22 december? Dan dient de notaris uiterlijk woensdag 20 december 12:00 uur de passeerdatum door te geven. Passeert de klant op woensdag 27 december? Dan dient de notaris uiterlijk donderdag 21 december 12:00 uur de passeerdatum door te geven. Passeert de klant op donderdag 28 december? Dan dient de notaris uiterlijk donderdag 22 december 12:00 uur de passeerdatum door te geven. Passeert de klant op vrijdag 29 december? Dan dient de notaris uiterlijk woensdag 27 december 12:00 uur de passeerdatum door te geven. Passeert de klant op dinsdag 2 januari? Dan dient de notaris uiterlijk donderdag 28 december 12:00 uur de passeerdatum door te geven. Passeert de klant op woensdag 3 januari? Dan dient de notaris uiterlijk vrijdag 29 december 12:00 uur de passeerdatum door te geven. Bereikbaarheid Service Centrum Wonen SCW is op vrijdag 22 december en vrijdag 29 december gedurende de reguliere openingstijden bereikbaar. Meer informatie Voor vragen of andere informatie aangaande dit artikel kan contact met Rabobank Service Centrum Wonen op de gebruikelijk wijze worden opgenomen of anders met ECH via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:10:30Z",
  "source": "ech.nl"
}