{
  "id": "f15de075ec1a87ab3b4bd95f2cff0894896fa113",
  "url": "https://www.ech.nl/bestuur-aan-het-woord-ed-engelen/",
  "title": "Bestuur aan het woord - Ed Engelen - ECH",
  "text": "Bestuur aan het woord - Ed Engelen - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Bestuur aan het woord – Ed Engelen / Bestuur , Directie ECH , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door Raymond Bloot Ed Engelen, notaris in Drenthe en bestuursvoorzitter van ECH vertelt over zijn kijk op ECH, zijn kantoor, mooie gezin én zijn prijswinnende schapen ‘Traditioneel is het zo dat er vanuit de KNB mensen zitting hebben in het bestuur van ECH. Het is vanuit die hoek dat ik bestuurslid ben geworden, samen met collega Bernadette Verberne . En met veel plezier overigens, want ik vind het niet alleen een mooie job, maar ook belangrijk om een wezenlijke bijdrage te leveren. Uiteraard deed ik dat niet meteen vanuit mijn huidige hoedanigheid als voorzitter; ik heb eerst nog een periode meegelopen om alle ins en outs te leren kennen.’ Aan het woord is Ed Engelen , notaris bij notariaat Engelen, penningmeester bij de KNB én sinds december 2020 bestuursvoorzitter van stichting ECH. ‘Na een aanlooptijd die zich kenmerkte door uitdagingen is de stichting inmiddels de jongvolwassen periode voorbij en durf ik te zeggen dat het een bijzonder serieus bedrijf geworden is.’ Ed Engelen, bestuursvoorzitter ECH en notaris bij Notariaat Engelen De verantwoordelijkheid van de bestuurder ‘Als bestuurder ben je verantwoordelijk voor de algemene gang van zaken, zowel in de overleggen als door taken buiten de algemene bestuursvergaderingen. Maar eigenlijk voel ik me vooral een sparringpartner voor de betrokkenen, ook voor de directie. Zo is de informele manier waarop ik met directeur Lisa Huisman en de rest van het bestuur kan samenwerken erg prettig. Bovendien zijn we een relatief klein bestuur waardoor het gemoedelijk gaat allemaal. We werken goed met elkaar samen en zijn as we speak bezig om de organisatiestructuur nog wat steviger neer te zetten. Dit betekent dat we taken meer gaan afbakenen, waarbij iedereen verantwoordelijkheid draagt voor zijn of haar portefeuille. Uiteraard blijft de organische manier van samenwerken wel gewoon bestaan’, aldus Ed. Persoonlijk, rustig en in een sfeer van vertrouwen ‘En die manier van samenwerken sluit naadloos aan bij wie ik als mens ben. Niet voor niets ben ik notaris van een relatief klein kantoor. Vanuit onze vestigingen in Beilen en Smilde werken we op eenzelfde manier met onze cliënten samen: persoonlijk, rustig en in een sfeer die vertrouwen wekt. We staan, figuurlijk gezien, met onze voeten stevig in de klei. En dat kleinschalige, nauw met elkaar samenwerken, past goed bij me. Daarin kom ik het best tot mijn recht. Bovendien denk ik dat je, wanneer je in een groot kantoor met meer dan tien notarissen die zich met transactiewaardes van meerdere miljoenen bezighouden, meer afstand tot je cliënt hebt. En dat is niet wat mij gelukkig maakt. Ik heb, na het afronden van mijn studie aan de Radboud Universiteit in 1992, op verschillende soorten notariskantoren gewerkt. Die ervaring heb ik meegenomen in hoe ik mijn kantoor vorm wilde geven’, aldus Ed. ‘Binnen ons notariaat zijn de lijnen kort: als er bijvoorbeeld een vraag is over werken met ECH, dan lopen medewerkers gemakkelijk bij me binnen. Zelf werk ik vanuit mijn rol niet direct meer in de systemen van ECH, maar ik ben wel het eerste aanspreekpunt als er vragen zijn.’ “Dat is het type zelfvertrouwen dat er binnen de stichting heerst, in combinatie met een gezonde dosis nieuwsgierigheid”, vertelt Ed Engelen ECH onmisbaar voor notariaat in Nederland ‘Mijn werk voor ECH vind ik waardevol omdat het bestaan van deze stichting onmisbaar is voor het grootste gedeelte van de notarissen in Nederland. Het maakt ons werk immers veel eenvoudiger, gestroomlijnder én veiliger. Vooral dat laatste onderwerp, (cyber)security, is iets dat we niet moeten onderschatten met elkaar. We kunnen in Nederland immers bijna blindvaren op de dienstverlening van ECH. In de markt heerst de sfeer van ‘als het van ECH komt dan is het goed’. Dat heeft ook te maken met het PEC-platform dat de stichting gebruikt. PEC, dat voluit staat voor Platform Elektronische Communicatie, staat bekend om de kwaliteit. Het notariaat stelt dit platform beschikbaar aan ECH. In die zin is de samenwerking wel echt een symbiose, want beide partijen hebben belang bij het in stand houden ervan.’ Trots op ontwikkeling ‘Persoonlijk ben ik trots op de ontwikkeling die we binnen de stichting aan het doormaken zijn. En dan met name op het proces en de wijze waarop dat verloopt. Er heerst een bepaalde dynamiek en een harmonie van waaruit we de organisatie nog verder verzelfstandigen. Daar zijn we druk mee bezig, zowel in ons hoofd als in ons hart. Maar we zijn er nog niet! Wel hebben we allemaal dezelfde stip op de horizon, samen gaan we dezelfde richting uit. Het hele traject waar we met elkaar inzitten doet me weleens denken aan de uitspraak van Pippi Langkous die zegt: ‘Ik heb het nog nooit gedaan, dus ik denk dat ik het wel kan.’ Dat is het type zelfvertrouwen dat er binnen de stichting heerst, in combinatie met een gezonde dosis nieuwsgierigheid’, vertelt Ed. De komende periode op de agenda ‘Voor de komende periode staan er weer verschillende belangrijke thema’s op de agenda. Eén daarvan is het in de markt zetten van nieuwe diensten, waarbij we vooral kijken naar welk probleem we voor onze doelgroep oplossen. Dat is overigens steeds het uitgangspunt bij de uitbreiding van onze werkzaamheden. Tegelijkertijd zijn we er ook heel voorzichtig mee, want het afbreukrisico is groot. Vanuit de KNB zeggen we dat onderling wel eens: we hebben bijna 200 jaar vertrouwen opgebouwd en dat kun je maar 1 x verkopen. Dat is bij ECH ook zo. Persoonlijk heb ik de droom dat ECH op een gegeven moment voor het complete vastgoedverkeer de communicatie gaat verzorgen. Dat is geen doel op zich maar ik denk wel dat heel mooi past in de ontwikkelingen waar we voor staan. Zoals ik het zie is de stichting, daar waar het de consument betreft, onderdeel van het fundament van de rechtszekerheid. En vanuit die oorsprong, die gedachte eigenlijk, bouwt de KNB ook graag mee aan deze samenwerking. De aanwezigheid van ECH is soms bijna een abstract gegeven: je merkt het niet als het er is, maar zodra ECH er niet meer zou zijn mis je het direct. Verder is binnen het notariaat nu de ontwikkeling van de digitale notariële akte een belangrijk thema. Dat heeft natuurlijk te maken met de verregaande digitalisering binnen onze maatschappij. Het is een mooi, maar uitdagend project, mede omdat er met digitale handtekeningen gewerkt wordt. Dat vraagt om veel kennis en kunde om alles in goede banen te leiden, want je kunt met dit soort formele documenten uiteraard niet zorgvuldig genoeg zijn.’ Gezin als belangrijkste factor ‘Naast mijn rol als notaris ben ik veel met mijn gezin bezig. Meer dan ooit eigenlijk. In het verleden richtte ik me behoorlijk fanatiek op het fokken van schapen. Daar ben ik zo’n 13 jaar geleden mee begonnen en ik heb ook verschillende kampioenschappen gewonnen. Dat was een mooie tijd, maar ik merkte op gegeven moment ook wel dat ik veel van het gezinsleven miste. Want het hooien, voeren en alle andere zorg slokte veel van mijn tijd op. Op een gegeven moment heb ik de knop omgezet. Tegenwoordig vind je me in de weekenden vooral in sporthallen om de wedstrijden van mijn dochters te bekijken. Dat is eigenlijk zo’n beetje mijn eigen hobby geworden. Het rijden naar sportwedstrijden, het meegaan naar de trainingen en eigenlijk de hele beleving er omheen vind ik fantastisch om mee te mogen maken. Eén van mijn dochters speelt volleybal op hoog niveau, en het is bijzonder om daar onderdeel van te mogen zijn. Het past helemaal in de manier waarop mijn vrouw en ik graag willen leven. We zijn in 2000 heel bewust naar het noorden van het land getrokken en ervaren elke dag hoe mooi de kwaliteit van leven is, hier in het rustige Drenthe. En dat gevoel van vrijheid, juist in deze onstuimige tijd, gun ik iedereen.’ Meer informatie Voor vragen of andere informatie over ECH kan contact worden opgenomen via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-26T03:56:39Z",
  "source": "ech.nl"
}