{
  "id": "f166e55a90acb62113672a5a20303f2dc1398057",
  "url": "https://www.ech.nl/notarissen/casarion/",
  "title": "Casarion - ECH",
  "text": "Casarion - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Onderdeel van: Casarion Proces: Passeren E-mail: hypotheek@casarion.com Telefoon: 088-422 9142 01 Nieuwsberichten 02 Passeren 03 Royeren Deelnemersinfo Casarion Algemene informatie/nieuwsberichten (kort) Verhuurhypotheken voor professionals De Verhuurhypotheek van Casarion is er voor kleine en middelgrote professionele marktpartijen die beleggen in woningen om die op commerciële basis te verhuren. Bij Casarion kunt u terecht voor iedere nieuwe investering in residentieel vastgoed, maar ook voor de (her)financiering van de bestaande woningenportefeuille. Door onze innovatieve aanpak zijn we instaat om snel een oplossing op maat te bieden. De Casarion Verhuurhypotheek is een helder en transparant financieel product zonder gedoe. We houden het graag simpel. Notarisinstructie passeer proces Passeerproces Passeren nieuwe hypotheken Wij maken gebruik van ECH voor het passeren van nieuwe hypotheken. Wanneer de lening finaal akkoord gegeven is, versturen wij u de passeeropdracht via ECH, met daarin de benodigde notarisinstructies. De opgegeven passeerdatum dient minimaal 4 werkdagen voor passeren doorgegeven te worden. Toelichting: Casarion is een handelsnaam van Community hypotheken BV. In voorkomende gevallen is een afsluitvergoeding aan de klant van toepassing. Deze vermelden wij in de passeeropdracht. Wij kunnen de volgende documenttypen ontvangen: pdf. De maximale documentgrootte is 20MB. De sluitnota sturen wij u uiterlijk 2 dagen voor passeren toe, en zoveel eerder als mogelijk is. Wij vragen ons binnen drie dagen ná passeren van de hypotheek de passeerbevestiging een afschrift van de hypotheekakte met voetverklaring inclusief bewijs van inschrijving te verstrekken. Vragen en opmerkingen Uw mening is belangrijk. Heeft u tips, opmerkingen of verbeteringen, laat ons die dan vooral weten via onderstaande contactgegevens. Contact Voor vragen zijn we bereikbaar op telefoonnummer 088-422 9142. U kunt ons bellen van maandag tot en met vrijdag van 8.30 uur tot 17.00 uur. U kunt ook een e-mail sturen naar hypotheek@casarion.com . Notarisinstructie r oyementenproces Royementenproces Opvragen aflosnota Aflosnota’s kunt u opvragen via: hypotheek@casarion.com . Royementen Royementsverzoeken kunt u opvragen via: Hypotheek@casarion.com . Vragen en opmerkingen Uw mening is belangrijk. Heeft u tips, opmerkingen of verbeteringen, laat ons die dan vooral weten via onderstaande contactgegevens. Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:26:06Z",
  "source": "ech.nl"
}