{
  "id": "f3be2b92dc7c4c04875fec0babf572ede5807396",
  "url": "https://www.ech.nl/meet-the-team-gert-jan-bartelds/",
  "title": "Meet the team - Gert-Jan Bartelds - ECH",
  "text": "Meet the team - Gert-Jan Bartelds - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Meet the team – Gert-Jan Bartelds / ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Trots op mijn overstap van de wetenschap naar de IT,’ Gert-Jan Bartelds, sterrenkundige én software engineer in het ontwikkelteam van ECH ‘Al sinds 1997 ben ik in de wereld van IT actief. Al had dat zomaar anders kunnen zijn, want ik heb sterrenkunde gestudeerd aan de Universiteit Utrecht.’ Dat zegt Gert-Jan Bartelds , 53 jaar, getrouwd, woonachtig in Deventer, vader van twee dochters én als software engineer werkzaam bij Avisi. Vanuit die rol is hij een vast teamlid van het ontwikkelteam dat dedicated voor ECH werkt. ‘Al op het vwo was ik een jongen die veel met computers bezig was. Ergens had ik het idee dat ik daar niet mijn werk van wilde maken, want ik wilde mijn hobby niet verpesten’, lacht Gert-Jan. ‘Tijdens mijn studie, gericht op astronomie, kwam het vak programmeren geregeld voorbij. Je kunt je voorstellen dat ik dat met veel plezier deed; ik was er goed in. Maar na mijn studie ontdekte ik dat werken in de wetenschap, in mijn geval, vooral een soloverhaal was. Dat paste niet bij me: ik ben meer een teamplayer. Toen ik van de wetenschap overstapte naar de IT voelde ik me direct als een vis in het water. Vooral omdat ik veel in teamverband kon samenwerken.’ Gert-Jan Bartelds, Software Engineer Van structuur naar actiemodus ‘De ene dag ben ik heel technisch bezig en de andere dag besteed ik meer tijd aan overleg. Het varieert behoorlijk en dat vind ik erg prettig. Net als het verschil in intensiteit: soms moet ik op technisch vlak erg de diepte in, en op een ander moment hang ik wat meer boven de materie. Bijvoorbeeld als ik uit moet zoomen om vanuit klantperspectief te kijken naar een bepaalde situatie zodat ik kan onderzoeken of ik écht begrijp wat iemand bedoelt’, vervolgt Gert-Jan. ‘We plannen steeds voor twee weken vooruit. Onze werkzaamheden komen voort uit doelen die we onszelf stellen, maar ook uit tickets die taken met zich meebrengen. Op zich zijn mijn werkdagen vrij gestructureerd, maar als een klant een probleem heeft, bijvoorbeeld omdat de software niet doet wat er verwacht wordt, dan staan we met ons team direct in de actiemodus. Dan is het soms alle hens aan dek om tot in detail te onderzoeken waar het probleem vandaan komt. Als we het issue dan aan het eind van de dag hebben opgelost, dan geeft me dat veel energie en krijg ik daar een heel goed, positief gevoel van. Uiteraard proberen we het aantal incidenten te minimaliseren, dat spreekt voor zich!’ ‘We are doing the right things, and doing the things right’, zegt Gert-Jan Bartelds Software als een opgeruimde schuur ‘Voor de komende periode staan er weer verschillende zaken op de agenda. Zo zijn we bezig met een nieuwe versie van de processen vestigen en royeren. Deze bestaan al jaren, maar door de continue ontwikkelingen in de markt vragen deze met regelmaat om aanscherping. Software is als een schuur die je op moet ruimen zeg ik weleens. Soms moet je ruimte scheppen, oude zaken wegdoen, schoonmaken en nieuwe zaken toevoegen. En zaken terug op hun plek zetten. Precies zo werkt het met software. Zo willen we intern een en ander nog helderder krijgen en meer structuur aanbrengen’, aldus Gert Jan. ‘Verder willen we binnen onze organisatie onze kennis van softwarearchitectuur naar een nog hoger plan tillen, onder meer door cursussen en certificeringen te doen. Ik ben onderdeel van de hiervoor samengestelde groep en zie dit als een persoonlijk ontwikkeldoel. Want dat vind ik belangrijk: bij blijven door leren en ontwikkelen. Daar ben ik, ook omdat ik geen twintig meer ben, kritisch op.’ Mix van gemoedelijk en productief ‘Het meest trots ben ik op de manier waarop we met ECH samenwerken. Want dat gaat uitzonderlijk goed. Zeker als je bedenkt dat we niet alle werkdagen fysiek op kantoor bij elkaar zijn. De samenwerking verloopt heel efficiënt en flexibel en tegelijkertijd gemoedelijk en productief. Die mix vind ik persoonlijk heel fijn.’ Oud en jong gouden combinatie ‘Inmiddels werk ik al meer dan 10 jaar bij Avisi. En de laagdrempelige manier waarop we zowel intern met directe collega’s, als met de collega’s van ECH omgaan, heb ik nog niet eerder meegemaakt. Het team heeft de perfecte combinatie tussen oud en jong, is niet al te hiërarchisch ingesteld en iedereen heeft vanuit zijn eigen rol zeggenschap in het geheel. Dat maakt het werken heel plezierig: we helpen elkaar. Er speelt totaal geen politieke agenda en dat heb ik bij andere werkgevers en klanten regelmatig anders meegemaakt. De afstand tot de mensen van ECH is klein. We spreken elkaar bijna dagelijks. Naast het feit dat we veel autonomie krijgen in het uitvoeren van onze taken, challengen ze ons ook. Er is tijd voor reflectie, het maken van fouten, nadenken en verbeteren. Samenvattend vind ik deze quote passend bij hoe we werken: ‘We are doing the right things, and doing the things right’. Over ruimtevaart en djembé ‘In mijn vrije tijd lees ik veel en speel ik graag gitaar en djembé. Gelukkig is mijn werk tóch een hobby gebleven, soms tot licht ongenoegen van mijn gezin. Dit omdat ik in mijn privétijd óók nog graag aan het programmeren ben. En mijn studie sterrenkunde? Die komt me nog steeds van pas. Nog altijd ben ik met ruimtevaart bezig en volg ik de wetenschap op de voet. Samenvattend ben ik heel tevreden met hoe het allemaal gelopen is’, besluit Gert-Jan. Meer informatie Heb je vragen voor Gert-Jan, heb je ideeën of wil je meer weten over ECH, neem dan gerust contact op met ons via info@ech.nl . We staan met ons complete team áltijd voor iedereen klaar! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-23T03:26:28Z",
  "source": "ech.nl"
}