{
  "id": "f4d89fb2ea7cb175878a495e54af201a02b44169",
  "url": "https://www.ech.nl/meer-digitalisering-intense-ketensamenwerking-en-oog-voor-de-client/",
  "title": "Nick van Buitenen in de Raad van Advies van ECH - ECH",
  "text": "Nick van Buitenen in de Raad van Advies van ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Nick van Buitenen in de Raad van Advies van ECH / Hypotheekmarkt , KNB , Nieuws , Notaris , Raad van Advies , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Meer digitalisering, intense ketensamenwerking én oog voor de cliënt: daar draait het om in 2022’ ‘Zo’n 50% van al ons werk op kantoor is vastgoed gerelateerd. We werken veel met particulieren, en hebben daarom ook vaak met hypotheken en dús met ECH te maken.’ Dat zegt Nick van Buitenen , notaris bij Van Grafhorst Notarissen en lid van de Raad van Advies. Bij het kantoor, dat is gevestigd in hartje Utrecht, werken zo’n 45 mensen waaronder 15 juristen. ‘Mijn kantoor heeft ruime ervaring met ECH, daarnaast ben ik een aantal jaar als voorzitter van het KNB-bestuur actief geweest. Het zal mijn rol zijn om het belang vanuit het notariaat te behartigen binnen de Raad van Advies. Want ook dat notariële geluid moet, naast dat van de hypothecair financiers, in de Raad van Advies voldoende doorklinken. Maar hoe dat nu gaat weet ik eigenlijk niet, want ik heb pas één sessie meegemaakt’, lacht Nick. Nick van Buitenen, notaris bij Van Grafhorst Notarissen en lid van Raad van Advies ECH Ketensamenwerking meer vormgeven ‘Ik heb ja gezegd tegen deze rol omdat er een beroep op me werd gedaan. Ik hoop dat ik een steentje bij kan dragen, met name als het gaat over verdere digitalisering. Het is ook de vraag hoe je de ketensamenwerking binnen dat kader meer vorm kunt geven. ECH is immers niet nieuw meer en behoorlijk succesvol. Ook denk ik dat we aan een aantal kanten kunnen uitbreiden, met name richting de klant. Wij kijken vanuit het notariaat sowieso erg naar klantbelang. Neem nu bijvoorbeeld een hypotheekakte, als je afpelt wat deze uiteindelijk behelst, dan zouden alle hypothecair financiers prima met één of twee uniforme modelakten uit de voeten kunnen. Dat betekent minder werk voor alle betrokken partijen. En daardoor hopelijk minder kosten voor de klant.’ Mijn wens? Vereenvoudig aktes en help de cliënt ‘Wat mijn inbreng gaat zijn in de Raad van Advies? Wat mij betreft gaat ECH zich echt richten op de uniformering van de hypotheekakten. Het ligt dan voor de hand dat het regelen van de geldlening aan de hypothecair financier zelf wordt overgelaten, maar dat het vestigen van het hypotheekrecht via de notaris en ECH tot stand komt’, aldus Nick. ‘In mijn ideale wereld houdt het ECH-platform zich alleen bezig met het vestigen van een hypotheekrecht op het onroerend goed. Dit als opmaat naar een digitale hypotheekakte, waardoor ook automatische aktecontrole door de hypothecair financiers mogelijk gaat worden. Dat is nu immers nog een handmatig proces.’ ‘Als we nog beter met elkaar gaan samenwerken, zou je ook een systeem kunnen ontwikkelen waarbij de klant maar één keer al zijn documenten hoeft aan te leveren. Denk dan aan identiteitsbewijzen, werkgeversverklaringen en allerlei andere documenten die nodig zijn bij het kopen van een huis en het aanvragen van een hypotheek. Maar ook de beoordeling van de beschikkingsbevoegdheid zou al aan de voorkant kunnen plaatsvinden, dat bespaart een hoop gedoe als er iets niet goed is. Er zijn overigens al mooie initiatieven in de keten om dit op te pakken.’ ‘Het is niet nodig om angst te hebben voor de verregaande digitalisering in onze maatschappij, het biedt juist volop kansen.’ zegt Nick van Buitenen. Pas sinds 1 januari lid ‘Zoals gezegd heb ik pas aan één vergadering deelgenomen, ik heb zitting sinds 1 januari jl.. Naar mijn idee is het de rol van de RvA om gevraagd en ongevraagd advies te geven aan het bestuur en directie, waarbij er over en weer volledige transparantie is’, vervolgt Nick. ‘Ik denk dat het binnen de Raad van Advies vooral centraal moet staan om deelnemers een eigen geluid te laten hebben, en dat we vanuit daar zoveel mogelijk op één lijn proberen te komen. En dat vanuit de diversiteit die de Raad van Advies rijk is. Juist die samenwerking tussen hypothecair financiers, het notariaat en andere financiële instellingen samen met duidelijke taal, onderling vertrouwen en afstappen van eigen belang zijn daarbij belangrijke voorwaarden.’ ‘Zelf word ik enthousiast van het type vragen dat je op een feestje of bij een borrel krijgt: Waarom kan een hypotheekakte niet in duidelijke taal geschreven worden? Waarom moet ik, als ik een huis koop, zo vaak dezelfde documenten aan verschillende partijen aanleveren? Zij kunnen toch wel wat beter samenwerken? Het zijn precies die onderzoeksopdrachten die ik graag, samen met de anderen, bij de kop zou willen pakken, want elke burger is het erover eens dat dit proces efficiënter kan.’ Toegevoegde waarde binnen de Raad van Advies ‘Wanneer ik naar mezelf kijk kan ik wel vaststellen dat ik geen specialist ben. Ik ben een echte generalist en dús geneigd om me met de grote lijn te bemoeien. Vanuit die eigenschap bekijk ik een probleem vaak vanuit helikopterview. Ik geloof dat het helpt om niet op microniveau zaken op te gaan lossen, maar juist op macroniveau. Wat mij betreft gaan we ons als stichting ook nog meer inzetten als communicatiekanaal richting hypothecair financiers en bijvoorbeeld het Kadaster. Het is mooi om te zien dat we al steeds meer samenwerken met ketenpartners zoals het Hypotheken Data Netwerk en Zorgeloos Vastgoed. En van daaruit ontstaan natuurlijk prachtige initiatieven die de keten overkoepelen. Het doel is uiteindelijk om de woonreis voor de consument nog efficiënter te maken.’ De kernboodschap van Nick ‘Het is niet nodig om angst te hebben voor de verregaande digitalisering in onze maatschappij, het biedt juist volop kansen. Uiteindelijk gaat het om het verbreden van de samenwerking tussen al die verschillende partijen binnen de keten. En dat vraagt om over je eigen schaduw heen durven stappen. Want uiteindelijk gaat het niet over het belang van de betrokken ketenpartijen, maar over het belang van de klant. En dat is hetgeen we met zijn allen goed voor ogen houden bij élke stap die we zetten.’ Meer informatie Wil je meer weten over de de visie van Nick van Buitenen of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-07-07T03:24:40Z",
  "source": "ech.nl"
}