{
  "id": "f4ed44cbd52797eb8374697149a6439861021b89",
  "url": "https://www.ech.nl/succesvolle-samenwerking-tussen-ketenpartners-ech-en-knb/",
  "title": "'Degelijk, respectvol en veelzijdig, dat is voor mij ECH’, Bernadette Verberne, manager ICT en innovatie KNB én bestuurslid ECH - ECH",
  "text": "'Degelijk, respectvol en veelzijdig, dat is voor mij ECH’, Bernadette Verberne, manager ICT en innovatie KNB én bestuurslid ECH - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Degelijk, respectvol en veelzijdig, dat is voor mij ECH’, Bernadette Verberne, manager ICT en innovatie KNB én bestuurslid ECH / Bestuur , KNB , Nieuws , notarieel software leverancier , Notaris / Door echadmin ‘Het notariaat zat destijds, het zal 2013 zijn geweest, in een nogal spannende periode. Het was duidelijk dat we, onder meer vanuit het KNB-platform dat al draaide, nog meer in moesten zetten op digitalisering. Dat was ook de reden dat ik bij stichting ECH als bestuurslid aan boord kwam: ik kon, zij het in bescheiden omvang, actief meehelpen een brug te bouwen. De stichting maakte al volop gebruik van ons platform, net als dat voor veel andere applicaties gold. Het was tijd voor verdieping en verbreding.’ Dat zegt Bernadette Verberne, manager ICT en Innovatie bij de KNB én bestuurslid bij stichting ECH. ‘Kortom, er moest nagedacht worden over de toekomst. Ik vond het erg leuk om in het bestuur van ECH te stappen. Het paste ook prima bij mijn rol van manager ICT die ik binnen de KNB bekleedde. In het begin richtte deze zich vooral op beheer en ontwikkeling, maar daar kwam al snel innovatie bij. Vanaf 2019 is de portefeuille in twee gesplitst en ligt mijn focus volledig op innovatie.’ Het waaróm achter de taak ‘Bij ECH zit ik in het bestuur samen met mensen die een enorme staat van dienst hebben. En dat sluit aan bij waar ik voor sta: ik ben als mens erg gericht op vragen naar waaróm we iets doen. Want, één ding is zeker: wanneer je doet wat je altijd deed, dan gaat het nooit anders worden. Zeker in het begin, toen ECH nog in de startblokken stond, was er veel creativiteit nodig om de plannen concreet van de grond te krijgen. Maar toen de transactievolumes toenamen werd dat gemakkelijker’, aldus Bernadette. ‘En ik? Ik ervaarde vanaf het moment dat ik toetrad, een positieve mindset die gericht is op continuïteit. Inmiddels hebben we een superdegelijk product neergezet. Daar zijn we trots op, maar tegelijkertijd roept dit ook de vraag op waar we over vijf jaar willen staan. Dáár ligt onze uitdaging, want er zijn volop mogelijkheden om te verbreden en verdiepen. Wanneer je daar dieper op ingaat, dan komen er direct allerlei vraagstukken naar boven. Zo denken we vanuit onze expertise bijvoorbeeld na over uitbreiding van onze diensten in de keten.’ Digitaal vertrouwen onmisbaar ‘Er gebeurt overigens al behoorlijk wat op het vlak van digitalisering. Er is sowieso veel behoefte aan digitale dienstverlening tussen ketenpartners, maar ook richting consumenten. Verder komt de term ‘digitaal vertrouwen’ steeds terug. Aan de doorlopende ontwikkeling en het behoud van dat vertrouwen kunnen het notariaat en stichting ECH actief bijdragen. Zo is er ook nogal een aantal ontwikkelingen gaande in de vastgoedsector waarbij partijen nadenken over hoe ze op een veilige en slimme manier gegevens met elkaar kunnen uitwisselen. Voor ons als ECH ligt die vraag er natuurlijk ook: blijven we alleen bij royementen en leveringen van hypotheken of gaan we ook andere acties ondernemen, zoals bijvoorbeeld bankgaranties?’ ECH als transporteur van gevalideerde data ECH kan hoe dan ook zorgen voor het transport van gevalideerde gegevens. Denkbaar is dat ECH deze expertise inzet voor het beheer van hypotheken. Denk daarbij aan het verhogen van de hypotheek of het doorvoeren van wijzigingen in de hoofdelijke aansprakelijkheid. Een ander voorbeeld betreft het realiseren van een berichtenstandaard voor alternatieve woonvormen, een ontwikkeling die we steeds meer zien. Met het veilig uitwisselen van gecontroleerde informatie bedienen we in eerste instantie ketenpartners, want het proces wordt veiliger. Maar uiteindelijk dus ook de consument, vervolgt Bernadette. Afsprakenstelsel Zorgeloos Vastgoed ‘Het is binnen dit kader ook mooi om te melden dat de KNB meewerkt aan het afsprakenstelsel Zorgeloos Vastgoed. Dit initiatief draagt bij aan zekerheid en duidelijkheid in alle fasen van het wonen: van oriëntatie tot aan bewoning. Ook het Hypotheken Data Netwerk, het Kadaster en de NVM zijn daarbij betrokken. In het kort komt het erop neer dat je vier thema’s ‘oké’ wilt hebben: het pand, de verkoper, de koper en de financiering. Daarin komt immers alles bij elkaar. Via zijn persoonlijke kluis kan de consument gegevens delen waarmee dienstverleners aan de slag kunnen. ECH kan in dit stelsel bijvoorbeeld communicatie tussen makelaar en notaris faciliteren. Voor ECH kan het interessant zijn om mee te denken en te werken aan oplossingen voor de hele sector. Inmiddels is het initiatief zo serieus dat ook het Ministerie van BZK geïnteresseerd is. Het moet een oplossing worden die voor de hele sector zinvol is.’ Samenwerking ECH: degelijk, respectvol en veelzijdig ‘Wanneer ik de samenwerking met ECH in drie kernwoorden zou moeten beschrijven dan denk ik spontaan aan termen als degelijk, respectvol en veelzijdig. Degelijk slaat voor mij dan vooral op de stabiliteit van de stichting, de kwaliteit van de dienstverlening en het niet doen van concessies aan de manier waarop we de dienst opbouwen. Ik denk bijvoorbeeld ook aan de SOC 2-certificering. Bij de term respect denk ik aan de manier waarop er met ieders positie wordt omgegaan. Dat gebeurt altijd respectvol en het is onderling oké dat de belangen niet altijd hetzelfde zijn. Bij samenwerken tot slot merk ik dat we steeds een weg zien waarin we elkaars zienswijzen waarderen en respecteren. We zijn met mensen vanuit verschillende organisaties actief binnen stichting ECH, en dat hebben we tot nu toe kunnen doen zonder dat er al te grote conflicten ontstonden. Dat vind ik mooi. Daarnaast wil ik echt benadrukken dat directeur Lisa Huisman bijzondere kwaliteiten heeft. Zo geeft ze veel aandacht aan de relaties van ECH. Dat doet ze buitengewoon goed, want het is belangrijk voor de stichting om naar buiten te treden zodat er meer exposure komt én blijft.’ Onvermoede talenten ‘En naast de serieuze kant hebben we ook gewoon veel lol onderling. Zo vond er in het najaar van 2019 de ECH gebruikersdag plaats op Landgoed Groot Kievitsdal in Baarn. Op het programma stond onder meer de terugkoppeling van een eerder gehouden klanttevredenheidsonderzoek. De beperkte respons vormde daarbij wel een uitdaging. Zeker in combinatie met de sfeervolle maar gróte zaal… Gelukkig bleek toenmalig bestuurslid Remco van der Kuijp een onvermoed talent te hebben. Hij transformeerde zichzelf tot een fantástische quizmaster en boeide de toehoorders met zijn hilarische presentatie van de resultaten, lacht Bernadette. Tot slot… ‘Ik hoop nog lang bij de stichting betrokken te blijven en vervul mijn rol in het bestuur met veel plezier. En dat heeft niet in de laatste plaats te maken met de bestuursleden waarmee ik mag samenwerken’, besluit Bernadette. Meer informatie Wil je meer weten over de samenwerking tussen ketenpartners ECH en KNB, of heb je vragen over het bestuur van ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:39:52Z",
  "source": "ech.nl"
}