{
  "id": "f5594cb899f17e8dad3787f2e7c3a6e134c3400b",
  "url": "https://www.ech.nl/nieuwe-ech-webapplicatie-notariaat/",
  "title": "Nieuwe ECH webapplicatie voor het notariaat - ECH",
  "text": "Nieuwe ECH webapplicatie voor het notariaat - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Nieuwe ECH webapplicatie voor het notariaat / Nieuws , notarieel software leverancier , Notaris , Referenties notariaat / Door echadmin Het notariaat kan op twee manieren gebruik maken van ECH. Via een notarieel softwarepakket of via de ECH webapplicatie. De ECH webapplicatie is onlangs voorzien van een update, zowel in technisch zin als in een nieuwe look & feel. Van tekentafel naar in productie name In augustus 2020 is het project “Vernieuwing ECH internetapplicatie” van start gegaan. Normaal zitten projectleden vaak bij elkaar in de buurt, maar dat was gedurende dit project helaas niet mogelijk. “In de tijd van COVID-19 is het helaas niet mogelijk om fysiek met het projectteam bij elkaar te komen. Maar met alle digitale middelen die gelukkig beschikbaar zijn, hebben we gezamenlijk met Avisi gezorgd dat we een mooi en solide product hebben neergezet. Ik ben trots op het eindresultaat! ”, aldus Maykel van Londen, Product Owner bij ECH. “ De nieuwe ECH webcliënt is gebouwd met behulp van de nieuwste technieken, waaronder Kotlin. Die technieken zorgen dat de applicatie toekomstbestendig en goed beveiligd is. Er is slim gebruik gemaakt van de ervaring van ontwikkelaars en beheerders van de oude webcliënt. Daardoor zou de nieuwe webcliënt als de oude bekende moeten aanvoelen, maar in een nieuw jasje!” Coen Smid, ontwikkelaar bij Avisi. De verbouwing van de ECH webapplicatie heeft 5 maanden in beslag genomen. Eind februari 2021 is er een pilotperiode van start gegaan. Tijdens deze pilot heeft een select aantal notariskantoren al gebruik gemaakt van de vernieuwde ECH webapplicatie. Livegang nieuwe webapplicatie Op vrijdag 9 april 2021 is de grootschalige livegang gepland van de vernieuwde applicatie. Vanaf dat moment kan elk op ECH aangesloten notariskantoor gebruik maken van de nieuwe webapplicatie. Maykel van Londen kijkt vol goede moed uit naar deze livegang: “ Tijdens de pilotperiode zijn er geen blokkerende bevindingen boven water gekomen. De notariskantoren die mee hebben gedaan aan de pilot konden bijvoorbeeld de reeds lopende zaken gewoon zonder problemen afronden in de vernieuwde applicatie ”. Meer informatie Wil je meer weten over de vernieuwde ECH webapplicatie, of heb je vragen over de ingebruikname van de nieuwe webapplicatie? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-16T04:10:01Z",
  "source": "ech.nl"
}