{
  "id": "f65bf116bc0e001fce132d03fa673876d56c3aff",
  "url": "https://www.ech.nl/ech-soc-2-assurancerapportage/",
  "title": "ECH ontvangt SOC 2 Type II assurancerapportage - ECH",
  "text": "ECH ontvangt SOC 2 Type II assurancerapportage - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH ontvangt SOC 2 Type II assurancerapportage / Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door echadmin Goed nieuws! In navolging van de SOC 2 Type I assurancerapportage in mei 2020 heeft ECH inmiddels ook de Type II assurancerapportage in bezit. Hiermee bereikt ECH wederom een belangrijke mijlpaal in haar professionalisering. SOC 2 is een internationale standaard waarmee IT-serviceorganisaties onder andere inzicht geven in hun interne beheersingsmaatregelen ten aanzien van de beveiliging van IT-omgevingen en data. Dit gebeurt aan de hand van een audit, in het geval van ECH uitgevoerd door BDO. Belangrijke aandachtsgebieden zijn o.a. beschikbaarheid, integriteit, vertrouwelijkheid en privacy. Met een SOC 2-rapportage krijgen de op ECH aangesloten hypothecair financiers en notariskantoren inzicht in de kwaliteit van de maatregelen die ECH heeft getroffen om haar dienstverlening zo betrouwbaar mogelijk aan te bieden. Waar de auditprocedure voor een Type I een momentopname betreft, wordt door middel van een Type II assurancerapportage aangetoond dat de IT-beheersing over een bepaalde periode op orde is. Een dergelijk rapport is allesbehalve een eenmalig stempel. Het is een continu proces dat onderhevig is aan nieuwe risico’s, veranderingen in de markt, vernieuwde wet- en regelgeving en interne wijzigingen. De auditprocedure keert dan ook jaarlijks terug. BDO waardeert de onderlinge samenwerking met ECH: “De samenwerking met Stichting ECH verloopt altijd erg soepel en professioneel. Samen hebben we een mooi resultaat weten te realiseren, als gevolg van heldere afspraken, communicatie, een strakke planning en een grote inzet van alle betrokkenen om het onderzoek tot een goed einde te brengen.” Aanleiding SOC2 De laatste jaren kwamen steeds meer deelnemers van ECH met vragen op het gebied van informatiebeveiliging en cybersecurity. Toezichthouders, zoals de DNB en AFM, zijn alert op naleving van maatregelen ten aanzien van IT-beheersing, met name in de financiële dienstverlening. Begin 2019 is daarom door het bestuur van Stichting ECH besloten tot het aangaan van het SOC 2-traject. Met het verkrijgen van de Type II-rapportage hebben we het doel bereikt dat sindsdien voor ogen hadden. We nemen het rapport dan ook vol trots in ontvangst. Manager Operations Floris Beerens over het behalen van de rapportage: “Het verkrijgen van het SOC 2 type II rapport is een significante stap voorwaarts voor ECH. Met dit rapport kunnen we invulling geven aan een lang gekoesterde wens van de hypothecair financiers om inzage te krijgen in de wijze waarop wij de kwaliteit van onze dienstverlening op orde houden. We zijn blij dat we daarbij zo prettig mogen samenwerken met professionals van onze partners Avisi, KNB en Davinci. Hun bijdrage is van doorslaggevend belang geweest.” ECH wil Avisi, KNB, Davinci, BDO én de werkgroep Security & Compliance van harte bedanken voor hun bijdrage aan dit traject. Ook Compliance Officer Casper van Ginneken kijkt met volle tevredenheid terug op afgelopen jaar: “Het SOC 2 traject heeft enorm bijgedragen aan de professionalisering van ECH. Hoewel het een aanzienlijke inspanning heeft gevergd van zowel het team als onze business partners, plukken wij dagelijks de vruchten van de prettige samenwerking, betrouwbare dienstverlening en toegevoegde waarde!” Meer informatie Wil je meer weten over de maatregelen rondom risicomanagement, informatiebeveiliging en privacy of het rapport in het algemeen, neem dan contact op met ons op via info@ech.nl . Meer informatie over de SOC 2-route die door ECH is afgelegd is te lezen in dit nieuwsbericht over SOC 2 . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:04:47Z",
  "source": "ech.nl"
}