{
  "id": "f735422657428fd8b6ce9485635ee690c52ec09e",
  "url": "https://www.ech.nl/drukbezochte-ech-gebruikersdag-groot-succes/",
  "title": "Drukbezochte ECH Gebruikersdag groot succes - ECH",
  "text": "Drukbezochte ECH Gebruikersdag groot succes - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Drukbezochte ECH Gebruikersdag groot succes / Nieuws / Door Ruby Woensdag 7 november heeft de Gebruikersdag plaatsgevonden bij de Volksbank in Utrecht. Tijdens deze dag werden de hoogtepunten en belangrijke gebeurtenissen van het afgelopen jaar besproken door directeur Lisa Huisman. Zo is er een vernieuwde contracten set, is ING aangesloten v.w.b. het aflosproces en zullen Syntrus Achmea en BCMGlobal (oftewel Capita) in Q2 2018 waarschijnlijk live gaan. Leonard Wattimury liet zien hoe ECH zich op communicatie vlak ontwikkeld heeft. Afgelopen jaar zijn er meerdere publicaties en een animatiefilmpje gemaakt. Er zijn een aantal nieuwe collega’s het ECH-team komen versterken en ook heeft er een bestuurswissel plaatsgevonden: Peter Doornbos neemt het stokje over van John Buhrs. Er werd niet alleen teruggeblikt, maar vooral ook naar de toekomst gekeken. In 2018 staan er veel projecten gepland om van ECH een nog betere dienst te maken. Johan Agterberg gaf een toelichting op de plannen omtrent ECH 4.0 en Peter de Jong ging inhoudelijk in op de plannen voor een nieuwe dienst binnen ECH: Bankgaranties. Maykel van Londen liet zien hoe het certificeringsproces er in de praktijk uitziet. Ten slotte presenteerde Arjen de Bake van vereniging HDN een overzicht van de marktontwikkelingen en trends op het gebied van hypotheken en hypotheekprocessen. Tussen de bedrijven door kon er een heuse prijs gewonnen worden bij de kennisquiz welke door Jelmer Griepink werd gepresenteerd. Casper de Raad was de slimste aanwezige en ging er uiteindelijk met de dinercheque vandoor. Gefeliciteerd Casper! De middag werd gezellig afgesloten met een borrel bij Café 1817 in de Volksbank. Al met al een zeer geslaagde dag dus! Voor ECH is het zeer waardevol om directe feedback te ontvangen van haar gebruikers. Daarom willen we alle deelnemers hartelijk danken voor de aanwezigheid en gegeven input. Ook willen we de Volksbank bedanken voor het beschikbaar stellen van de locatie en het faciliteren van de techniek en catering gedurende de dag! Wij hebben ervan genoten, en kijken nu al uit naar de volgende! De slides van de presentatie kunt u hier terugvinden. Op de hoogte blijven van en meepraten over de laatste ontwikkelingen? Volg ECH op social media ( LinkedIn en Twitter ) of meld u aan voor een van de werkgroepen! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-02T04:03:58Z",
  "source": "ech.nl"
}