{
  "id": "f870d5f86e250fcb2db0e52af35d1bdcd9d45885",
  "url": "https://www.ech.nl/stichting-ech-feliciteert-blg-wonen-met-65-jarig-jubileum/",
  "title": "Stichting ECH feliciteert BLG wonen met 65-jarig jubileum - ECH",
  "text": "Stichting ECH feliciteert BLG wonen met 65-jarig jubileum - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Stichting ECH feliciteert BLG wonen met 65-jarig jubileum / Nieuws / Door Ruby In 1954 werd het bouwfonds limburgse gemeenten opgericht door de gemeentes geleen, stein, limbricht en munstergeleen. Vanuit één centrale gedachte: iedereen de kans geven om een huis te kopen. Zo helpen zij mensen al ruim 65 jaar bij het vinden van een passende hypotheek. Voor de communicatie met het notariaat werken BLG wonen en ECH al jaren samen. Stichting ECH feliciteert BLG wonen met haar 65-jarig jubileum. Positive finance award voor BLG wonen Recentelijk heeft BLG wonen met het project ‘huurverklaring’ de positive finance award gewonnen in de categorie ‘ go viral ’. De positive finance award is een award voor organisaties in de financiële sector die een positieve bijdrage leveren op het gebied van duurzaamheid, sociale impact en innovatie. De jury zei dat BLG wonen met het project ‘huurverklaring’ haar sociale kant laat zien en lef toont om juist in mogelijkheden te denken. BLG laat zien dat je als bank ook maatschappelijk betrokken kan zijn. We zijn blij met het vertrouwen dat BLG wonen al jaren aan stichting ECH geeft en zijn er trots op dat we een steentje mogen bijdragen door het berichtenverkeer tussen BLG en het notariaat te verzorgen. Dit bevordert de kwaliteit en de efficiëntie van dit deel van de hypotheekketen. Wij wensen alle medewerkers van BLG wonen een geweldig jubileum toe! Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:28:50Z",
  "source": "ech.nl"
}