{
  "id": "f899f5a867cb36674e1ac0b5684c13b9aa295b3a",
  "url": "https://www.ech.nl/nieuwe-mailadressen-voor-scf-van-rabobank/",
  "title": "Nieuwe mailadressen voor scf van Rabobank - ECH",
  "text": "Nieuwe mailadressen voor scf van Rabobank - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Nieuwe mailadressen voor scf van Rabobank / Nieuws / Door Ruby Het service centrum financieren (scf) van de Rabobank, dat onder meer de afhandeling van nieuwe hypotheken en royementen van bestaande hypotheken verzorgt, heeft nu per afdeling een apart mailadres. Zo komen vragen van notarissen sneller op de juiste afdeling terECHt. Voor vragen over de administratieve afhandeling van te verstrekken hypothecaire financieringen kan worden gemaild naar afhandelen@Rabobank.nl. Vragen over royementdossiers kunnen richting royeren@Rabobank.nl. Voor vragen over of het insturen van verzoeken voor notariële volmachten, toestemmingsverklaringen en dergelijke kunnen notarissen terECHt bij zekerheden@Rabobank.nl. Vragen over het insturen van beslagen tenslotte kunnen gesteld worden via bbscfalgemeen@Rabobank.nl. Het algemene e-mailadres, scfparticulieren@Rabobank.nl, blijft gewoon bestaan. Telefoon Bellen naar het scf kan ook: 088 7288728. Het nummer is op werkdagen bereikbaar van 10.00 tot 12.00 uur en van 14.00 tot 16.00 uur. Is er sprake van een klantdossier met spoed buiten de telefonische openingstijden? Stuur dan een e-mail, met in de onderwerpregel ‘spoed’, naar de betreffende afdeling. Vragen over het opvoeren van een dossier in ECH of foutmeldingen? Neem dan contact op met de helpdesk ECH via 070 3307135 of kijk op de website van ECH . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-19T04:04:51Z",
  "source": "ech.nl"
}