{
  "id": "fa230d9125be731de0f3589472facdc816386e53",
  "url": "https://www.ech.nl/ech-betrouwbaar-efficient-en-toekomstgericht/",
  "title": "‘ECH? Betrouwbaar, efficiënt en toekomstgericht’ - ECH",
  "text": "‘ECH? Betrouwbaar, efficiënt en toekomstgericht’ - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘ECH? Betrouwbaar, efficiënt en toekomstgericht’ / Bestuur , Hypotheekmarkt , KNB , Nieuws , Notaris , Referenties banken / Door Raymond Bloot ‘Wij zijn als hypotheekbedrijf bezig om het hypothekenproces voor onze klanten en adviseurs zoveel mogelijk te digitaliseren en te automatiseren. ECH is daarvoor een belangrijke schakel. We werken inmiddels zo’n vijf jaar met stichting ECH samen’. Aan het woord is Peter Doornbos , IT Lead Hypotheken & Consumptief Krediet bij Nationale-Nederlanden. ‘Door te automatiseren, gaat de kwaliteit van ons proces omhoog. Zo worden fouten voorkomen omdat er minder handmatig werk uitgevoerd wordt. Bovendien wordt het proces efficiënter waardoor doorlooptijden en wachttijden worden verkort. En dat doen we om onze klanten zo goed mogelijk te bedienen.’ Je ziet dat er veel druk in de markt is ontstaan, want iedereen wil bij wijze van spreken morgen zijn hypotheek geregeld hebben. Digitalisering heeft ook in onze markt een vlucht genomen door invoering van Europese privacywetgeving, hier in Nederland bekend als AVG. Je hebt goede, secure lijnen nodig waarbij je 100% veilig privacygevoelige data kunt delen.’ Peter Doornbos, IT Lead Hypotheken & Consumptief Krediet bij Nationale-Nederlanden ECH en digitalisering in optima forma ‘Mijn opdracht is om de hypotheekketen bij Nationale-Nederlanden meer digitaal te maken. En ECH is een uitstekend middel om bij te dragen aan dat doel. Uit de businesscase bleek dat deze stichting voor ons de juiste partij was’, aldus Peter. Nu werken we meer vanuit standaardisatie en structuur en komt het nauwelijks nog voor dat de middelen voor het financieren van een woning niet op tijd bij de notaris zijn. We zien dat ook terug in een hogere klanttevredenheid. Die is door de hele keten heen een stuk beter geworden.’ Geldverstrekkers en brondata ‘Daarnaast willen we in de toekomst zoveel mogelijk met brondata gaan werken, waarbij we relevante informatie dus rechtstreeks uit de bron onttrekken. Hierdoor wordt het voor de klant makkelijker en sneller omdat ze minder tijd kwijt zijn aan het aanleveren van documenten. Voor de geldverstrekker zijn de voordelen de hogere betrouwbaarheid van brondata en validaties en controles die geautomatiseerd kunnen plaatsvinden. Ook wordt het proces sneller en efficiënter’, vervolgt Peter. Bovendien wapenen we ons steeds beter tegen fraude omdat gegevens rechtstreeks vanuit de Belastingdienst, het betrokken pensioenfonds of de Basisregistratie Personen verkregen worden.’ ‘Tegenwoordig gaat het vaak om snelheid, zeker als je praat over digitalisering. En daar ligt best nog een uitdaging denk ik, al geldt dat voor zo ongeveer elke organisatie in Nederland op dit vlak’, aldus Peter Doornbos De positieve associatie met ECH ‘Als ik aan ECH denk dan komen de woorden betrouwbaar, efficiënt en ruimte voor innovatie en toekomstgerichtheid spontaan bij me op. Ik zit met plezier namens de Raad van Advies in het bestuur van ECH, want ik vind vernieuwing en innovatie belangrijk. Daarnaast is het erg leuk om mee te denken over wat de strategie dan zou moeten worden. Op een ander moment is het nodig om positief kritisch te zijn en ook die rol neem ik graag op me. Met elkaar proberen we zo actief mogelijk invulling te geven aan onze positie, waarbij we zo dicht mogelijk bij onze klanten staan. En daarnaast beseffen we als bestuur dat hypothecair financiers graag efficiënt zaken willen doen met een tevreden klant als resultaat. Eigenlijk hebben we in basis allemaal hetzelfde doel voor ogen.’ Groei in marktaandeel ‘Wanneer de rol van ECH geslaagd is? Wel, kijkend naar de marktdekking binnen het notariaat, dat op 99% ligt, zijn we daar al een heel eind op weg. Daarnaast zijn we ook aan de slag om de groei binnen de hypothecair financiers te behalen, daar kijk ik naar uit. Verder gaat het in onze gesprekken ook over de positieve beleving en de duurzame infrastructuur die ten grondslag ligt aan ECH. Het uitrollen van nieuwe processen, zoals bijvoorbeeld ontslag hoofdelijke aansprakelijkheid, het opstellen en uitvoeren van een bankgarantie of via de digitale brievenbus van ECH zaken regelen in geval van echtscheiding staan ook op de agenda. Net als andere processen trouwens, want de digitale kaders om dit mogelijk te maken staan er immers.’ Snelheid gevraagd ‘Tegenwoordig gaat het vaak om snelheid, zeker als je praat over digitalisering. En daar ligt best nog een uitdaging, al geldt dat voor zo ongeveer elke organisatie in Nederland op dit vlak’, zegt Peter. ‘En, wat ik naast alle automatiseringsslagen mooi vind om te zien, is dat de flexibiliteit er vaak nog gewoon is. Als er bijvoorbeeld tóch iets fout gaat met de betaling aan de notaris en de woning van het stel niet kan passeren omdat het geld er niet is. Omdat we dan binnen de keten met elkaar de klant niet willen teleurstellen wordt er vanuit notaris en geldverstrekker actief meegedacht om het geregeld te krijgen. En dat vind ik mooi. Het menselijke aspect blijft hoe dan ook belangrijk om zaken voor elkaar te krijgen. Gisteren. Vandaag. En in toekomst.’ Meer informatie Wil je meer weten over de visie van Peter Doornbos of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:21:15Z",
  "source": "ech.nl"
}