{
  "id": "fb845e676233f70de3c82215a516ada29b0b318d",
  "url": "https://www.ech.nl/hernieuwde-samenwerking-rnhb-en-ech-verbetert-het-pasleerproces-op-verschillende-fronten/",
  "title": "Hernieuwde samenwerking RNHB en ECH verbetert het pasleerproces op verschillende fronten - ECH",
  "text": "Hernieuwde samenwerking RNHB en ECH verbetert het pasleerproces op verschillende fronten - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X Hernieuwde samenwerking RNHB en ECH verbetert het pasleerproces op verschillende fronten / Nieuws / Door echadmin Begin 2020 zal RNHB opnieuw aansluiten op ECH. Voor RNHB en het notariaat is dit een mooie stap om het passeerproces op verschillende fronten te verbeteren. Vanaf 8 januari 2020 kan het notariaat de eerste passeeropdrachten van RNHB via ECH verwachten. De communicatie met het notariaat voor het passeerproces gaat volledig digitaal, eenduidig en betrouwbaar. Een mooie stap in het verder optimaliseren van de processen van RNHB en het blijven voldoen aan de Europese wet- en regelgeving op het gebied van veiligheid en privacy. Door deze verdere automatisering beschikken partijen over completere en meer accurate informatie, waardoor partijen sneller en flexibeler kunnen omgaan met de wensen van onze klant. RNHB hoopt zo de klant nog beter van dienst te kunnen zijn. Meer informatie Voor het notariaat zijn notarisinstructies opgesteld die zijn gepubliceerd op de website van ECH. De instructies voor RNHB kunt u hier vinden. Bij vragen over dit nieuwsbericht kunnen notariskantoren zich wenden tot de Servicedesk van Stichting ECH . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-09T04:06:46Z",
  "source": "ech.nl"
}