{
  "id": "fd41025a84c81788f1344aa062491497cb9aca5b",
  "url": "https://www.ech.nl/ech-bankenmarkt-2021/",
  "title": "ECH bankenmarkt 2021 - ECH",
  "text": "ECH bankenmarkt 2021 - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ECH bankenmarkt 2021 / KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door echadmin Jaarlijkse organiseert ECH een Gebruikersdag om de deelnemers vanuit het notariaat en hypothecair financiers alsmede andere betrokkenen bij elkaar te brengen. Ook dit jaar willen we een dergelijke bijeenkomst organiseren. Echter, gezien de ontwikkelingen rondom COVID-19, zijn we op zoek gegaan naar een gepast alternatief voor de fysieke Gebruikersdag. We organiseren daarom op woensdag 8 september 2021 in de middag een online bankenmarkt. Het doel van de online bankenmarkt is om de dialoog tussen het notariaat en de hypothecair financiers tot stand te laten komen. Bankenmarkt In 2019 hebben we de ‘ECH bankenmarkt’ voor het eerst georganiseerd. Deze is zowel door de hypothecair financiers als door het notariaat als zeer positief ervaren. De op ECH aangesloten hypothecair financiers gaan in gesprek met een beperkte groep (kandidaat-)notarissen en/of medewerkers uit het notariaat om de wederzijdse dienstverlening te verbeteren, met als doel een optimale klantbeleving. Tijdens de vorige bankenmarkt merkten we dat het notariaat en de hypothecair financiers het erg prettig vonden om met elkaar van gedachten te kunnen wisselen. Uitwisseling van ervaringen kunnen op die manier resulteren in bijvoorbeeld procesaanpassingen. Inschrijven en agenda Wij ontvangen u graag digitaal via Microsoft Teams op woensdag 8 september vanaf 14.30 uur. Graag verzoeken wij u zich voor 5 september 2021 in te schrijven via onderstaand aanmeldformulier. Als u vooraf al vragen of een bespreek onderwerp heeft voor een (of meerdere) van de hypothecair financiers, dan kunt u deze in het aanmeldformulier meegegeven: [contact-form-7 id=”3520″ title=”Aanmelden bankenmarkt 2021″] Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-05-14T09:32:41Z",
  "source": "ech.nl"
}