{
  "id": "fe793f26c0edbc3e6952f3ff3ed3176bb2df9fa0",
  "url": "https://www.ech.nl/bas-mathon-quantaris/",
  "title": "‘Het resultaat van ECH? Minder fouten, sneller werken en meer efficiëntie’, Bas Mathon, managing director Quantaris - ECH",
  "text": "‘Het resultaat van ECH? Minder fouten, sneller werken en meer efficiëntie’, Bas Mathon, managing director Quantaris - ECH Ga naar de inhoud ECH Nieuws Vacatures Inschrijven nieuwsbrief Veelgestelde vragen Inloggen Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Contact X ‘Het resultaat van ECH? Minder fouten, sneller werken en meer efficiëntie’, Bas Mathon, managing director Quantaris / Bestuur , Directie ECH , ECH medewerkers , Hypotheekmarkt , KNB , Nieuws , notarieel software leverancier , Notaris , Referenties banken , Referenties notariaat / Door Raymond Bloot ‘Het is geen toeval dat veel van onze mensen zelf uit het notariaat komen.’ Dat zegt Bas Mathon , managing director Quantaris , dienstverlener op het gebied van notariële software. ‘We ondersteunen de notarismarkt sinds 1992 bij het optimaliseren van ICT-processen. Denk aan zaken als dossiervorming, akteproductie en financiële administratie. We maken gebruik van in eigen beheer ontwikkelde software: Quantaris Beheer & Informatie Systeem (Qu-BIS). We bedienen met een kleine 20 mensen zo’n 150 notariskantoren in Nederland en ons marktaandeel schommelt zo rond de 20%. Daarbij maken we gebruik van het ECH-platform dat op het notariële Platform Elektronische Communicatie (PEC) van de Koninklijke Notariële Beroepsorganisatie (KNB) draait. Op deze wijze wordt gekoppeld met ECH en de notarisdossiers verwerkt in onze applicatie. In de praktijk betekent dit dat alle dossierwijzigingen binnen een notariskantoor dat met Quantaris werkt binnenkomen via onze software. Wij zetten deze wijzigingen geautomatiseerd om naar taken en acties voor de medewerker. Deze werkt vanuit een dashboard, een cockpit noemen we dat, van waaruit de volledige communicatie rondom een dossier plaatsvindt. Vanaf 1 juni bedienen we onze klanten overigens vanaf een nieuwe locatie, omdat we gaan verhuizen naar De Meern. Het was, mede door onze groei, tijd voor een nieuwe plek.’ Bas Mathon, Managing Director Quantaris Het leven vóór en ná ECH Bas: ‘Bedrijfsmatig handelen is een must geworden in het hedendaagse notariaat. Het is voor onze klanten belangrijk om altijd op de hoogte zijn van de ontwikkelingen om hen heen. Hierop kunnen anticiperen is gemeengoed geworden in de notarismarkt. Er is sowieso veel veranderd in de afgelopen decennia. Ook in de samenwerking met ECH. Ik heb nog meegemaakt dat we zónder ECH werkten. Maar zodra dit aangeboden werd hebben we het omarmd omdat het naadloos aansluit bij de innovatie die we continu nastreven. Voordat ECH er was werd er veel meer handmatig gewerkt. Het grootste verschil met de huidige werkwijze is dat handmatige en foutgevoelige processen vervangen zijn door geautomatiseerde koppelingen met (in de schakel daarvoor) steeds meer gevalideerde data. Daardoor kunnen deze data op een meer robuuste en betrouwbare wijze in het proces verwerkt worden. Het resultaat is minder fouten, sneller werken en meer efficiëntie. Bovendien is het werk leuker geworden, alleen al omdat je door bovengenoemde wijzigingen meer tijd en aandacht voor de klant vrij kunt maken.’ Neutraal rustpunt in het midden van het maatschappelijke speelveld ‘Dat laatste is bovendien nodig, want klanten zijn veranderd in de afgelopen jaren. De hedendaagse klant is mondiger, communicatief vaardiger en daardoor ook meer betrokken geworden bij het proces dan voorheen. Klanten zijn veeleisender, willen bijvoorbeeld weten wat er met hun gegevens gebeurt, welke effecten dat heeft en hoe ze daar invloed op uit kunnen oefenen. Ik vind dat een goede ontwikkeling, omdat dit ruimte geeft voor zowel banken als notariskantoren om hun maatschappelijke rol goed uit te bouwen. Daar liggen mooie kansen om het imago te versterken wat mij betreft. Wanneer je dit als financieel-juridische speler goed organiseert, dan ontstaat er vanuit die rol een neutraal rustpunt in het midden van het maatschappelijke speelveld.’ ECH zet mooie stappen die tot concreet resultaat leiden ‘De samenwerking met ECH verloopt goed. Er is veel contact over en weer en onze mensen gaan altijd naar de ECH-gebruikersdagen. Dat is interessant omdat daar in praktijk de verbeterde samenwerking tussen de backoffices van banken en het proces van aanleveren bij notarissen wordt besproken. Zo zien we dat banken ECH steeds meer als ideaal middel inzetten om hun eigen processen strakker georganiseerd te krijgen’, aldus Bas. ‘ECH wordt inmiddels meer en meer als een complementair product gezien in plaats van als een concurrerend product. Dat is ook te danken aan de rol die stichting ECH hier zelf in vervult. Er worden mooie stappen gezet die wij vanuit onze invalshoek concreet terugzien in de groei van het aantal labels dat aansluit. Dat geeft ons vervolgens weer mogelijkheden om de processen nóg scherper neer te zetten in de backoffice van het notariaat.’ ‘Denk hierbij aan de manier waarop banken ECH inzetten. Voorheen werd ECH vooral ingeschakeld voor enkele deelprocessen, terwijl men nu het complete aflos- en volmachtproces via ECH laat verlopen. Dat heeft te maken met het resultaat dat ECH biedt. Daar willen banken meer van ervaren. Zij hebben meer en meer het besef dat ze een onderdeel zijn in de keten, in de woonreis van de klant.’ ECH communiceert sterk vanuit een goed team ‘Verder vind ik de communicatie die ECH steeds verder uitbouwt heel sterk. De stichting is écht zichtbaar en dat zorgt er mede voor dat er nog altijd meer banken aansluiten op het platform. Bovendien is de combinatie van Lisa Huisman, Johan Agterberg, Floris Beerens en Robert Jan Pelt als nieuwe directeur Change, bijzonder waardevol. Ik zie dat ze elkaar op een mooie wijze aanvullen waardoor er een krachtig team is ontstaan.’ Ontwikkelingen in de markt ‘Het valt me op dat er binnen het notariaat een dimensie bijgekomen is; namelijk het beter omgaan met je klant en (als onderdeel daarvan) meer oog hebben voor goed relatiebeheer. Mede als gevolg van alle koppelingen binnen de keten volstaat het niet meer om alleen te kijken naar zaken als akteproductie. Communicatie, fysiek of digitaal, is een onmisbaar onderdeel geworden. De menselijke kant is daarbij belangrijk. Niet voor niets zie je dat er in de afgelopen jaren een ander type medewerker richting het notariaat is gekomen: extraverter, communicatiever en meer van mens tot mens bezig met het verzorgen van de klant. Dat is een goede ontwikkeling omdat de notariskantoren in Nederland daarmee een belangrijke speler in het maatschappelijke veld blijven. Er liggen kansen om te etaleren waarom ze, als stabiele, betrouwbare coach en adviseur, zo cruciaal zijn in de keten. Want dat zijn ze, zónder enige twijfel’, aldus Bas. Meer informatie Wil je meer weten over de de visie van Bas Mathon of over Stichting ECH? Neem dan contact met ons op via info@ech.nl . Deel dit bericht! Bericht navigatie ← Vorige Bericht Volgende Bericht → Op de hoogte blijven? Meld je aan voor de nieuwsbrief. Stichting ECH Spui 184 2511 BW Den Haag info@ech.nl 070 – 3307111 KVK-nummer 27259827 BTW-nummer 812411778B01 Voor notarissen Voor hypothecair financiers Zo werkt ECH Over ons Vacatures Contact Nieuws Veelgestelde vragen Inloggen Onderhoud & storingen © Elektronische Communicatie Hypotheken (2020). Lees hier ons Privacy Statement .",
  "retrieved_at": "2025-06-30T03:19:35Z",
  "source": "ech.nl"
}